#======================================================
# Mech01_Bullets.py
#======================================================
from 共通ユーティリティ import (
    アナログ入力測定,
    MP3_再生
    )

#======================================================
def テスト実行(new_mmp):

    MMP = new_mmp()
    MMP.通信接続()

    try:
        print("----------")
        print("JoyPad判定")
        print("----------")
        アナログ入力測定(
            MMP,
            スイッチ数  = 4     , # JoPadの縦,横,ボタンx2の計4個
            参加人数    = 1     , # 1～3人
            丸め        = 100   , # アナログ値の丸め
            繰返回数    = 100   , # アドレス切替回数
            待時間      = 0.05  , # ウェイト(秒)
        )

        print("----------")
        print("ＭＰ３再生")
        print("----------")
        MP3_再生(
            MMP,
            再生リスト= [
                (1,1),  # メインBGM：タイトル画面
                (2,1),  # メインBGM：プレイ画面：ザコキャラ
                (3,1),  # メインBGM：プレイ画面：ボスキャラ
                (1,3)   # メインBGM：終了画面
                ]
            )

    finally:
        MMP.通信切断()
