#======================================================
# Mech04_Tornado.py （共通UTのみ使用）
#======================================================
import time
from 共通ユーティリティ import (
    アナログ入力測定,
    MP3_再生        ,
    PWM_電源_ON     ,
    PWM_電源_OFF    ,
    PWM_出力
    )

#======================================================
def テスト実行(new_mmp):

    MMP = new_mmp()
    MMP.通信接続()

    try:
        print("--------")
        print("スイッチ")
        print("--------")
        アナログ入力測定(
            MMP,
            スイッチ数  = 4     , # 押しスイッチ×4
            参加人数    = 1     , # 1人専用
            丸め        = 50    , # アナログ値の丸め
            繰返回数    = 100   , # アドレス切替回数
            待時間      = 0.1   , # ウェイト(秒)
        )

        print("--------")
        print("人形の脚")
        print("--------")
        print("-> 屈伸(足上げ;DCモータON)")
        PWM_電源_ON(MMP, 0)     # ON（4095）
        time.sleep(2)
        print("-> まっすぐ(足さげ;DCモータOFF)")
        PWM_電源_OFF(MMP, 0)    # OFF（0）

        print("------------")
        print("鉄棒のロック")
        print("------------")
        print("-> 解除(サーボモータHIGH)")
        PWM_出力(MMP, 1, 160)
        time.sleep(2)
        print("-> ロック(サーボモータLOW)")
        PWM_出力(MMP, 1, 100)
        time.sleep(2)
        print("-> 解除(サーボモータHIGH)")
        PWM_出力(MMP, 1, 160)

        print("----------")
        print("ＭＰ３再生")
        print("----------")
        MP3_再生(
            MMP,
            再生リスト=[
                (4,1),  # メインBGM：タイトル画面
                (4,2),  # メインBGM：プレイ画面
                (4,3)   # メインBGM：終了画面
                ]
            )

    finally:
        MMP.通信切断()
