#======================================================
# Mech03_Hunter.py
#======================================================
import time
from 共通ユーティリティ import (
    アナログ入力測定,
    MP3_再生        ,
    PWM_電源_ON     ,
    PWM_電源_OFF
    )

#======================================================
def テスト実行(new_mmp):

    print("####################")
    print("#                  #")
    print("#  03:MECH HUNTER  #")
    print("#                  #")
    print("####################")
    MMP = new_mmp()
    MMP.通信接続()

    #======================================================
    try:
        print("--------")
        print("Power ON")
        print("--------")
        PWM_電源_ON(MMP, (0, 1)) # カモロボ2体
        time.sleep(3)            # カモロボの安定待ち

        print("-----------")
        print("Hit(ANA-IN)")
        print("-----------")
        アナログ入力測定(
            MMP,
            スイッチ数  = 1     , # カモロボのベロスイッチ1個
            参加人数    = 2     , # 1～2人
            丸め        = 50    , # アナログ値の丸め
            繰返回数    = 100   , # アドレス切替回数
            待時間      = 0.05  , # ウェイト(秒)
            )

        print("----------")
        print("Power OFF")
        print("----------")
        PWM_電源_OFF(MMP, (0, 1)) # カモロボ2体

        print("--------")
        print("BGM(MP3)")
        print("--------")
        MP3_再生(
            MMP,
            再生リスト= [
                (3,1),  # メインBGM：タイトル画面
                (3,2),  # メインBGM：プレイ画面
                (3,3)   # メインBGM：終了画面
                ]
            )

    finally:
        try: PWM_電源_OFF(MMP, (0, 1)) # カモロボ2体
        except Exception: pass
        MMP.通信切断()
