#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能(表現プロセス)のアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self, 引数_上位): #① 上位のコンポジットクラス
        #┬
        #○データセット(コンポジット)のリファレンスを用意する
        self._仕様 = 引数_上位.仕様
        self._情報 = 引数_上位.情報
        #│
        #≫データセットを用意する
        self.仕様  = 仕様()
        self.情報  = 情報()
        #┴

    #┌───────────────────────────────────
    #│プロセス機能を実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●画面で表現する
        self.Fn画面()
        #│
        #●物理体で表現する
        self.Fn物理体()
        #┴

    #┌───────────────────────────────────
    #│画面で表現
    #└───────────────────────────────────
    def Fn画面(self):
        #┬
        #○タイトル画像を表示する
        pyxel.blt(0,0, 1, 0,0, 180,120, 0)
        #│
        #○開始ガイダンスを表現する
        文字 = "PUSH GREEN BUTTON TO START"
        pyxel.text(41,113, 文字, 0)
        pyxel.text(40,113, 文字, pyxel.frame_count % 16)
        #┴

    #┌───────────────────────────────────
    #│物理体で表現
    #└───────────────────────────────────
    def Fn物理体(self):
        pass
