// filename : Dep_Contact/template/addon/Slot.h
//========================================================
// 接客部門／操作手順書(抽象クラス)：スロット機能
//--------------------------------------------------------
// Ver 1.4.0 (2026/10/09)
//========================================================

//========================================================
//§接続管理
//========================================================
  //───────────────────────────
  // 基本情報
  //───────────────────────────
  struct T_SLOT {
    bool          used      = false; // 使用状況
    T             CONN             ; // 接続識別子(テンプレート)
    unsigned long timeStamp = 0    ; // タイムスタンプ
  };

  int     SLOTs = 0;
  T_SLOT* TBL   = nullptr;

  //───────────────────────────
  // スロット内容をセット
  //───────────────────────────
  void SLOT_SET(
    int argSID, // スロットID
    T   argConn // 接続識別子(テンプレート)
  ) {
    //┬
    //○スロット内容をセット
    TBL[argSID].used      = true    ; // 有効性[ON]
    TBL[argSID].CONN      = argConn ; // 接続識別子を反映
    TBL[argSID].timeStamp = millis(); // タイムスタンプを更新
    //┴
  } /* SLOT_SET() */

  //───────────────────────────
  // スロットIDを取得
  //------------------------------------------------------
  // 戻り値：スロットID（数値型）
  // ・0～：スロットID
  // ・-1 ：該当なし
  //───────────────────────────
  int SLOT_GET_ACTIVE(const T& argConn) {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //◎┐スロットを走査
    int  ID = 0;
    for (ID = 0; ID < SLOTs; ID++) {
      //│＼（すべて走査し終えた場合）
      //│ ▽完了：走査を終了
      //│
      //○スロット状態を確認
      if (TBL[ID].CONN == argConn && TBL[ID].used) break;
      //│＼（該当するスロットにヒットした場合）
      //│ ▽完了：走査を終了
      //┴
    } ///～for
    //┴
  //│
  //○┐【後処理】
    //▼返却
    return (ID < SLOTs) ? ID : -1;
  //┴
  } /* SLOT_GET_ACTIVE() */

  //───────────────────────────
  // スロットIDを取得
  //----------------------------------
  // 戻り値：スロットID（数値型）
  // ・0～：正常終了（スロットID）
  // ・-1 ：該当なし
  //───────────────────────────
  int SLOT_GET_FREE() {
    //┬
    //○┐【前処理】
      //┴
    //│
    //○┐【主処理】
      //◎┐スロットを走査
      int  ID = 0;
      for (ID = 0; ID < SLOTs; ID++) {
        //│＼（すべて走査し終えた場合）
        //│ ▽完了：走査を終了
        //│
        //○スロット状態を確認
        if (!TBL[ID].used) break;
        //│＼（該当するスロットにヒットした場合）
        //│ ▽完了：走査を終了
        //┴
      } ///～for
      //┴
    //│
    //○┐【後処理】
      //▼返却
      return (ID < SLOTs) ? ID : -1;
    //┴
  } /* SLOT_GET_FREE() */

  //───────────────────────────
  // 古いスロットIDを取得
  //----------------------------------
  // 戻り値：スロットID（数値型）
  // ・0～：スロットID
  //───────────────────────────
  int SLOT_GET_OLD() {
    //┬
    //○┐【前処理】
      //┴
    //│
    //○┐【主処理】
      //◎┐最古のスロットIDを取得
      int oldID = 0;
      unsigned long oldTime = TBL[0].timeStamp;
      for (int ID = 1; ID < SLOTs; ID++) {
        //│＼（すべて走査し終えた場合）
        //│ ▽完了：走査を終了
        //│
        //◇┐スロット状態を確認
        if (TBL[ID].timeStamp < oldTime) {
            oldID   = ID;
            oldTime = TBL[ID].timeStamp;
          //┴
        //┴
        } //～if
      } //～for
      //┴
    //│
    //○┐【後処理】
      //▼返却：該当なし
      return oldID;
    //┴
  } /* SLOT_GET_OLD() */