// filename : Dep_Contact/template/addon/Task.h
//========================================================
// 接客部門／操作手順書(抽象クラス)：タスク機能
//--------------------------------------------------------
// Ver 1.4.0 (2026/10/08)
//========================================================

//========================================================
//§受信処理（FreeRTOS用）
//========================================================
  //───────────────────────────
  // 受信処理の定義
  // ※通信アダプタで必ず実装する
  //───────────────────────────
  virtual void ON_RECIVE() = 0;

  //───────────────────────────
  // 受信処理のループ
  //───────────────────────────
  template <typename Self>
  static void LOOP_RECIVE(Self* self) {
    for (;;) {
      if (self) self->ON_RECIVE();        // タスク関数
      vTaskDelay(1 / portTICK_PERIOD_MS); // 短いウェイト
    } //～for
  } /* RunStreamLoop() */

  //───────────────────────────
  // 受信処理の並列タスク関数
  // ※抽象クラスで必ず実装する
  //───────────────────────────
  /*
  static void TASK_RECIVE(void *pvParameters) {
    auto* self = static_cast<"抽象クラス名"<T>*>(pvParameters);
    LOOP_RECIVE(self);
  } // TASK_RECIVE()
  */

  //───────────────────────────
  // 並列処理を開始
  //───────────────────────────
  TaskHandle_t MY_TASK = NULL;  // タスク識別(並列処理)
  void RUN_TASK(int argAID) {
    //┬
    //○受信タスクをFreeRTOSの別スレッドとして起動（自動コア割当）
    xTaskCreate(
      TASK_RECIVE           , // 実行するタスク関数
      String(argAID).c_str(), // タスク名（デバッグ用）
      4096                  , // スタックサイズ（バイト単位）
      this                  , // パラメータ
      2                     , // 優先度
      &MY_TASK                // タスク識別を取得
    ); // xTaskCreate()
    //┴
  } /* RUN_TASK() */