#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：タイトル画面(描画機能)
#┠─────────────────────────────────────
#┃描画コントローラが描画プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
from main.データセット  import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 描画クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #〇画面を描画する
        pyxel.blt(0,10, 2, 0,0, 119,79, 0)
        pyxel.blt( 8,77, 0, 0,0,  50,49, 7)
        pyxel.blt(62,77, 0, 0,64, 50,99, 7)

        描画文字 = "Please select the number"
        縦 = 132
        pyxel.text(14, 縦  , 描画文字, 5)
        pyxel.text(13, 縦-1, 描画文字, 7)

        描画文字 = " of players per team"
        縦 = 140
        pyxel.text(19, 縦  , 描画文字, 5)
        pyxel.text(18, 縦-1, 描画文字, 7)

        描画文字 = "press key:[1][2][3][4]"
        縦 = 150
        pyxel.text(18, 縦, 描画文字, 8)
        pyxel.text(17, 縦, 描画文字, 7)
