#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：タイトル画面(描画機能)
#┠─────────────────────────────────────
#┃描画コントローラが描画プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
from main.データセット  import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 描画クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #〇画面を描画する
        pyxel.blt(1,5, 2, 0,0, 15*8-1,11*8-1, 15)

        左1  = 5
        左2  = 31
        改行 = 9

        描画文字 = "<< Select the team 1 or 2 >>"
        縦 = 96
        pyxel.text(左1  , 縦  , 描画文字, 5)
        pyxel.text(左1-1, 縦-1, 描画文字, 7)
