#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：タイトル画面(移動機能)
#┠─────────────────────────────────────
#┃更新コントローラが移動プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import  pyxel
import  main.GAME共通                   as 共通処理
from    main.データセット               import データセット as DS
from    main.オブジェクト.キャラ.発電機 import 発電機生成
from    main.オブジェクト.キャラ.運搬機 import 運搬機生成
from    ..DB                            import シーンID

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:
    #--------------------------------------------------------------------
    # カウンタ
    #--------------------------------------------------------------------
    #□持続時間  ：終了画面を持続する長さ（単位：fps）
    持続時間    = 20
    人数選択一覧  = {
        pyxel.KEY_1: 1,
        pyxel.KEY_2: 2,
        pyxel.KEY_3: 3,
        pyxel.KEY_4: 4
        }

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報クラス:
    #--------------------------------------------------------------------
    # カウンタ
    #--------------------------------------------------------------------
    #□開始時間  ：終了画面を持続するカウンタ
    開始時間            = 0
    フィールドリスト    = (0,1)
    ペダルリスト        = (None,None,None,None,None,None,None,None)

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 移動クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #〇個体オブジェクトのリファレンスを用意する
        self.仕様  = 仕様クラス()
        self.情報  = 情報クラス()
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def Fn人数選択(self,引数_人数):
         if pyxel.btnr(引数_人数) and 引数_人数 in self.仕様.人数選択一覧:
            DS.情報.人数 = self.仕様.人数選択一覧[引数_人数]

    def 実行(self):
        #┬ 
        if DS.情報.人数 == 0:
            人数一覧 = self.仕様.人数選択一覧.keys()
            for 人数 in 人数一覧:
                self.Fn人数選択(人数)
        #│
        if DS.情報.人数 == 0: return
        #│
        #◇┐終了画面を開始する
        if self.情報.開始時間 == 0:
        #　├┐（待ちを開始する場合）
            #↓
            #●取得音止める
            pyxel.stop()
            #│
            #○持続カウントを開始する
            self.情報.開始時間   = pyxel.frame_count
            #┴
        #　└┐（その他）
            #┴
        #│
        #●取得音を鳴らす
        if pyxel.frame_count % 5 == 0: 共通処理.効果音.アイテム取得()
        #│
        #◇┐次のシーンに進行する
        経過時間 = pyxel.frame_count - self.情報.開始時間
        時間あり = (経過時間 < self.仕様.持続時間)
        if 時間あり: return
        #│＼（まだ時間がある場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #●運搬機オブジェクトを生成する
        運搬機生成(9,(2,3))
        運搬機生成(8,(0,1))
        #│
        #●発電機オブジェクトを生成する
        チーム1 = [] 
        チーム2 = [] 
        for i in range(DS.情報.人数):
            チーム1.append(i)
            チーム2.append(i + DS.情報.人数)
        print(チーム1)
        print(チーム2)
        発電機生成(チーム2)
        発電機生成(チーム1)
        #│
        #○ゲーム情報をリセットする
        #○シーンを『プレイ画面』に進行する
        #●BGMを鳴らす
        DS.情報.プレイ時間  = DS.仕様.ゲーム.プレイ時間
        DS.情報.シーン = シーンID.プレイ画面
        共通処理.BGM.自動選択()
        共通処理.入出力.MMP.PWM_VALUE(1, 3000)
        共通処理.入出力.MMP.PWM_VALUE(2, 3000)
        #┴