#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：更新
#┠─────────────────────────────────────
#┃移動プロセス➡発射プロセス➡衝突プロセス➡出現プロセスの順に
#┃実行する
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import  main.GAME共通                   as 共通処理
from .P移動 import P移動生成
from .P救出 import P救出生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫更新アクションの一覧を作る
        self.アクション一覧 = (P移動生成(), P救出生成()) 
        #┴

	#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	#┃機能をコントロール
	#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
    def 実行(self):
        #┬
        共通処理.入出力.MMP.アナログ読取()
#        print("取得値：",共通処理.入出力.MMP.mmpAnaVal)
        #◎└┐アクションを実行する
        for 各アクション in self.アクション一覧:
            #│＼（すべての処理を終えた場合）
            #│ ↓
            #│ ▼繰り返し処理を抜ける
            #│
            #●キャラクタを更新する
            if 各アクション is not None: 各アクション.実行()
        #┴ 	┴