// filename : Dep_Contact/template/_index.h
//========================================================
// 接客部門／業務設計(抽象クラス)：目次
//--------------------------------------------------------
// Ver 1.4.0 (2026/10/09)
//========================================================
#pragma once

//========================================================
//§担当名簿
//========================================================
  #include "api.h"    // 基本
  #include "apiQ.h"   // 非同期受信
  #include "apiTQ.h"  // 単一接続・非同期受信
  #include "apiTS.h"  // 複数常時接続
  #include "apiTSQ.h" // 複数常時接続・非同期受信