// filename : Dep_Contact/template/api.h
//========================================================
// 接客部門／窓口設計(抽象クラス)：基本型
//--------------------------------------------------------
// Ver 1.4.0 (2026/10/09)
//========================================================
#pragma once

// クラス：非テンプレート
// ※テンプレートを意識せずにインスタンス化するため
class AD {
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//【公開機能】
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
public:
  //======================================================
  //§デストラクタ
  //======================================================
  virtual ~AD() = default;

  //======================================================
  //§ポーリング用ハンドル
  //======================================================
  virtual void handle() = 0;
  //┴
};

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス：基本型
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
template <typename T>
class AD_API : public AD {
protected:
  MmpContext& ctx;    // コンテクスト(参照)
  const int   MY_AID; // 通信アダプタID

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//【公開機能】
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
public:
  //======================================================
  //§コンストラクタ/デストラクタ
  //======================================================
  AD_API(
    MmpContext& argCtx, // コンテクスト（参照）
    int         argAid  // 通信アダプタID
  ) :
    ctx(argCtx),        // コンテクスト
    MY_AID(argAid)      // 通信アダプタID
  {}

  virtual ~AD_API() override {}

  //======================================================
  //§ポーリング用ハンドラ
  //======================================================
   void handle() override = 0; // 実行ハンドル

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//【非公開機能】
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
protected:
  //========================================================
  //§開始処理・終了処理
  //========================================================
    //───────────────────────────
    // 開始処理：コンストラクタ
    //───────────────────────────
    virtual String CONSTRACT() {
      Log::prtln(RCD::ERR_SYS); // システムエラーログ出力
      return RCD::ERR_SYS;      // システムエラーMSGを返却
    }; /* CONSTRACT() */

    //───────────────────────────
    // 終了処理：スレーブのアダプタにリクエストを送信する
    //───────────────────────────
    //virtual void SEND_REQUEST()
    //※分割ファイル（ブリッジ用）で実装

    //───────────────────────────
    // 終了処理：接続元に処理結果を送信する
    //───────────────────────────
    virtual void SEND_RESULT(T argConn){
      Log::prtln(RCD::ERR_SYS); // システムエラーログ出力
    }; /* SEND_RESULT() */

  //========================================================
  //§ハンドル補助
  //========================================================
    //───────────────────────────
    // 一般用：追加事項 ※SETUP()に包括される
    //------------------------------------------------------
    //【戻り値】進行判定
    // true ：進行NG
    // false：進行OK
    //───────────────────────────
    virtual bool SETUP_OPTION() {return false;}

    //───────────────────────────
    // 一般用：本体
    //------------------------------------------------------
    //【戻り値】進行判定
    // true ：進行NG
    // false：進行OK
    //───────────────────────────
    bool SETUP() {
      //┬
  //──────────────────
  //➡WiFi利用
  //・WiFiの起動が必要
  #ifdef USE_WiFi
  //------------------------------------
      //●WiFiの接続状況を確認する
      if (!devWiFi::ENABLED_CONN(true)) return true;
      //│
  //------------------------------------
  #endif //➡WiFi利用
  //──────────────────
      //●追加事項を確認する
      return SETUP_OPTION();
      //┴
    } /* SETUP() */

    //───────────────────────────
    // 処理フローを制御
    //------------------------------------------------------
    //【戻り値】進行判定
    // true ：進行NG
    // false：進行OK
    //───────────────────────────
    //virtual bool WORKFLOW()
    //※分割ファイル（ブリッジ用）で実装

    //───────────────────────────
    // 主処理を実行
    //------------------------------------------------------
    //【引数】
    // argConn：接続識別子
    //------------------------------------------------------
    //【戻り値】進行判定
    // true ：進行NG
    // false：進行OK
    //───────────────────────────
    //virtual bool RUN_PROCESS(T& argConn)
    //※分割ファイル（各モード別）で実装

  //========================================================
  //§インクルード（モード別）
  //========================================================
  #if   MODE == MODE_MAIN
    // 関数：RUN_PROCESS()
    #include "mode/Main.h"

  #elif MODE == MODE_SUB
    // 関数：RUN_PROCESS()
    #include "mode/Sub.h"

  #elif MODE == MODE_BRIDGE
    // 関数：RUN_PROCESS(),SEND_REQUEST(),WORKFLOW()
    #include "mode/Bridge.h"

  #endif

}; /* class AD_API */