#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

#────────────────────────────────────    
class シーンID():
	タイトル画面 = 100
	プレイ画面   = 200
	終了画面     = 900

#────────────────────────────────────    
class ハード():
    HC4067の個数 = 2    # ペダルの左右で2個
    HC4067のCh数 = 10   # ペダルx8台＋恐竜ランドx2基
    HC4067の丸め = 100

#────────────────────────────────────    
class リソース_画面():
    幅 = 180
    高 = 120

class リソース():
    画面     = リソース_画面()

#────────────────────────────────────    
class BGM():
    #□ＳＤカードの対応フォルダ
    #※<シーンID>:<フォルダ番号>)
    フォルダNo一覧 = {
         シーンID.タイトル画面   : 1,
         シーンID.プレイ画面     : 1,
         シーンID.終了画面       : 1}

    #□各レベルのＳＤカードの対応ファイル
    #※<シーンID>:(<ファイル番号>,<音量>,<時間(秒数)>)
    通常 = {
        シーンID.タイトル画面 : (1,15,45),
        シーンID.プレイ画面   : (2,15,80),
        シーンID.終了画面     : (3,15,58)}

    #□レベル別の対応ファイルセット
    ファイルNo一覧 = [通常]


#────────────────────────────────────    
class 本体():

	#□バージョン
    バージョン = "MECH HUNTER : Ver.2025/08/08-00"

	#□シーンＩＤ
    シーンID   = シーンID()

	#□ハード設定
    ハード = ハード()

	#□リソース設定
    リソース = リソース()

	#□シーン別ＢＧＭ
    BGM     = BGM()

	#□ゲーム条件
    プレイ時間  = 2000 # 単位：フレーム、標準：2000 
    プレイ時間  = 200 # 単位：フレーム、標準：2000 
