#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

#────────────────────────────────────    
class システム():
    番号 = 3
    名称 = "MECH HUNTER"
    版数 = "2025/08/10-00"

#────────────────────────────────────    
class シーンID():
	タイトル画面 = 100
	プレイ画面   = 200
	終了画面     = 900

#────────────────────────────────────    
class ハード():
    HC4067の個数 = 2    # ペダルの左右で2個
    HC4067のCh数 = 10   # ペダルx8台＋恐竜ランドx2基
    HC4067の丸め = 100

#────────────────────────────────────    
class リソース_画面():
    幅 = 180
    高 = 120

class リソース():
    画面     = リソース_画面()

#────────────────────────────────────    
class BGM():
    #□ＳＤカードの対応フォルダ
    #※<シーンID>:<フォルダ番号>)
    レベル一覧 = {
        シーンID.タイトル画面   : 0,
        シーンID.プレイ画面     : 0,
        シーンID.終了画面       : 0}

    #□各レベルのＳＤカードの対応ファイル
    #※<key>:(<ファイルNo>,<音量>,<時間(秒数)>)
    #　・ファイルNo：0=デフォルト(keyと同値で処理する)
    #　・音量　　　：0=デフォルト(規定音量で処理する)
    通常 = {
        シーンID.タイトル画面 : (1,0),
        シーンID.プレイ画面   : (2,0),
        シーンID.終了画面     : (3,0)}

    #□音量の規定値
    規定音量 = 15

    #□レベル別の対応ファイルセット
    ファイルNo一覧 = [通常]


#────────────────────────────────────    
class 本体():

    #□システム概要
    システム    = システム()
 
    #□ゲーム構成
    シーンID    = シーンID()
    プレイ時間  = 2000 # 単位：フレーム、標準：2000 

    #□ゲーム資源
    BGM         = BGM()
    リソース    = リソース()
    ハード      = ハード()
