#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

#────────────────────────────────────    
class シーンID():

	#□シーンＩＤ
	タイトル画面 = 100
	プレイ画面   = 200
	終了画面     = 900


#────────────────────────────────────    
class ハード設定():

	#□ＭＭＰ初期設定
    HC4067の個数 = 1
    HC4067のCh数 = 8
    HC4067の丸め = 10

#────────────────────────────────────    
class 本体():

	#□シーンＩＤ
    シーンID   = シーンID()

	#□ハード設定
    ハード設定 = ハード設定()

	#□Ｐｙｘｅｌ画面
    画面幅      = 180
    画面高      = 120

	#□ゲーム条件
    プレイ時間  = 2000 # 単位：フレーム、標準：2000 

	#□シーン別ＢＧＭ
    #　※<シーンID>:(<ファイル番号>,<音量>,<秒数>)
    BGM一覧 = {
        シーン.タイトル画面 : (1,15,45),
        シーン.プレイ画面   : (2,15,80),
        シーン.終了画面     : (3,15,58)}