#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃ゲーム共通部品
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [アプリ共通]
import MMP

# [ゲーム共通]
from main.データセット import DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃ＭＭＰデバイス
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
def 電飾制御(引数_活性可否): #① True:活性化／False:非活性化
    #┬
    #○コンテナを確認する
    if len(DS.obj.カモロボ) == 0: return
    #│＼（コンテナが空の場合）
    #│ ↓
    #│ ▼処理を中断する
    #│
    #○引数に応じてPWM値を設定する
    PWM値 = (4095) if 引数_活性可否 else (-1)
    #│
    #≫カモロボの電飾を活性制御する
    for i in range(2):
        for 各ポート in DS.obj.カモロボ[i].仕様.ポート一覧:
            MMP.接続.PWM_VALUE(各ポート, PWM値)
            print("カモロボ(",i,")：",引数_活性可否)
    #┴