#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃共通処理
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from .データセット import データセット as DS
from .汎用部品     import MMP本体

class カモロボ():
	#────────────────────────────────────
    def 停止():
		#┬
        #○コンテナを確認する
        if len(DS.obj.カモロボ) == 0: return
        #│＼（コンテナが空の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #●運搬機の全機能を停止する
        カモロボ.電飾制御(False)
        #┴
	#────────────────────────────────────
    def 電飾制御(引数_活性可否): #① True:活性化／False:非活性化
		#┬
        if len(DS.obj.カモロボ) == 0: return
        #│
        #○引数に応じてPWM値を設定する
        PWM値 = (4095) if 引数_活性可否 else (-1)
        #│
        #≫運搬機の電飾を活性制御する
        for i in range(2):
            for 各ポート in DS.obj.カモロボ[i].仕様.ポート一覧:
                MMP本体.MMP.PWM_VALUE(各ポート, PWM値)
                print("カモロボ(",i,")：",引数_活性可否)
        #┴