#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

#────────────────────────────────────    
class シーンID():

	#□シーンＩＤ
	タイトル画面 = 100
	プレイ画面   = 200
	終了画面     = 900

#────────────────────────────────────    
class ハード設定():

	#□ＭＭＰ初期設定
    HC4067の個数 = 4
    HC4067のCh数 = 1
    HC4067の丸め = 10

	#□スイッチ
    スイッチ閾値 = 800  # MMPのVcc(3.3V)を基準にしたスイッチの閾値

	#□CA9685のチャンネル
    装置No_屈伸  = 0    # チャンネル0：選手脚屈伸：ＤＣモータ
    装置No_着地  = 1    # チャンネル1：鉄棒ロック：サーボモータ

	#□サーボモータ
    サーボ最小   = 100  # 鉄棒をロック
    サーボ最大   = 160  # 鉄棒を回転可

	#□ＤＣモータ
    モータ最小   = -1   # 選手の脚をまっすぐ
    モータ最大   = 4095 # 選手の脚を屈伸

#────────────────────────────────────    
class 本体():

	#□バージョン
    バージョン = "Ver.2025/08/08-00"

	#□シーンＩＤ
    シーンID   = シーンID()

	#□ハード設定
    ハード設定 = ハード設定()

	#□Ｐｙｘｅｌ画面
    画面幅     = 180
    画面高     = 120

	#□ゲーム条件
    プレイ時間 = 1500 # 単位：フレーム ※標準:1500

	#□シーン別ＢＧＭ
    #　※<シーンID>:(<ファイル番号>,<音量>,<秒数>)
    BGM一覧 = {
        シーンID.タイトル画面 : (1,15,168),
        シーンID.プレイ画面   : (2,15,240),
        シーンID.終了画面     : (3,15,240)}
