#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

#────────────────────────────────────    
class システム():
    番号 = 4
    名称 = "MECH TORNADO"
    版数 = "2025/08/10-00"

#────────────────────────────────────    
class シーンID():

	#□シーンＩＤ
	タイトル画面 = 100
	プレイ画面   = 200
	終了画面     = 900

#────────────────────────────────────    
class ハード():

	#□ＭＭＰ初期設定
    HC4067の個数 = 4
    HC4067のCh数 = 1
    HC4067の丸め = 10

	#□スイッチ
    スイッチ閾値 = 800  # MMPのVcc(3.3V)を基準にしたスイッチの閾値

	#□CA9685のチャンネル
    装置No_屈伸  = 0    # チャンネル0：選手脚屈伸：ＤＣモータ
    装置No_着地  = 1    # チャンネル1：鉄棒ロック：サーボモータ

	#□サーボモータ
    サーボ最小   = 100  # 鉄棒をロック
    サーボ最大   = 160  # 鉄棒を回転可

	#□ＤＣモータ
    モータ最小   = -1   # 選手の脚をまっすぐ
    モータ最大   = 4095 # 選手の脚を屈伸
#────────────────────────────────────    
class リソース_画面():
    幅 = 180
    高 = 120

class リソース():
    画面     = リソース_画面()

#────────────────────────────────────    
class BGM():
    #□ＳＤカードの対応フォルダ
    #※<シーンID>:<フォルダ番号>)
    レベル一覧 = {
         シーンID.タイトル画面   : 0,
         シーンID.プレイ画面     : 0,
         シーンID.終了画面       : 0}

    #□各レベルのＳＤカードの対応ファイル
    #※<key>:(<ファイルNo>,<音量>,<時間(秒数)>)
    #　・ファイルNo：0=デフォルト(keyと同値で処理する)
    #　・音量　　　：0=デフォルト(規定音量で処理する)
    通常 = {
        シーンID.タイトル画面 : (1,15,168),
        シーンID.プレイ画面   : (2,15,240),
        シーンID.終了画面     : (3,15,240)}

    #□音量の規定値
    規定音量 = 15

    #□レベル別の対応ファイルセット
    ファイルNo一覧 = [通常]

#────────────────────────────────────    
class 本体():

    #□システム概要
    システム    = システム()

    #□ゲーム構成
    シーンID    = シーンID()
    プレイ時間  = 1500 # 単位：フレーム ※標準:1500

    #□ゲーム資源
    BGM         = BGM()
    リソース    = リソース()
    ハード      = ハード()
