// filename : Dep_Connect/adapter/UDP/UDP.cpp
//========================================================
// 接続部門／担当：UDP（ベース）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/29)
//========================================================
//┬
//□┐インクルード
  //□Arduinoシステム
  #include <WiFiUdp.h>
//┴┴

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス【非同期キュー型＋接続スロット型
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class  AD_UDP : // 接続識別子：String
public AD_API_Queue<String>, // 非同期キュー型
public AD_API_Slot< String>  // 接続スロット型
{
private:
//========================================================
//§基本情報
//========================================================
  WiFiUDP MY_NET        ; // クライアント・サーバ両用(実体)
  int     MY_PORT = 8083; // ポート番号

//========================================================
//§各種ヘルパ
//========================================================
  //───────────────────────────
  // 接続識別子を求める
  //───────────────────────────
  static String getConn(
    const IPAddress& argIP,
    uint16_t         argPORT
  ) {return argIP.toString() + ":" + String(argPORT);}

//========================================================
//§接続管理
//========================================================
  //───────────────────────────
  // 処理対象の接続スロットを割当てる
  //------------------------------------------------------
  // 戻り値 ：スロットID（数値）
  //───────────────────────────
  int SLOT_ASSIGN(const String& argConn) {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //●既存スロットを求める
    int ID             = SLOT_GET_ACTIVE(argConn);
    if (ID<0) {
      // ＼（該当する既存スロットがない場合）
        //●空スロットから求める
        ID             = SLOT_GET_FREE();
        if (ID < 0) ID = SLOT_GET_OLD ();
        // ＼（該当する空スロットがない場合）
          //●古いスロットから求める
          //┴
        //│
        //●割当スロットに内容をセットする
        SLOT_SET(ID, argConn);
        //┴
    } //～if 
    //│
    //○タイムスタンプを更新する
    TBL[ID].timeStamp = millis();
    //┴
  //│
  //○┐【後処理】
    //▼返却：スロットID
    return ID;
  //┴
  } /* SLOT_ASSIGN() */

//========================================================
//§受信処理
//========================================================
  //───────────────────────────
  // 並列処理の内容を定義
  //───────────────────────────
  void ON_RECIVE() override final {
  //┬
  //○┐【前処理】
    //○受信内容を確認する
    int packetSize = MY_NET.parsePacket();
    if (packetSize < 1) return;
    //│＼（パケット内容が[空]の場合）
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //○┐フレーム求める
      //●接続情報を用意する
      IPAddress qIP   = MY_NET.remoteIP()  ; // IPアドレス
      uint16_t  qPort = MY_NET.remotePort(); // ポート番号
      //│
      //●受信データを読み取る
      char pFrame[LIMIT::READ_LEN];
      int  getLen = MY_NET.read(pFrame, sizeof(pFrame) - 1);
      if (getLen < 1) return;
      //│＼（データ内容が[空]の場合）
      //│ ▼終了：早期リターンする
      //│
      //○受信データを末尾処理する
      pFrame[getLen] = '\0';
      //┴
    //│
    //○┐キュー情報を用意する
      //●接続識別子を求める
      //●スロットIDを求める
      String qCONN = getConn(qIP, qPort);
      int    qSID  = SLOT_ASSIGN(qCONN);
      //┴
    //│
    //●キューを登録する
    pushQueue(qCONN, String(pFrame), qSID);
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* ON_RECIVE() */

//========================================================
//§モード別実装のインクルード
//========================================================
#if MODE == MODE_BRIDGE
  #include "UDP_Bridge.cpp"
#else
  #include "UDP_MainSub.cpp"
#endif

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // コンストラクタ【非同期キュー型＋接続スロット型】
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  AD_UDP(  MmpContext& argCtx) : // 接続識別子：String
  AD_API<      String>(argCtx, AID::UDP), // 基本型
  AD_API_Queue<String>(argCtx, AID::UDP), // 非同期キュー型
  AD_API_Slot< String>(argCtx, AID::UDP)  // 接続スロット型
  {
  //┬
  //○┐【前処理】
    //●初期化の健全性を確認する
    if (SETUP()) return;
    //│＼（問題がある場合）
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //●モード別コンストラクタを実施する
    String retMsg = CONSTRACT();
    //┴
  //│
  //○┐【後処理】
    //●起動ログMSGを表示する
    Log::prtln(retMsg);
  //┴┴
  } /* constractor AD_UDP() */

}; /* class AD_UDP */