// filename : Dep_Connect/adapter/UDP/UDP_Bridge.cpp
//========================================================
// 接続部門／担当：UDP（ブリッジ モード）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/30)
//========================================================

//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 開始処理：コンストラクタ
  //───────────────────────────
  String CONSTRACT() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //○接続スロットを初期化する
    SLOTs = 1;
    TBL   = new T_SLOT[SLOTs];
    //│
    //○サービスを開始する
    MY_NET.begin(MY_PORT);
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了（起動ログMSG[OK]）
    return String(" [OK] UDP");
  //┴
  } /* CONSTRACT() */

  //───────────────────────────
  // 終了処理：スレーブにリクエストを送信する
  //───────────────────────────
  void SEND_REQUEST() override final {
  //┬
  //○┐【前処理】
    //●初期化の健全性を確認する
    if (SETUP_NORMAL())
    {ctx.trans.Result = RCD::Trn1Err; return;}
    //│＼（問題がある場合）
    //│ ○処理結果にエラーCDをセット
    //│ ▼終了：早期リターンする
    //│
    //○転送先の情報を用意する
    String toIP = ctx.trans.Dat1;
    //┴
  //│
  //○┐【主処理】
    //○この通信アダプタにリクエストを送信する
    MY_NET.beginPacket(toIP.c_str(), MY_PORT);
    MY_NET.write((const uint8_t*)ctx.trans.Frame.c_str(), ctx.trans.Frame.length());
    MY_NET.endPacket();
    //┴
  //│
  //○┐【後処理】
    //●コンテクスト・ログを出力する
    adpFnBase::SHOW_LOG();
  //┴┴
  } /* SEND_REQUEST() */