#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：プレイ画面(描画機能)
#┠─────────────────────────────────────
#┃描画コントローラが描画プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import  pyxel
from    main.データセット               import データセット as DS
from    ..DB                            import シーンID

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 描画クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass
    #┌───────────────────────────────────
    #│機能実行
    #├───────────────────────────────────
    #│※自機が無い場合は表示不可 または 意味がない為、処理をスキップする
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●発電機の状況を描画する
        self.Fn発電機()
        #│
        #●運搬機の状況を描画する
        self.Fn運搬機()
        #┴

    #┌───────────────────────────────────
    #│発電機を描画
    #└───────────────────────────────────
    def Fn発電機(self):
        #┬
        出力 = DS.情報.プレイ時間
        pyxel.text(54, 2, f"{str(出力).zfill(3)}", 10)
        #◎└┐発電機のサイクルを描画する
        x=0
        for i in range(2):
            出力 = DS.obj.発電機[i].情報.発電容量
            pyxel.text(x,  9, f"POWER:{出力}", 7)

            出力 = DS.obj.運搬機[i].情報.救出数
            pyxel.text(x, 18, f"SAVE :{出力}", 7)

            出力 = DS.obj.運搬機[i].情報.入力
            pyxel.text(x, 27, f"IN  :{出力}", 8)

            出力 = DS.obj.運搬機[i].情報.出力
            pyxel.text(x, 36, f"OUT  :{出力}", 8)

            x+=75
        #┴　┴

    #┌───────────────────────────────────
    #│運搬機を描画
    #└───────────────────────────────────
    def Fn運搬機(self):
        #┬
        #◎└┐運搬機の出力を描画する
        for 各運搬機 in range(2):
            出力 = DS.obj.運搬機[各運搬機].情報.出力
            pyxel.rect(0, DS.仕様.基本.画面高 - 12, 出力, 3, 7)
        #┴　┴
