#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：プレイ画面(移動機能)
#┠─────────────────────────────────────
#┃更新コントローラが移動プロセスで実行するアクション・メソッド
#┃・下位にデータセット･クラス(仕様｜情報)を持つ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import  pyxel
import  main.GAME共通       as 共通処理
from    main.データセット   import データセット as DS
from    ..DB                import シーンID

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:
    #------------------------------------------------------------------------
    # カウンタ
    #------------------------------------------------------------------------
    #□持続時間  ：ボス警告を持続する長さ（単位：fps）
    #□終了時間  ：終了画面に進行するまでの時間
    持続時間    = 150
    終了時間    = 50

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報クラス:
    #------------------------------------------------------------------------
    # カウンタ
    #------------------------------------------------------------------------
    #□開始時間  ：ボス警告を持続するカウンタ
    開始時間    = None

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 移動クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #〇個体オブジェクトのリファレンスを用意する
        self._仕様  = DS.仕様
        self._情報  = DS.情報

        #≫データセットを用意する
        self.仕様 = 仕様クラス()
        self.情報 = 情報クラス()
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        if DS.情報.プレイ時間 < (1 * 60 * 30): return
        #│
        #◇┐終了画面を開始する
        if self.情報.開始時間 is None:
        #　├┐（待ちを開始する場合）
            #↓
            #○持続カウントを開始する
            #●終了BGMを鳴らす
            self.情報.開始時間   = pyxel.frame_count
            共通処理.効果音.爆発(2)
            #┴
        #　└┐（その他）
            #┴
        #│
        #◇┐次のシーンに進行する
        経過時間 = pyxel.frame_count - self.情報.開始時間
        時間あり = (経過時間 < self.仕様.終了時間)
        if 時間あり: return
        #│＼（まだ時間がある場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #○シーンを『終了画面』に進行する
        #○タイマーをリセットする
        self._情報.シーン   = シーンID.終了画面
        self.情報.開始時間  = None
        #┴