#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能→遷移プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import main.GAME共通                         as 共通処理
from   main.データセット import データセット as DS
from   ..DB              import シーンID

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 遷移クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass
    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●ゲーム情報を初期化する
        #●オブジェクトを初期化する
        #●立体物を初期化する
        #●音声を再生する
        self.Fnゲーム情報を初期化()
        self.Fnオブジェクトを初期化()
        self.Fn立体物を初期化()
        self.Fn音声を再生()
        #┴
	#─────────────────────────────────────
    def Fnゲーム情報を初期化(self):
        #┬ 
        #○シーンを『タイトル画面』に遷移する
        DS.情報.シーン = シーンID.タイトル画面
        #│
        #○ゲーム情報を初期化する
        DS.情報.人数  = 0  # 対戦人数をゼロ
        #┴
	#─────────────────────────────────────
    def Fnオブジェクトを初期化(self):
        #┬ 
        #○コンテナを初期化する
        DS.obj.運搬機 = [] # 運搬機インスタンスを空
        DS.obj.発電機 = [] # 発電機インスタンスを空
        #┴
	#────────────────────────────────────
    def Fn立体物を初期化(self):
        #┬ 
        #●運搬機を停止する
        共通処理.運搬機.停止()
        #│
        #◎└┐サーボ(小屋)を初期化する
        for チーム in range(2):
            #│＼（すべてのチームを走査し終えた場合）
            #│ ↓
            #│ ▼繰り返し処理を抜ける
            #│
            #○サーボ(恐竜)を初期化する
            共通処理.入出力.MMP.PWM_VALUE(
                DS.ハード.小屋.首[チーム]   ,
                DS.ハード.小屋.中央         )
            #│
            #○サーボ(骨メータ)を初期化する
            共通処理.入出力.MMP.PWM_VALUE(
                DS.ハード.小屋.骨[チーム]   ,
                DS.ハード.小屋.最大         )
        #│
        #○サーボ(ジオラマ)を初期化する
        for 番号 in range(2):
            共通処理.入出力.MMP.PWM_VALUE(
                DS.ハード.ジオラマ.恐竜[番号]   ,
                DS.ハード.ジオラマ.中央[番号]   )
        #┴　┴
	#────────────────────────────────────
    def Fn音声を再生(self):
        #┬ 
        #●BGMを切替える
        共通処理.BGM_DFP.自動選択()
        #┴