#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン(終了画面)
#┠─────────────────────────────────────
#┃常時存在するシーン(タイトル画面)オブジェクト用クラス
#┃・下位に機能クラス(移動｜描画)をもつ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from .FN移動 import 移動クラス
from .FN描画 import 描画クラス
from .FN遷移 import 遷移クラス

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:

      恐竜  = (9,10)    # サーボ番号(ジオラマの恐竜)
      中央  = (280,300) # PWMの中央値

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
      #┬
      #○個体オブジェクトのリファレンスを用意する
      self.仕様  = 仕様クラス()
      #│
      #≫機能を用意する
      self.FN移動 = 移動クラス(self)
      self.FN描画 = 描画クラス(self)
      self.FN遷移 = 遷移クラス(self)
      #┴