// filename : Dep_Connect/adapter/ESP/ESPN_MainSub.cpp
//========================================================
// 接続部門／担当：ESP-NOW（メインモード・サブモード）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/29)
//========================================================

//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 終了処理：接続元にレスポンスMSGを送信する
  //───────────────────────────
  void SEND_MSG(String argConn) override final {
  //┬
  //○┐【前処理】
    //●初期化の健全性を確認する
    if (SETUP_NORMAL()) return;
    //│＼（問題がある場合）
    //│ ▼終了：早期リターンする
    //│
    //○送信先の情報を用意する
    String toMac   = argConn;      // 接続識別子
    String toFrame = ctx.base.Msg; // レスポンスMSG
    //┴
  //│
  //○┐【主処理】
    //●接続元にレスポンスMSGを送信する
    SendToMac(toMac, toFrame);
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* SEND_MSG() */