// filename : Dep_Connect/adapter/ESP/ESPN_Bridge.cpp
//========================================================
// 接続部門／担当：ESP-NOW（ブリッジモード）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/28)
//========================================================

//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 終了処理：スレーブにリクエストを送信する
  //───────────────────────────
  void SEND_REQUEST() override final {
  //┬
  //○┐【前処理】
    //●初期化の健全性を確認する
    if (SETUP_NORMAL()) {ctx.trans.Msg = RCD::Trn1Err; return;}
    //│＼（問題がある場合）
    //│ ○完了MSGにエラーCDをセット
    //│ ▼終了：早期リターンする
    //│
    //○転送先の情報を用意する
    String toMac   = ctx.trans.Dat1;  // MACアドレス
    String toFrame = ctx.trans.Frame; // フレーム
    //┴
  //│
  //○┐【主処理】
    //●この通信アダプタにリクエストを送信する
    SendToMac(toMac, toFrame);
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* SEND_REQUEST() */
