#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃背景(移動機能)
#┠─────────────────────────────────────
#┃更新コントローラが移動プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self, 引数_上位): #① 上位のコンポジットクラス
        #┬
        #○データセット(コンポジット)のリファレンスを用意する
        self._上位 = 引数_上位
        self._仕様 = 引数_上位.仕様
        self._情報 = 引数_上位.情報
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #◎└┐すべての星を更新する
        for 番号, (座標X, 座標Y, 速度Y) in enumerate(self._情報.星):
            #│＼（すべての星を処理し終えた場合）
            #│ ↓
            #│ ▼繰り返し処理を抜ける
            #│
            #○座標を画面下方向に移動する
            座標Y += 速度Y
            if 座標Y >= DS.仕様.画面高:
            #│ ＼（画面下に達した場合）
                #↓
                #○座標を画面上に移動する
                座標Y = 0
                #┴
            #│
            #○座標を更新する
            self._情報.星[番号] = (座標X, 座標Y, 速度Y)
        #┴　┴