#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃背景
#┠─────────────────────────────────────
#┃常時存在する背景オブジェクト用クラス
#┃・下位にデータセット･クラス(仕様｜情報)を持つ
#┃・下位に機能クラス(移動｜描画)をもつ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import  pyxel
from    main.データセット   import データセット as DS
from    .FN移動             import 移動クラス
from    .FN描画             import 描画クラス

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:
    #┬
    星数 = 30
    #┴

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #◎└┐すべての星リストを作る
        self.星 = []
        for cnt in range(仕様クラス.星数):
            #│＼（すべての星を処理し終えた場合）
            #│ ▼繰り返し処理を抜ける
            #│
            #○位置をセットする
            座標X = pyxel.rndi(0, DS.仕様.基本.画面幅 - 1)  
            座標Y = pyxel.rndi(0, DS.仕様.基本.画面高 - 1)  
            #│
            #○速度をセットする
            速度Y = pyxel.rndf(0.4, 1.0) 
            #│
            #○星を追加する
            self.星.append((座標X, 座標Y, 速度Y))
        #┴　┴

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #〇≫データセットを用意する
        self.仕様   = 仕様クラス()
        self.情報   = 情報クラス()
        #│
        #〇処理セットを用意する
        self.FN移動 = 移動クラス(self)
        self.FN描画 = 描画クラス(self)
        #┴