#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃背景
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import  pyxel
from    main.データセット   import DS
from .FN動作           import 本体 as 動作機能の生成
from .FN表現           import 本体 as 表現機能の生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    #┬
    星数 = 30
    #┴

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #◎└┐すべての星リストを作る
        self.星 = []
        for cnt in range(仕様.星数):
            #│＼（すべての星を処理し終えた場合）
            #│ ▼繰り返し処理を抜ける
            #│
            #○位置をセットする
            座標X = pyxel.rndi(0, DS.仕様.画面幅 - 1)  
            座標Y = pyxel.rndi(0, DS.仕様.画面高 - 1)  
            #│
            #○速度をセットする
            速度Y = pyxel.rndf(0.4, 1.0) 
            #│
            #○星を追加する
            self.星.append((座標X, 座標Y, 速度Y))
        #┴　┴

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫データセットを用意する
        self.仕様   = 仕様()
        self.情報   = 情報()
        #│
        #○処理セットを用意する
        self.FN動作 = 動作機能の生成(self)
        self.FN表現 = 表現機能の生成(self)
        #┴