// filename : Dep_Command/_index_.h
//========================================================
// コマンド部門
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#pragma once
//┬
//□┐インクルード
  //□Arduinoシステム
  #include <Arduino.h>
//┴┴

//========================================================
// 共有資源
//========================================================
//┬
//□制限事項
#define REQUEST_LENGTH 96 // リクエスト全体のバッファ長
#define DAT_COUNT      10 // コマンド＋引数の個数
#define DAT_LENGTH     20 // トークン最大長（未定義時のフォールバック）
//│
//□機能モジュール情報
struct T_MOD {
  const char* name; // 名前
  const char* desc; // 説明
};
//┴

//========================================================
// 組織図
//========================================================
//┬
//□┐コマンド部門
  //#include "module/_index_.h" //※一覧ではなぜかコンパイルエラー
  //□担当課長（基本型）
  #include "module/_api_.h"
  //│
  //□担当：機能モジュール
  #include "module/system.h"  // システム管理
  #include "module/analog.h"  // アナログ入力
  #include "module/digital.h" // デジタル入出力
  #include "module/pwm.h"     // PWM出力
  #include "module/IIC.h"     // IIC通信
  #include "module/mp3.h"     // MP3プレイヤー
//┴┴

//========================================================
// 部門長の役務
//========================================================
  #include "manager.cpp"
  namespace DepCommand {
    void INIT()      ; // 部下招集
    void RunCommand(); // 業務遂行（コマンド実行）
  }