// filename : connection/mode/member/_index_.h
//========================================================
// 経路アダプタ／担当マネージャ／メンバー：動作モード
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■在籍一覧
  #include "main.cpp"
  #include "sub.cpp" 
  #include "bridge.cpp"
  //┴
//┴

//========================================================
// 同僚：動作モード
//========================================================
  namespace modeMain  {void RUN();} // メインモード
  namespace modeSub   {void RUN();} // サブモード
  namespace modeBridge{void RUN();} // ブリッジモード
