// filename : Dep_Contact/adapter/TCP/TCP_MainSub.cpp
//========================================================
// 接客部門／担当(通信アダプタ)：TCP（メイン／サブ モード）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/29)
//========================================================

//========================================================
//§接続管理
//========================================================
  //─────────────────
  // 新接続のスロットを作成
  //----------------------------------
  // 戻り値 ：処理結果（論理値）
  // ・false：正常
  // ・true ：異常
  //─────────────────
  void SLOT_CREATE(){
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //◎┐新接続のスロットを作成する
    while (true) {
      //│
      //○未管理のTCP接続を取得する
      WiFiClient newConn = MY_NET->available();
      if (!newConn) return;
      //│＼（未管理のTCP接続がない場合）
      //│ ▼終了：早期リターンする
      //│
      //●空きスロットを探す
      int       ID = SLOT_GET_FREE();
      if (ID<0) ID = SLOT_GET_OLD ();
      //│＼（該当する既存スロットがない場合）
      //│ ●古いスロットを走査
      //│ ┴
      //│
      //●割当スロット内容をセットする
      SLOT_INI_SET(ID, newConn);
      //┴
    } //～while
  //│
  //○┐【後処理】
  //┴┴
  } /* SLOT_CREATE() */

//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 開始処理：コンストラクタ
  //───────────────────────────
  String CONSTRACT() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //○接続管理TBLを作成する
    SLOTs = 10;
    TBL   = new T_SLOT[SLOTs];
    //│
    //○サーバを起動する
    MY_NET = new WiFiServer(MY_PORT);
    MY_NET->begin();
    //│
    //●受信タスク（並列処理）を登録する
    RUN_TASK(MY_AID);
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了（起動ログMSG[OK]）
    char msg[100];
    snprintf(msg, sizeof(msg), " [OK] TCP RAW    (PORT %d)", MY_PORT);
    return String(msg);
  //┴
  } /* CONSTRACT() */

  //───────────────────────────
  // 終了処理：接続元に処理結果を送信する
  //───────────────────────────
  void SEND_RESULT(WiFiClient argConn) override final {
  //┬
  //○┐【前処理】
    //●接続元の接続状況を確認
    if (!ENABLED_CONN(argConn, true)) return;
    //│＼（機能していない場合）
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //○接続元に処理結果を送信する
    argConn.print(ctx.base.Result);
    //┴
  //│
  //○┐【後処理】
    //●コンテクスト・ログを出力する
    adpFnBase::LOG_CTX();
  //┴┴
  } /* SEND_RESULT() */