// filename : Dep_Contact/adapter/TCP/TCP_Bridge.cpp
//========================================================
// 接客部門／担当(通信アダプタ)：TCP（ブリッジ）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/28)
//========================================================

//========================================================
//§接続管理
//========================================================
  //─────────────────
  // 新接続のスロットを作成
  //----------------------------------
  // 戻り値 ：処理結果（論理値）
  // ・false：正常
  // ・true ：異常
  //─────────────────
  void SLOT_CREATE(){
    //┬
    //●割当スロット内容をセット
    SLOT_INI_SET(0, MY_NET);
    //┴
  } /* SLOT_CREATE() */

//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 開始処理：コンストラクタ
  //───────────────────────────
  String CONSTRACT() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //○接続管理TBLを作成する
    SLOTs = 1;
    TBL   = new T_SLOT[SLOTs];
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了（起動ログMSG[OK]）
    return String(" [OK] TCP");
  //┴
  } /* CONSTRACT() */

  //───────────────────────────
  // 終了処理：スレーブにリクエストを送信する
  //───────────────────────────
  void SEND_REQUEST() override final {
  //┬
  //○┐【前処理】
    //●初期化の健全性を確認する
    if (SETUP())
    {ctx.trans.Result = RCD::Trn1Err; return;}
    //│＼（問題がある場合）
    //│ ○処理結果にエラーCDをセット
    //│ ▼終了：早期リターンする
    //│
    //○宛先情報を取得する
    String toIP = ctx.trans.Dat1;
    //┴
  //│
  //○┐【主処理】
    //◇┐クライアントを起動する
    if (!ENABLED_CONN(MY_NET, false)) {
      //├┐（TCPが未接続の場合）
        //○クライアントを起動（成功するまでの待ち時間を指定）
        MY_NET.setTimeout(LIMIT::TIME_CONNECT);
        if (!MY_NET.connect(toIP.c_str(), MY_PORT))
        {ctx.trans.Result = RCD::Trn2Err; return;}
        //│＼（接続に失敗した場合）
        //│ ○処理結果にエラーCDをセット
        //│ ▼終了：早期リターンする
        //│
        //○スロットを初期化
        SLOT_INI(TBL[0]);
        //│
        //●受信タスクを登録する
        RUN_TASK(MY_AID);
        //┴
      //└┐（その他）
        //┴
    } //～if 
    //│
    //○この通信アダプタにリクエストを送信する
    MY_NET.print(ctx.trans.Frame);
    //┴
  //│
  //○┐【後処理】
    //●コンテクスト・ログを出力する
    adpFnBase::LOG_CTX();
  //┴┴
  } /* SEND_REQUEST() */