#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃オブジェクト：カモロボ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import データセット as DS
from .FN動作           import 本体         as 動作機能の生成
from .FN命中           import 本体         as 命中機能の生成
from .FN表現           import 本体         as 表現機能の生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self       ,
            引数_チームNo   ,   #① チームNo(チームNo) 
            引数_ポート一覧 ):  #② MMPポート番号

        #□チームNo
        self.チームNo = 引数_チームNo

        #□ ペダル情報リスト
        self.ポート一覧 = 引数_ポート一覧          

        #□ カモロボが命中でリアクションする最大回数
        self.反応回数 = 2

        #□命中エフェクトのタイマ
        self.命中タイマ = 40

        print("--------------------")
        print("[チームNo] :",self.ポート一覧)
        print("[ポート] :",self.ポート一覧)

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):

        #□明秀回数
        self.命中回数 = 0

        #□命中したいときにリアクションした回数
        self.反応回数 = 0

        #□命中エフェクトのタイマ
        self.命中タイマ = 0

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self       ,
            引数_チームNo   ,   #① チームNo(チームNo) 
            引数_ポート一覧 ):  #② MMPポート番号)
        #┬
        #≫データセットを用意する
        self.仕様   = 仕様(引数_チームNo, 引数_ポート一覧)
        self.情報   = 情報()
        #│
        #≫プロセス機能を用意する
        self.FN動作 = 動作機能の生成(self)
        self.FN命中 = 命中機能の生成(self)
        self.FN表現 = 表現機能の生成(self)
        #│
        #≫このオブジェクトをコンテナに生成する
        DS.obj.カモロボ.insert(0,self)
        #┴