// filename : Dep_Connect/adapter/IIC/IIC_MainSub.cpp
//========================================================
// 接続部門／担当：IIC（メイン／サブ モード）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/29)
//========================================================

//========================================================
//§最終処理
//========================================================
  //───────────────────────────
  // 終了処理：接続元に処理結果を送信する
  //───────────────────────────
  void SEND_RESULT(uint8_t argConn) override final {
    //┬
    //○返送バッファに処理結果をセットする
    //  ※ここでは送信せずにスレッド処理に繋ぐ
    CONN_TX[argConn - IIC_ADDR_MIN] = ctx.base.Result;
    //│
    //●コンテクスト・ログを出力する
    adpFnBase::SHOW_LOG();
    //┴
  } /* SEND_RESULT() */