// filename : Dep_Connect/adapter/IIC/IIC_MainSub.cpp
//========================================================
// 接続部門／担当：IIC（メインモード・サブモード）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/29)
//========================================================

//========================================================
//§最終処理
//========================================================
  //───────────────────────────
  // 終了処理：接続元にレスポンスMSGを送信する
  //───────────────────────────
  void SEND_MSG(uint8_t argConn) override final {
    //┬
    //○レスポンス内容を返送バッファにセット
    //  ※ここではレスポンスしないでスレッド処理に回す
    CONN_TX[argConn - IIC_ADDR_MIN] = ctx.base.Msg;
    //│
    //●ログ出力
    adpFnBase::SHOW_LOG();
    //┴
  } /* SEND_MSG() */