#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃変更機能(動作プロセス)のアクションメソッド
#┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃ペダルを漕ぐ力に応じて発電する
#┃・発電した電力は、発電機に蓄電
#┃・発電ロータの角度を変える
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import sys; sys.path.append('..'); import 共通.入力
from   ...                         import 共通部品

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:

    #□ ペダル情報
    チャンネル一覧 = (0,1)  # HC4069のANA-INチャンネルNoの一覧
    スイッチ閾値 = 700      # MMPのVcc(3.3V)を基準にしたスイッチの閾値

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self   ,
            引数_個体   ):   #① 個体オブジェクト
        #┬
        #○データセット(コンポジット)のリファレンスを用意する
        self._仕様 = 引数_個体.仕様
        self._情報 = 引数_個体.情報
        #│
        #≫データセットを用意する
        self.仕様  = 仕様()
        self.情報  = 情報()
        #┴

    #┌───────────────────────────────────
    #│プロセス機能を実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●左右の漕ぐ力を求める
        漕ぐ力 = self.Fn漕ぐ力を取得()
        #│
        #●求めた『漕ぐ力』で発電する
        self.Fn発電し蓄電(*漕ぐ力)
        #│
        #●発電ローターの位相を変える
        self.Fn発電ロータを移動()
        #┴
	#────────────────────────────────────
    # ペダルの操作状況から、左右の足ごとに漕ぐ力を求める
	#────────────────────────────────────
    def Fn漕ぐ力を取得(self): #【戻り値】 リスト(右足の漕ぐ力，左足の漕ぐ力)
        #┬
        #○左右の漕ぐ力を初期化する
        右 = 0
        左 = 0
        #│
        #◎└┐漕ぐ力を求める
        for ポートNo in self._仕様.ポート:
            #│＼（全ペダルを走査した場合）
            #│ ↓
            #│ ▼処理を中断する
            #│
            #●ペダル操作状況を用意する
            結果 = 共通.入力.入力走査(
                ポートNo                ,
                self.仕様.チャンネル一覧,
                self.仕様.スイッチ閾値  )
            #│
            #◇┐ペダル操作に応じて漕ぐ力を求める
            if       結果[1][0] and not 結果[1][1]: 右 += 1
            elif not 結果[1][0] and     結果[1][1]: 左 += 1
            #　├┐（右足がON・左脚がOFFの場合）
                #↓
                #○右足の力を加える
                #┴
            #　├┐（右足がOFF・左脚がONの場合）
                #↓
                #○左足の力を加える
                #┴
            #　└┐（その他）
            #┴　┴
        #│
        #▼左右の漕ぐ力を返す
        return (右,左)
	#────────────────────────────────────
    # 発電ロータの角度・漕ぐ力に応じて蓄電する
	#────────────────────────────────────
    def Fn発電し蓄電(self     ,
             引数_右    ,   # 右足の漕ぐ力
             引数_左    ):  # 左足の漕ぐ力
        #┬
        #○漕ぐ力(左右の力の差)を用意する
        右足の力 = 引数_右 - 引数_左
        #│
        #◇┐発電ロータの角度・漕ぐ力に応じて蓄電する
        右足判定 = 共通部品.発電機.右足判定(self._情報.角度)
        if 右足判定: self._情報.蓄電量 += ( 右足の力) if 右足の力 > 0 else (0)
        else       : self._情報.蓄電量 += (-右足の力) if 右足の力 < 0 else (0)
        #　├┐（右足を踏むべき状況の場合）
            #↓
            #○『右足の漕ぐ力』で蓄電する
            #┴
        #　└┐（その他）
            #↓
            #○『左足の漕ぐ力』で蓄電する
        #┴　┴
	#────────────────────────────────────
    # 発電ロータの角度を変える
	#────────────────────────────────────
    def Fn発電ロータを移動(self):
        #┬
        #○発電ロータの位相(角度)を更新する
        self._情報.角度 += 7
        if self._情報.角度 > 360: self._情報.角度 = 0
        #　 ＼（発電ロータが1回転した場合）
            #↓
            #○角度を0度に補正する
        #┴　┴