#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃共通処理
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from . import mmp

class 本体:

    MMP     = None  # MMPオブジェクト

	#────────────────────────────────────    
    def 初期化():
        #┬
        #●MMPを実体化する。
        本体.MMP = mmp()
        #│
        #●MMPを接続する
        本体.MMP.通信接続_自動()
        #│
        #●アナログ入力を設定する
        本体.MMP.アナログ設定(
                1, # 使用するHC4067の個数(1～4)
                8, # 使用するHC4067のPin数(1～16)
                10 # アナログ値の丸め(この数値以下は切り捨て)
                )
        #┴
