#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃共通処理
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
import time
from   ..データセット import データセット as DS
from   ..シーン       import シーンID
from   .              import MMP本体

class 本体:

	#────────────────────────────────────
    # シーンに合ったBGMを演奏する
	#────────────────────────────────────
    def 自動再生():
        シーン = DS.情報.シーン
        if   シーン == シーンID.タイトル画面: 本体.シーン指定(1)
        elif シーン == シーンID.プレイ画面  : 本体.シーン指定(2)
        elif シーン == シーンID.終了画面    : 本体.シーン指定(3)

	#────────────────────────────────────
    # シーン用(フォルダNo.1)の指定トラックを演奏する
	#────────────────────────────────────
    def シーン指定(引数_ファイル番号):
        音量 = DS.仕様.BGM一覧[引数_ファイル番号][0]
        時間 = DS.仕様.BGM一覧[引数_ファイル番号][1]
        本体.個別指定(1,引数_ファイル番号,音量)
        DS.情報.再生時間 = 時間

	#────────────────────────────────────
    # 指定フォルダ・トラックを演奏する
	#────────────────────────────────────
    def 個別指定(引数_フォルダ番号, 引数_ファイル番号, 引数_音量=20):
        # 停止➡WAIT➡音量➡再生の順に実行すること(フリーズする為)
        MMP本体.MMP.DFP_Stop(1)
        time.sleep(0.2)
        MMP本体.MMP.DFP_Volume(1,引数_音量)
        MMP本体.MMP.DFP_PlayFolderTrack(1,引数_フォルダ番号,引数_ファイル番号)

	#────────────────────────────────────
    # 繰返し再生する
	#────────────────────────────────────
    def 繰返し再生():
        #┬
        #○BGMを繰返し条件を確認する
        フレーム判定 = (pyxel.frame_count % 30 != 0)
        再生中要否   = (DS.情報.再生時間 is None)
        if フレーム判定 or 再生中要否: return
        #│＼（フレーム処理タイミングでないか、BGMの再生が不要の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #○再生時間カウンタをカウントダウンする
        DS.情報.再生時間 -= 1
        if DS.情報.再生時間 > 0: return
        #│＼（再生時間が終了していない場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #○再生時間カウンタを初期化する
        DS.情報.再生時間 = None
        #│
        #●ＢＧＭを再生する
        本体.自動再生()
        #┴