#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃汎用部品：ＭＭＰ入力
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
import time
from   ..データセット import データセット as DS
from   .              import MMP

#────────────────────────────────────
# ユーザ操作音クリック音
#────────────────────────────────────
def クリック音():
    pyxel.play( 0, 63, resume = True ) 

#────────────────────────────────────
# シーンに合ったBGMを演奏する
#────────────────────────────────────
def 自動再生():
    シーン = DS.情報.シーン
    ファイル番号 = DS.仕様.BGM一覧[シーン][0]
    音量         = DS.仕様.BGM一覧[シーン][1]
    時間         = DS.仕様.BGM一覧[シーン][2]
    個別指定(1,ファイル番号,音量)
    DS.情報.再生時間 = 時間

#────────────────────────────────────
# 指定フォルダ・トラックを演奏する
#────────────────────────────────────
def 個別指定(引数_フォルダ番号, 引数_ファイル番号, 引数_音量=20):
    # 停止➡WAIT➡音量➡再生の順に実行すること(フリーズする為)
    MMP.接続.DFP_Stop(1)
    time.sleep(0.2)
    MMP.接続.DFP_Volume(1,引数_音量)
    MMP.接続.DFP_PlayFolderTrack(1,引数_フォルダ番号,引数_ファイル番号)

#────────────────────────────────────
# 繰返し再生する
#────────────────────────────────────
def 繰返し再生():
    #┬
    #○BGMを繰返し条件を確認する
    フレーム判定 = (pyxel.frame_count % 30 != 0)
    再生中要否   = (DS.情報.再生時間 is None)
    if フレーム判定 or 再生中要否: return
    #│＼（フレーム処理タイミングでないか、BGMの再生が不要の場合）
    #│ ↓
    #│ ▼処理を中断する
    #│
    #○再生時間カウンタをカウントダウンする
    DS.情報.再生時間 -= 1
    if DS.情報.再生時間 > 0: return
    #│＼（再生時間が終了していない場合）
    #│ ↓
    #│ ▼処理を中断する
    #│
    #○再生時間カウンタを初期化する
    DS.情報.再生時間 = None
    #│
    #●ＢＧＭを再生する
    自動再生()
    #┴