// filename : Dep_Contact/mode/main.cpp
//========================================================
// 接客部門／生技部／モード別：メインモード係
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/27)
//========================================================

 namespace modeMain{
//========================================================
//§公開機能
//========================================================
  //━━━━━━━━━━━━━━━━━
  // メインモード実行
  //━━━━━━━━━━━━━━━━━
  void HANDLE(){
    //┬
    //●ユーザ認証を実施
    if (adpFnAuth::CHECK()) return;
    //│＼（処理継続が不可の場合）
    //│ ▼終了：早期リターン
    //│
    //●製造部門に後続処理を移譲する
    DepProduct::HANDLE();
    //┴
  } /* HANDLE() */

} /* namespace modeMain */