#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能(遷移プロセス)のアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [アプリ共通]
import MMP
import 音声

# [ゲーム共通]
import main.共通部品 as 共通部品
from main.データセット import DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self, 引数_上位): #① 上位のコンポジットクラス
        #┬
        #○データセット(コンポジット)のリファレンスを用意する
        self._仕様 = 引数_上位.仕様
        self._情報 = 引数_上位.情報
        #│
        #≫データセットを用意する
        self.仕様  = 仕様()
        self.情報  = 情報()
        #┴

    #┌───────────────────────────────────
    #│プロセス機能を実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●ゲーム情報を初期化する
        #●オブジェクトを初期化する
        #●物理体を初期化する
        #●音声を再生する
        self.Fnゲーム情報を初期化()
        self.Fnオブジェクトを初期化()
        self.Fn物理体を初期化()
        self.Fn音声を再生()
        #┴
	#─────────────────────────────────────
    def Fnゲーム情報を初期化(self):
        #┬ 
        #○シーンを『タイトル画面』に遷移する
        DS.情報.シーン = DS.仕様.シーンID.タイトル画面
        #│
        #○ゲーム情報を初期化する
        DS.情報.人数  = 0  # 対戦人数をゼロ
        #┴
	#─────────────────────────────────────
    def Fnオブジェクトを初期化(self):
        #┬ 
        #○コンテナを初期化する
        DS.obj.運搬機 = [] # 運搬機インスタンスを空
        DS.obj.発電機 = [] # 発電機インスタンスを空
        #┴
	#────────────────────────────────────
    def Fn物理体を初期化(self):
        #┬ 
        #●運搬機を停止する
        共通部品.運搬機.停止()
        #│
        #◎└┐サーボ(小屋)を初期化する
        for チーム in range(2):
            #│＼（すべてのチームを走査し終えた場合）
            #│ ↓
            #│ ▼繰り返し処理を抜ける
            #│
            #○サーボ(恐竜)を初期化する
            MMP.接続.PWM_VALUE(
                DS.仕様.小屋.首[チーム]   ,
                DS.仕様.小屋.中央         )
            #│
            #○サーボ(骨メータ)を初期化する
            MMP.接続.PWM_VALUE(
                DS.仕様.小屋.骨[チーム]   ,
                DS.仕様.小屋.最大         )
        #│
        #○サーボ(ジオラマ)を初期化する
        for 番号 in range(2):
            MMP.接続.PWM_VALUE(
                DS.仕様.ジオラマ.恐竜[番号]   ,
                DS.仕様.ジオラマ.中央[番号]   )
        #┴　┴
	#────────────────────────────────────
    def Fn音声を再生(self):
        #┬ 
        #●BGMを切替える
        音声.自動再生(DS.情報.シーン, DS.情報.シーン, 引数_停止 = True)
        #┴