// filename : Dep_Connect/common/sp_stream.cpp
//========================================================
// 接続部門／共通課：ストリーム受信係
//--------------------------------------------------------
// Ver 1.3.2 (2026/09/14)
// ・分割取得を廃止
// ・超過チェックを廃止
//========================================================

//########################################################
//# 処理詳細
//########################################################
namespace adpFnStream{
//========================================================
// 担務（公開機能）
//========================================================
  //━━━━━━━━━━━━━━━━━
  // ストリームからフレームを取得
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //━━━━━━━━━━━━━━━━━
  String GET_FRAME(Stream& argConn){
    //┬
    //○受信の有無を確認
    if (!argConn.available()) return "";
    //│＼（受信がない場合）
    //│ ▼終了：早期リターン
    //│
    String strRX = "";
    while (!strRX.endsWith("!") && argConn.available()) strRX += (char)argConn.read();
    //◎┐受信データを取込
      //│＼（終端に達した場合）
      //│ ▽完了：走査終了
      //│
      //○受信データを受信バッファに加える
      //┴
    //│
    //○受信データを補正
    adpFnBase::FORMAT_URI(strRX);
    //│
    //▼返却：フレーム値
    return strRX;
    //┴
  } /* GET_FRAME() */

} /* namespace adpFuncStream */