#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃Pythonで実行          ： python ./main.py
#┃リソースエディタ起動  ： pyxel edit ".\main\リソース.pyxres"
#┃Pythonのキャッシュ削除： ./キャッシュ削除.bat ※Windowsで実行
#┠─────────────────────────────────────
#┃<<配線>>
#┃   MMP/PWM側ピン    アダプタピン              フィールド側
#┃
#┃ MMP:0-1 (ADC)    ←  [01]  ←   フット・スイッチ
#┃ MMP:0-2 (ADC)    ←  [02]  ←   ハンド・スイッチ
#┃   PWM:0 -SIG      →  [03]  →   モータドライバ（選手） 
#┃                      [04]
#┃                      [05] 
#┃   PWM:1-SIG      →  [06]  →   サーボモータ(鉄棒)
#┃   PWM:1-GND      ←  [07]  ←   モータドライバ,サーボモータ
#┃                      [08] 
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import main

ゲーム = main.開始()