#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃Pythonで実行          ： python ./main.py
#┃リソースエディタ起動  ： pyxel edit ".\main\リソース.pyxres"
#┃Pythonのキャッシュ削除： ./キャッシュ削除.bat ※Windowsで実行
#┠─────────────────────────────────────
#┃<<コントローラ>>
#┃ [HC4067P]       [コントローラ]
#┃ 0-1 (ADC)   ←  フット・スイッチ
#┃ 0-2 (ADC)   ←  ハンド・スイッチ
#┃ 0-3 (ADC)   ←  ハンド・スイッチ
#┃ 0-4 (3.3V)  →  フット・スイッチ
#┃ 0-5 (3.3V)  →  ハンド・スイッチ
#┃ 0-6 (ADC)   ←  スタート・スイッチ
#┃ 0-7 (GND)   ←   (未使用)  
#┃ 0-8 (GND)   ←   (未使用)  
#┠─────────────────────────────────────
#┃<<フィールド>>
#┃ [PCA9685]  [アダプタ]  [フィールド]
#┃ 0-SIG    →  [03]  →  サーボモータ(SIG)
#┃ 0-5V     →  [05]  →  モータドライバ(Vcc),サーボモータ(5V) 
#┃ 1-SIG    →  [06]  →  モータドライバ(INT1)
#┃ 0-GND    ←  [07]  ←  モータドライバ(GND),サーボモータ(GND)
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import main

ゲーム = main.開始()