// filename : Dep_Contact/adapter/UDP/UDP.cpp
//========================================================
// 接客部門／担当(通信アダプタ)：UDP(ベース)
//--------------------------------------------------------
//・通信タイプ： 単一接続・非同期受信
//・接続識別子： String (IPアドレス + ":" + ポート番号)
//--------------------------------------------------------
// Ver 1.4.0 (2026/10/09)
//========================================================
//┬
//□┐インクルード
  //□Arduinoシステム
  #include <WiFiUdp.h>
//┴┴

class AD_UDP:public AD_API_TQ<String>{
private:
//========================================================
//§基本情報
//========================================================
  WiFiUDP MY_NET        ; // クライアント・サーバ両用(実体)
  int     MY_PORT = 8083; // ポート番号

//========================================================
//§各種ヘルパ
//========================================================
  //───────────────────────────
  // 接続識別子を求める
  //───────────────────────────
  static String getConn(
    const IPAddress& argIP,
    uint16_t         argPORT
  ) {return argIP.toString() + ":" + String(argPORT);}

//========================================================
//§受信処理
//========================================================
  //───────────────────────────
  // 並列処理の内容を定義
  //───────────────────────────
  void ON_RECIVE() override final {
  //┬
  //○┐【前処理】
    //○受信内容を確認する
    int packetSize = MY_NET.parsePacket();
    if (packetSize < 1) return;
    //│＼（パケット内容が[空]の場合）
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //○┐フレーム求める
      //●接続情報を用意する
      IPAddress qIP   = MY_NET.remoteIP()  ; // IPアドレス
      uint16_t  qPort = MY_NET.remotePort(); // ポート番号
      //│
      //●受信データを読み取る
      char pFrame[LIMIT::READ_LEN];
      int  getLen = MY_NET.read(pFrame, sizeof(pFrame) - 1);
      if (getLen < 1) return;
      //│＼（データ内容が[空]の場合）
      //│ ▼終了：早期リターンする
      //│
      //○受信データを末尾処理する
      pFrame[getLen] = '\0';
      //┴
    //│
    //○┐キュー情報を用意する
      //●接続識別子を求める
      //●スロットIDを求める
      String qCONN = getConn(qIP, qPort);
      //┴
    //│
    //●キューを登録する
    pushQueue(qCONN, String(pFrame), 0);
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* ON_RECIVE() */

//========================================================
//§モード別実装のインクルード
//========================================================
#if MODE == MODE_BRIDGE
  // 関数：CONSTRACT(),SEND_REQUEST()
  #include "UDP_Bridge.cpp"
#else
  // 関数：CONSTRACT(),SEND_RESULT()
  #include "UDP_MainSub.cpp"
#endif

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // コンストラクタ
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  AD_UDP(MmpContext& argCtx):
  AD_API_TQ<String>(argCtx, AID::UDP){
  //┬
  //○┐【前処理】
    //●初期化の健全性を確認する
    if (SETUP()) return;
    //│＼（問題がある場合）
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //●モード別コンストラクタを実施する
    String retMsg = CONSTRACT();
    //┴
  //│
  //○┐【後処理】
    //●起動ログMSGを表示する
    Log::prtln(retMsg);
  //┴┴
  } /* constractor AD_UDP() */

}; /* class AD_UDP */