#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ：発電機
#┠─────────────────────────────────────
#┃発電機オブジェクト用クラス
#┃・下位にデータセット･クラス(仕様｜情報)を持つ
#┃・下位に機能クラス(移動｜衝突｜発射｜描画)をもつ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
from   main.データセット import データセット as DS
from   .FN移動           import 移動クラス
from .FN表現             import 表現クラス

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self       ,
            引数_ペダル一覧 ):  #① ペダル一覧(PWMポート番号)

        #□ ペダル情報リスト
        self.ポート = 引数_ペダル一覧          

        print("--------------------")
        print("[発電機]")
        print(" PORT :",self.ポート)

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):

        #□発電によって蓄えた電力
        self.蓄電量 = 0

        #□発電ローターの位相(角度)
        self.角度   = pyxel.rndi(0,360)

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self       ,
            引数_ペダル一覧):   #① ペダル一覧(PWMポート番号)
        #┬
        #≫データセットを用意する
        self.仕様   = 仕様クラス(引数_ペダル一覧)
        self.情報   = 情報クラス()
        #│
        #≫機能を用意する
        self.FN移動 = 移動クラス(self)
        self.FN表現 = 表現クラス(self)
        #│
        #○用意済みのインスタンスに生成する
        DS.obj.発電機.insert(0,self)
        #┴