// filename : Dep_Contact/adapter/ESP/ESPN_MainSub.cpp
//========================================================
// 接客部門／担当(通信アダプタ)：ESP-NOW(メイン／サブ)
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/30)
//========================================================

//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 終了処理：接続元に処理結果を送信する
  //───────────────────────────
  void SEND_RESULT(String argConn) override final {
  //┬
  //○┐【前処理】
    //●初期化の健全性を確認する
    if (SETUP()) return;
    //│＼（問題がある場合）
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //●接続元に処理結果を送信する
    SendToMac(argConn, ctx.base.Result);
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* SEND_RESULT() */