// filename : Dep_Contact/adapter/ESP/ESPN_Bridge.cpp
//========================================================
// 接客部門／担当(通信アダプタ)：ESP-NOW（ブリッジ）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/30)
//========================================================

//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 終了処理：スレーブにリクエストを送信する
  //───────────────────────────
  void SEND_REQUEST() override final {
  //┬
  //○┐【前処理】
    //●初期化の健全性を確認する
    if (SETUP())
    {ctx.trans.Result = RCD::Trn1Err; return;}
    //│＼（問題がある場合）
    //│ ○処理結果にエラーCDをセット
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //●この通信アダプタにリクエストを送信する
    SendToMac(ctx.trans.Dat1, ctx.trans.Frame);
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* SEND_REQUEST() */
