// filename : Dep_Connect/adapter/UARTT/UARTT_Bridge.cpp
//========================================================
// 接続部門／担当：UART 高速型（ブリッジモード）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/28)
//========================================================

//========================================================
//§ハンドルの事前処理と進行判定
//========================================================
  //───────────────────────────
  // ブリッジ用：マスタ
  // ※既定クラスはスレーブ用なのでマスタ用に再実装する
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  bool SETUP_BRIDGE() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //●前処理(マスタ)を実施...進行判定を得る
    bool retGo = modeBridge::MASTER(
      CONN,                                  // 単一スロット
      [this](Stream* conn){SEND_CONN(conn);} // 返信処理(関数をラムダ式で包む)
    );
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了(進行判定)
    return retGo;
  //┴
  } /* SETUP_BRIDGE() */

  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // ポーリング用ハンドラ
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  void handle() override final {
//──────────────────
    //●ブリッジ用
    if (SETUP_BRIDGE()) return;
      //│＼（異常の場合）
      //│ ▼終了：早期リターン
//──────────────────
//──────────────────
    //●ブリッジ処理を実行
    modeBridge::RUN(0, retFrame);
    if (ctx.base.Msg != "") {SEND_CONN(CONN); return;}
    //│＼（[内部コマンド応答済][エラーあり]の場合）
    //│ ○クライアントにレスポンス
    //│ ▼終了：早期リターンする
    //│
    //○進捗状況を[依頼中]にセット
    //▼終了：早期リターンする ※1件ずつ処理
    Log::Outln("1.待機中→依頼中");
    ctx.trans.Stat = BSTAT::REQ;
    return;
//──────────────────
