#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃共通処理
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from .              import mmp
from .              import MMP
from ..データセット import データセット as DS

接続 = None  # MMPオブジェクト

#────────────────────────────────────    
def 初期化():
    #┬
    #●MMPを実体化する。
    MMP.接続 = mmp()
    #│
    #●MMPを接続する
    MMP.接続.通信接続_自動()
    #│
    #●アナログ入力を設定する
    MMP.接続.アナログ設定(
        DS.仕様.ハード設定.HC4067の個数, # 使用するHC4067の個数(1～4)
        DS.仕様.ハード設定.HC4067のCh数, # 使用するHC4067のPin数(1～16)
        DS.仕様.ハード設定.HC4067の丸め  # アナログ値の丸め(この数値以下は切り捨て)
        )
    #┴
