#====================================================== 
# MECH TORNADO用 テストプログラム
#====================================================== 
import mmpRottenmeier
import time

#────────────────────────────────────    
def スイッチ():

    print("--------")
    print("スイッチ")
    print("--------")

    MMP.アナログ設定(
            4, # 使用するHC4067の個数(1～4)
            1, # 使用するHC4067のPin数(1～16)
            50 # アナログ値の丸め(この数値以下は切り捨て)
            )

    # 0:脚の屈伸
    # 1:手１
    # 2:手２
    # 3:ゲーム開始
    for cntLoop in range(100):        
        #◎└┐全アドレスから読み取る。
        MMP.アナログ読取()
        time.sleep(0.1)
        print("  %03i" % cntLoop,":", MMP.mmpAnaVal)

#────────────────────────────────────    
def 人形の脚():

    print("--------")
    print("人形の脚")
    print("--------")

    MMP.PWM_VALUE(0,4095) # 屈伸
    time.sleep(2)
    MMP.PWM_VALUE(0,-1)   # 直立

#────────────────────────────────────    
def 鉄棒のロック():

    print("------------")
    print("鉄棒のロック")
    print("------------")

    MMP.PWM_VALUE(1,160) # 回転
    time.sleep(2)
    MMP.PWM_VALUE(1,100) # ロック
    time.sleep(2)
    MMP.PWM_VALUE(1,160) # 回転

#====================================================== 
# メイン処理
#====================================================== 
#┬
#○MMPを実体化する。
MMP = mmpRottenmeier.mmp()
#│
#○MMPを接続する。
MMP.通信接続_自動()
#│
#○テストする。
#スイッチ()
人形の脚()
鉄棒のロック()
#│
#○MMPを切断する。
MMP.通信切断()
#┴