// filename : Dep_Contact/adapter/BLE/BLE.cpp
//========================================================
// 接客部門／担当(通信アダプタ)：BLE(ベース)
//--------------------------------------------------------
//・アドオン機能： キュー型
//・接続識別子　： uint8_t （ダミー）
//--------------------------------------------------------
// Ver 1.4.0 (2026/10/08)
//========================================================

class  AD_BLE:public AD_API_Queue<uint8_t>{
private:
//========================================================
//§基本情報
//========================================================
  static AD_BLE* MY_TASK; // タスク識別(インスタンス)

//========================================================
//§モード別実装のインクルード
//========================================================
#if MODE == MODE_BRIDGE
  // 関　数：CONSTRACT(),SEND_REQUEST(),ON_RECIVE()
  #include "BLE_Bridge.cpp"
#else
  // 関　数：CONSTRACT(),SEND_RESULT()
  // クラス：ServerCallbacks
  #include "BLE_MainSub.cpp"
#endif

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // コンストラクタ【キュー型】
  //（接続識別子：uint8_t）
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  AD_BLE(MmpContext& argCtx):
  AD_API_Queue<uint8_t>(argCtx, AID::BLE){
    //┬
    //●モード別コンストラクタを実施する
    //●起動ログMSGを表示する
    String retMsg = CONSTRACT();
    Log::prtln(retMsg);
    //┴
  } /* constractor AD_BLE() */

}; /* class AD_BLE */

//========================================================
//§インスタンス管理
//========================================================
AD_BLE* AD_BLE::MY_TASK = nullptr;