#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス():
    def __init__(self):
        self.基本   = 基本()
        self.ゲーム = ゲーム()
        self.運搬機 = 運搬機()

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃ゲームに関する情報 
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 基本():
    画面幅      = 120
    画面高      = 160

class ゲーム():
    プレイ時間  = 2000

class 運搬機():
    最高出力    = 4095      # 12ビットの限界値
    最低出力    = 1300      # この値以下で停止させる
    変換倍率    = 65        # 

    チャンネルNo    = (0,1) # HC4069のANA-INチャンネルNo
    待ち時間        = 30    # 単位：フレーム
    センサ閾値      = 200   # 単位：センサー値
