#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

#────────────────────────────────────    
class システム():
    番号 = 1
    名称 = "MECH BULLETS"
    版数 = "2025/08/10-00"

#────────────────────────────────────    
class シーンID():
	タイトル画面	= 100
	プレイ画面		= 200
	プレイ_ザコ画面	= 210 #音楽用のダミーID
	プレイ_ボス画面 = 220 #音楽用のダミーID
	ボス警告		= 221 #プレイ画面でのサブID
	ボス登場		= 222 #プレイ画面でのサブID
	ボス対決		= 223 #プレイ画面でのサブID
	終了画面		= 900

#────────────────────────────────────    
class 所有者ID():
    なし    = 0 # 弾の爆発に使用
    自機    = 1 # 自機、自機の弾 に使用
    敵機    = 2 # 敵機、敵機の弾、アイテム に使用

#────────────────────────────────────    
class ハード():
    HC4067の個数 = 4
    HC4067のCh数 = 3
    HC4067の丸め = 20

#────────────────────────────────────    
class リソース_画面():
    幅     = 120
    高     = 160

class リソース_キャラ幅():
    通常        = 8
    ボス        = 32

class リソース_画像Y():
    自機        = 0
    自弾        = 8
    バリア      = 0
    敵機        = 16
    敵弾        = 24
    アイテム    = 32
    残弾        = 40
    ボス        = 48

class リソース():
    画面     = リソース_画面()
    キャラ幅 = リソース_キャラ幅()
    画像Y    = リソース_画像Y()

#────────────────────────────────────    
class BGM():
    #□ＳＤカードの対応フォルダ
    #※<シーンID>:<フォルダ番号>)
    レベル一覧 = {
         シーンID.タイトル画面   : 0,
         シーンID.プレイ画面     : 0,
         シーンID.終了画面       : 0,
         シーンID.プレイ_ザコ画面: 1,
         シーンID.プレイ_ボス画面: 2}

    #□各レベルのＳＤカードの対応ファイル
    #※<key>:(<ファイルNo>,<音量>,<時間(秒数)>)
    #　・ファイルNo：0=デフォルト(keyと同値で処理する)
    #　・音量　　　：0=デフォルト(規定音量で処理する)
    通常 = {
        シーンID.タイトル画面 : (1,0,72),
        シーンID.終了画面     : (3,0,36)
        }

    ザコ = {
        101:(0,0,  56),
        102:(0,0,  60),
        103:(0,0, 105),
        104:(0,0,  90),
        105:(0,0,  87),
        106:(0,0,  60),
        107:(0,0,  77),
        108:(0,0,  63),
        109:(0,0,  62),
        110:(0,0,  59),
        111:(0,0,  65),
        112:(0,0,  53),
        113:(0,0,  87),
        114:(0,0,  50),
        115:(0,0, 115),
        116:(0,0,  49)
        }

    ボス = { 
        202:(0,0,  70),
        203:(0,0,  85),
        204:(0,0, 116),
        205:(0,0, 136),
        206:(0,0,  84),
        207:(0,0,  84),
        208:(0,0,  61),
        209:(0,0,  67),
        210:(0,0,  57),
        211:(0,0, 111),
        212:(0,0,  89),
        213:(0,0, 164),
        214:(0,0, 122),
        215:(0,0,  98),
        216:(0,0, 133),
        217:(0,0, 135)
        }

    #□音量の規定値
    規定音量 = 20

    #□レベル別の対応ファイルセット
    ファイルNo一覧 = [通常, ザコ, ボス]

#────────────────────────────────────    
class 本体():

    #□システム概要
    システム    = システム()

    #□ゲーム構成
    シーンID    = シーンID()
    所有者ID    = 所有者ID()
    プレイ時間  = 1500 # 推奨値＝1500

    #□ゲーム資源
    BGM         = BGM()
    リソース    = リソース()
    ハード      = ハード()
