#────────────────────────────────────    
class シーンID():

	#□シーンＩＤ
	タイトル画面	= 100
	プレイ画面		= 200
	ボス警告		= 300
	ボス登場		= 301
	ボス対決		= 302
	終了画面		= 900

#────────────────────────────────────    
class ハード設定():

	#□ＭＭＰ初期設定
    HC4067の個数 = 4
    HC4067のCh数 = 3
    HC4067の丸め = 20

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ画像
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class キャラ幅():
    通常        = 8
    ボス        = 32

class 画像Y():
    自機        = 0
    自弾        = 8
    バリア      = 0
    敵機        = 16
    敵弾        = 24
    アイテム    = 32
    残弾        = 40
    ボス        = 48

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃所有者に関するＩＤ 
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 所有者ID():
    #┬
    #□キャラクタの所有者を識別するID
    なし    = 0 # 弾の爆発に使用
    自機    = 1 # 自機、自機の弾 に使用
    敵機    = 2 # 敵機、敵機の弾、アイテム に使用
    #┴ 

class 仕様クラス():

	#□バージョン
    バージョン = "Ver.2025/08/08-00"

	#□シーンＩＤ
    シーンID   = シーンID()

    画面幅     = 120
    画面高     = 160
    難易度間隔 = 1500 # 推奨値＝1500
    難易度間隔 = 300 # 推奨値＝1500

    キャラ幅 = キャラ幅()
    画像Y    = 画像Y()
    所有者ID = 所有者ID()
    ハード設定 = ハード設定()

	#□シーン別ＢＧＭ
    #　※<シーンID>:(<ファイル番号>,<音量>,<秒数>)
    BGM一覧 = {
        シーンID.タイトル画面 : (1,17,72),
        シーンID.終了画面     : (3,17,36)}
