#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

#────────────────────────────────────    
class チート():
    スキップ        = 1
    フルオプション  = False
    フル発射        = False
    消えない        = False
    時短            = False

#────────────────────────────────────    
class 本体:

    シーン     = None
    ボスシーン = None
    遷移要否   = False

    フレーム数 = 0
    プレイ時間 = 0
    難易度     = 0
    得点       = 0
    人数       = 0

    操作手段   = None
    MMP中央値  = 500
    MMP反応率  = 10

    #□ゲーム資源
    チート     = チート()
