#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：サーボ仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class サーボ仕様クラス():
    def __init__(self):
        self.小屋       = 小屋()
        self.ジオラマ   = ジオラマ()

class 小屋():
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        self.首   = (1,13)  # サーボ番号(小屋の恐竜の首１,２)
        self.骨   = (0,12)  # サーボ番号(小屋の骨メータ１,２)
        self.最小 = 140     # 首：左／骨：MAX
        self.最大 = 380     # 首：右／骨：MIN
        self.範囲 = self.最大 - self.最小             # PWMの幅
        self.中央 = int((self.最小 + self.最大) / 2)  # PWMの中央値

class ジオラマ():
    恐竜  = (7,6)     # サーボ番号(ジオラマの恐竜１,２)
    中央  = (280,300) # PWMの中央値
