#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

#────────────────────────────────────    
class シーンID():

	#□シーンＩＤ
	タイトル画面 = 100
	プレイ画面   = 200
	終了画面     = 900

#────────────────────────────────────    
class ハード設定():

	#□ＭＭＰ初期設定
    HC4067の個数 = 2
    HC4067のCh数 = 10
    HC4067の丸め = 100

#────────────────────────────────────    
class 小屋():
    def __init__(self):

        self.首   = (1,13)  # サーボ番号(小屋の恐竜の首１,２)
        self.骨   = (0,12)  # サーボ番号(小屋の骨メータ１,２)

        self.最小 = 140     # 首：左／骨：MAX
        self.最大 = 380     # 首：右／骨：MIN

        self.範囲 = self.最大 - self.最小             # PWMの幅
        self.中央 = int((self.最小 + self.最大) / 2)  # PWMの中央値

#────────────────────────────────────    
class ジオラマ():

    恐竜  = (7,6)     # サーボ番号(ジオラマの恐竜１,２)
    中央  = (280,300) # PWMの中央値

#────────────────────────────────────    
class 本体():

	#□バージョン
    バージョン = "Ver.2025/08/08-00"

	#□シーンＩＤ
    シーンID   = シーンID()

	#□ハード設定
    ハード設定 = ハード設定()
    小屋       = 小屋()
    ジオラマ   = ジオラマ()

	#□Ｐｙｘｅｌ画面
    画面幅      = 120
    画面高      = 160

	#□ゲーム条件
    プレイ時間  = 960  # 単位：フレーム 30sec=960

	#□シーン別ＢＧＭ
    #　※<シーンID>:(<ファイル番号>,<音量>,<秒数>)
    BGM一覧 = {
        シーンID.タイトル画面 : (1,20,60),
        シーンID.プレイ画面   : (2,17,80),
        シーンID.終了画面     : (3, 7,95)}
