#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

#────────────────────────────────────    
class シーンID():

	#□シーンＩＤ
	タイトル画面 = 100
	プレイ画面   = 200
	終了画面     = 900

#────────────────────────────────────    
class ハード設定():

	#□ＭＭＰ初期設定
    HC4067の個数 = 2
    HC4067のCh数 = 10
    HC4067の丸め = 100

	#□スイッチ
    スイッチ閾値 = 700  # MMPのVcc(3.3V)を基準にしたスイッチの閾値

#────────────────────────────────────    
class 仕様クラス():

	#□シーンＩＤ
    シーンID   = シーンID()

	#□ハード設定
    ハード設定 = ハード設定()

	#□Ｐｙｘｅｌ画面
    画面幅      = 120
    画面高      = 160

	#□ゲーム条件
    プレイ時間  = 200  # 単位：フレーム 30sec=960

	#□シーン別ＢＧＭ
    #　※<シーンID>:(<ファイル番号>,<音量>,<秒数>)
    BGM一覧 = {
        シーンID.タイトル画面 : (1,20,60),
        シーンID.プレイ画面   : (2,17,80),
        シーンID.終了画面     : (3, 7,95)}
