#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

#────────────────────────────────────    
class システム():
    番号 = 2
    名称 = "MECH SAURUS"
    版数 = "2025/08/10-00"

#────────────────────────────────────    
class シーンID():

	#□シーンＩＤ
	タイトル画面 = 100
	プレイ画面   = 200
	終了画面     = 900

#────────────────────────────────────    
class ハード():

	#□ＭＭＰ初期設定
    HC4067の個数 = 2
    HC4067のCh数 = 10
    HC4067の丸め = 100

#────────────────────────────────────    
class 小屋():
    def __init__(self):

        self.首   = (1,13)  # サーボ番号(小屋の恐竜の首１,２)
        self.骨   = (0,12)  # サーボ番号(小屋の骨メータ１,２)

        self.最小 = 140     # 首：左／骨：MAX
        self.最大 = 380     # 首：右／骨：MIN

        self.範囲 = self.最大 - self.最小             # PWMの幅
        self.中央 = int((self.最小 + self.最大) / 2)  # PWMの中央値

#────────────────────────────────────    
class ジオラマ():

    恐竜 = (7,6)     # サーボ番号(ジオラマの恐竜１,２)
    中央 = (280,300) # PWMの中央値

#────────────────────────────────────    
class リソース_画面():
    幅 = 120
    高 = 160

class リソース():
    画面     = リソース_画面()

#────────────────────────────────────    
class BGM():
    #□ＳＤカードの対応フォルダ
    #※<シーンID>:<フォルダ番号>)
    レベル一覧 = {
         シーンID.タイトル画面   : 0,
         シーンID.プレイ画面     : 0,
         シーンID.終了画面       : 0}

    #□各レベルのＳＤカードの対応ファイル
    #※<key>:(<ファイルNo>,<音量>,<時間(秒数)>)
    #　・ファイルNo：0=デフォルト(keyと同値で処理する)
    #　・音量　　　：0=デフォルト(規定音量で処理する)
    通常 = {
        シーンID.タイトル画面 : (1,20,60),
        シーンID.プレイ画面   : (2,17,80),
        シーンID.終了画面     : (3, 7,95)}

    #□音量の規定値
    規定音量 = 15

    #□レベル別の対応ファイルセット
    ファイルNo一覧 = [通常]

#────────────────────────────────────    
class 本体():

    #□システム概要
    システム    = システム()

    #□ゲーム構成
    シーンID    = シーンID()
    プレイ時間  = 960  # 単位：フレーム 30sec=960

    #□ゲーム資源
    BGM         = BGM()
    リソース    = リソース()
    ハード      = ハード()
    小屋        = 小屋()
    ジオラマ    = ジオラマ()

    