#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能→表現プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
from   main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセス実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #○画面をクリアする
        pyxel.cls(0)
        #│
        #●シーン別で表現する
        DS.obj.シーン[DS.情報.シーン].FN表現.実行()
        #│
        #●オブジェクト別で表現する
        self.Fnオブジェクト別の表現()
        #│
        #●シーン横断で表現する
        self.Fnシーン横断の表現()
        #┴
	#────────────────────────────────────
    def Fnオブジェクト別の表現(self):
        #┬
        #○シーンを確認する
        if DS.obj.選手 is None: return
        #│＼（選手コンテナが空の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #○選手で表現する
        DS.obj.選手.FN表現.実行()
        #┴
	#────────────────────────────────────
    def Fnシーン横断の表現(self):
        pass
