#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能→表現プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
from   main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセス実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #○画面をクリアする
        pyxel.cls(0)
        #│
        #●キャラクタ別で表現する
        self.Fnキャラクタ別()
        #│
        #●シーン別で表現する
        DS.obj.シーン[DS.情報.シーン].FN表現.実行()
        #│
        #●シーン横断で表現する
        self.Fnシーン横断()
        #┴

	#────────────────────────────────────
    # キャラクタ別で表現
	#────────────────────────────────────
    def Fnキャラクタ別(self):
        #┬
        #○コンテナを確認する
        if DS.obj.選手 is None: return
        #│＼（選手コンテナが空の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #○選手で表現する
        DS.obj.選手.FN表現.実行()
        #┴

	#────────────────────────────────────
    # シーン別で表現
	#────────────────────────────────────
    def Fnシーン横断(self):
        #┬
        #●立体物で表現する
        self.Fnシーン横断_立体()
        #│
        #●画面で表現する
        self.Fnシーン横断_画面()
	#────────────────────────────────────
    def Fnシーン横断_立体(self):
        pass
	#────────────────────────────────────
    def Fnシーン横断_画面(self):
        pass
