#====================================================== 
# MECH SAURUS用 テストプログラム
#====================================================== 
import mmpRottenmeier
import time

#────────────────────────────────────    
def ぺダル():

    print("------")
    print("ペダル")
    print("------")

    繰返回数 = 50   # アドレス切替回数
    待時間   = 0.2  # ウェイト(秒)

    MMP.アナログ設定(
            2,  # 使用するHC4067の個数(1～4)
            2,  # 使用するHC4067のPin数(1～16)
            200 # アナログ値の丸め(この数値以下は切り捨て)
            )
    #◎└┐繰り返し読み取る。
    for cntLoop in range(繰返回数):        
        #◎└┐全アドレスから読み取る。
        MMP.アナログ読取()
        if 待時間 > 0 : time.sleep(待時間)
        print("  %03i" % cntLoop,":", MMP.mmpAnaVal)

#────────────────────────────────────    
def 通過センサ():

    print("----------")
    print("通過センサ")
    print("----------")

    繰返回数 = 50   # アドレス切替回数
    待時間   = 0.2  # ウェイト(秒)

    MMP.アナログ設定(
            2,  # 使用するHC4067の個数(1～4)
            10, # 使用するHC4067のPin数(1～16)
            100 # アナログ値の丸め(この数値以下は切り捨て)
            )
    #◎└┐繰り返し読み取る。
    for cntLoop in range(繰返回数):        
        #◎└┐全アドレスから読み取る。
        MMP.アナログ読取()
        if 待時間 > 0 : time.sleep(待時間)
        センサ値1 = (MMP.mmpAnaVal[8][0],MMP.mmpAnaVal[8][1])
        センサ値2 = (MMP.mmpAnaVal[9][0],MMP.mmpAnaVal[9][1])
        print("  %03i" % cntLoop,": 1=", センサ値1,"／ 2=", センサ値2)

#────────────────────────────────────
def 恐竜ランド():

    print("----------")
    print("恐竜ランド")
    print("----------")

    モータ = (3,15) #モータドライバ:DCモータ
    基盤   = (2,14) #モータドライバ:基盤
    最小   = 1300
    最大   = 3500 
    間隔S  = 50
    間隔E  = -100
    停止   = 0.2

    #基盤の電源をON
    for i in range(2): MMP.PWM_VALUE(基盤[i], 4095)

    #DCモータをスピードアップ
    for val in range(最小,最大,間隔S):
        print("PWM:",val)
        for i in range(2): MMP.PWM_VALUE(モータ[i], val )
        time.sleep(停止)

    time.sleep(1)

    #DCモータをスローダウン
    for val in range(最大,最小,間隔E):
        print("PWM:",val)
        for i in range(2): MMP.PWM_VALUE(モータ[i], val )
        time.sleep(停止)

    #基盤・DCモータの電源をOFF
    for i in range(2):
        MMP.PWM_VALUE(モータ[i], -1)
        MMP.PWM_VALUE(基盤[i], -1)

#────────────────────────────────────
def 小屋の恐竜():

    print("------------")
    print("小屋の恐竜")
    print("------------")

    モータ = (1,13) #サーボモータ：恐竜
    最小 = 120
    最大 = 380
    サーボ(モータ,最小,最大)

#────────────────────────────────────
def 小屋のメータ():

    print("------------")
    print("小屋のメータ")
    print("------------")

    メータ = (0,12) #サーボモータ：骨メータ
    最小 = 120
    最大 = 370
    サーボ(メータ,最小,最大)

#────────────────────────────────────
def ジオラマ():

    print("--------")
    print("ジオラマ")
    print("--------")

    砂時計 = 5    #サーボモータ:砂時計
    砂時計_最小   = 136 #110～
    砂時計_最大   = 616 #～660
    砂時計_増分   = 1
    砂時計_間隔   = 0.002

    for val in range(砂時計_最小,砂時計_最大,砂時計_増分):
        MMP.PWM_VALUE(砂時計,val)
        time.sleep(砂時計_間隔)
    time.sleep(1)

    恐竜 = (7,6) #サーボモータ:恐竜
    最小 = 230
    最大 = 370
    増分 = 2
    間隔 = 0.005
    サーボ(恐竜,最小,最大,増分,間隔)
#    サーボ(恐竜,最小,最大)

    time.sleep(1)

    for val in range(砂時計_最大,砂時計_最小,-砂時計_増分):
        MMP.PWM_VALUE(砂時計,val)
        time.sleep(砂時計_間隔)

#────────────────────────────────────
def サーボ(
        モータ      ,   # サーボモータのアドレス
        最小        ,   # 110～
        最大        ,   # ～660
        増分 = 2    ,   # 増分
        間隔 = 0.02 ,   # 間隔
        待ち = 1    ,    # 待ち時間(秒)
        中央補正 = -18  
        ):

    中央 = int((最大 + 最小) / 2) + 中央補正

    for i in モータ:MMP.PWM_VALUE(i,中央)
    time.sleep(待ち)

    for val in range(中央,最大,増分):
        for i in モータ:MMP.PWM_VALUE(i,val)
#        print(val)
        time.sleep(間隔)
    time.sleep(待ち)

    for val in range(最大,最小,-増分):
        for i in モータ:MMP.PWM_VALUE(i,val)
        time.sleep(間隔)
#        print(val)
    time.sleep(待ち)

    for val in range(最小,中央,増分):
        for i in モータ:MMP.PWM_VALUE(i,val)
        time.sleep(間隔)


#====================================================== 
# メイン処理
#====================================================== 
#┬
#○MMPを実体化する。
MMP = mmpRottenmeier.mmp()
#│
#○MMPを接続する。
MMP.通信接続_自動()
#│
#○テストする。
#ぺダル()
#通過センサ()
#恐竜ランド()
#小屋の恐竜()
#小屋のメータ()
#ジオラマ()
#│
#○MMPを切断する。
MMP.通信切断()
#┴