// filename : Dep_Connect/adapter/_template_/_index_.h
//========================================================
// 接続部門／業務課／作業標準：在籍一覧
//--------------------------------------------------------
// Ver 1.3.2 (2026/09/14)
// ・コンテキスト初期化を共通へ移動
// ・転送処理の共通部品を追加
//========================================================
#pragma once

//========================================================
// 作業標準
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 抽象基底クラス
  //━━━━━━━━━━━━━━━━━
  #include "_api0_.h" // 基本
  #include "_api1_.h" // キュー処理型

//========================================================
// 担務
//========================================================
  //━━━━━━━━━━━━━━━━━
  // モード部品
  //━━━━━━━━━━━━━━━━━
    //─────────────────
    // メインモード
    //─────────────────
    #include "md_main.cpp"
    namespace modeMain  {void RUN();}

    //─────────────────
    // サブモード
    //─────────────────
    #include "md_sub.cpp"
    namespace modeSub   {void RUN();}

    //─────────────────
    // ブリッジモード
    //─────────────────
    #include "md_bridge.cpp"
    namespace modeBridge{
      void RUN();
      bool TARNS_BEGIN(int argAID);
      void TARNS_END();
    }