// filename : Dep_Connect/adapter/_template_/md_sub.cpp
//========================================================
// 接続部門／業務課／作業標準：モード処理係（サブモード）
//--------------------------------------------------------
// Ver 1.3.0 (2026/09/11)
//========================================================

//########################################################
//# 処理詳細
//########################################################
 namespace modeSub{
//========================================================
//【公開機能】
//========================================================
  //━━━━━━━━━━━━━━━━━
  // サブモード
  //━━━━━━━━━━━━━━━━━
  void RUN(){
    //┬
    //◇┐システムコマンドは自前で応答
    String tmpFrame = ctx.strFrame;
    adpFnBase::FORMAT_URI(tmpFrame);
    if (tmpFrame.startsWith("SYS/")) {
      //├┐（システムコマンド指定の場合）
        //●コマンドを実行
        //▼終了：早期リターン
        ctx.cmdPath = tmpFrame  ; // コマンド部門への準備
        DepCommand::RunCommand(); // コマンド実行結果はctx.resMSGにセット
        return                  ; // メインストリームに戻る
      //└┐（その他）
        //┴
    } /* END-if */
    //│
    //○リクエストをMMPメインへ転送
    Serial1.print(ctx.strFrame);
    //│
    //◎┐受信待ちデータの取り込み
    String strRX = "";
    while (!strRX.endsWith("!")) {
      //│＼（終端に達した場合）
      //│ ▽完了：走査終了
      //│
      //○受信データを受信バッファに加える
      if (Serial1.available()) strRX += (char)Serial1.read();
      //┴
    } /* END-while */
    //│
    //○コンテクストに[MMP本体からのレスポンス]を反映
    ctx.resMSG = strRX;
    //┴
  } /* RUN() */
} /* namespace modeSub */