#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：変更
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from ...汎用部品 import MMP本体
from ...汎用部品 import MMP音声
from .P動作        import 本体 as 動作プロセスの生成
from .P命中        import 本体 as 命中プロセスの生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫プロセスを用意する
        self.P動作 = 動作プロセスの生成()
        self.P命中 = 命中プロセスの生成()
        #┴
	#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	#┃機能をコントロール
	#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
    def 実行(self):
        #┬
        #●アナログ値を読み取る
        MMP本体.MMP.アナログ読取()
        #│
        #●ＢＧＭを繰返し再生する
        MMP音声.繰返し再生()
        #│
        #●プロセスを実行する
        self.P動作.実行()
        self.P命中.実行()
        #┴