#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：変更
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import main.GAME共通      as 共通処理
from   .P動作 import 本体 as 動作プロセスの生成
from   .P命中 import 本体 as 命中プロセスの生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫プロセスを用意する
        self.P動作 = 動作プロセスの生成()
        self.P命中 = 命中プロセスの生成()
        #┴
	#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	#┃機能をコントロール
	#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
    def 実行(self):
        #┬
        #●アナログ値を読み取る
        共通処理.入出力.MMP.アナログ読取()
        #│
        #●ＢＧＭを繰返し再生する
        共通処理.BGM_DFP.繰返し再生()
        #│
        #◎└┐アクションを実行する
        for 各アクション in self.アクション一覧:
            #│＼（すべての処理を終えた場合）
            #│ ↓
            #│ ▼繰り返し処理を抜ける
            #│
            #●プロセスを実行する
            self.P動作.実行()
            self.P命中.実行()
        #┴ 	┴