#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：変更機能
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [アプリ共通]
import MMP
import 音声

# [ゲーム共通]
from   main.データセット import DS

# [要素]
from .P動作 import 本体 as 動作プロセスの生成
from .P命中 import 本体 as 命中プロセスの生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫データセットを用意する
        self.仕様  = 仕様()
        self.情報  = 情報()
        #│
        #≫プロセスを用意する
        self.P動作 = 動作プロセスの生成(self)
        self.P命中 = 命中プロセスの生成(self)
        #┴
	#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	#┃機能をコントロール
	#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
    def 実行(self):
        #┬
        #●アナログ値を読み取る
        if DS.情報.シーン == DS.仕様.シーンID.プレイ画面: MMP.接続.アナログ読取()
        #│
        #●ＢＧＭをリピート再生する                
        音声.リピート再生()
        #│
        #●プロセスを実行する
        self.P動作.実行()
        self.P命中.実行()
        #┴