#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃変更機能→動作プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセス実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●キャラクタの動作を変更する
        self.Fnオブジェクトの動作()
        #│
        #●シーンの状態を変更する
        DS.obj.シーン[DS.情報.シーン].FN動作.実行()
        #┴
#┌───────────────────────────────────
#│アクション・メソッド実行
#└───────────────────────────────────
    def Fnオブジェクトの動作(self):
        pass