#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃変更機能(動作プロセス)のアクションメソッドを実行
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセスを実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●オブジェクトの動作を変更する
        self.Fnオブジェクトの動作()
        #│
        #●シーンの動作を変更する
        DS.obj.シーン[DS.情報.シーン].FN動作.実行()
        #┴

    #┌───────────────────────────────────
    #│オブジェクトのプロセスを実行
    #└───────────────────────────────────
    def Fnオブジェクトの動作(self):
        #※カモロボは能動的に動く機能はない
        pass