#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃変更機能→命中プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセス実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #○シーンを確認する
        if DS.情報.シーン != DS.仕様.シーンID.プレイ画面: return
        #│＼（シーンがプレイ画面以外の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #◎└┐命中状態を変更する
        for カモロボ in DS.obj.カモロボ:
            #│＼（すべての処理を終えた場合）
            #│ ↓
            #│ ▼繰り返し処理を抜ける
            #│
            #≫カモロボで命中確認する
            カモロボ.FN命中.実行()
        #┴　┴
