#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃共通処理
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.汎用部品        import mmp
from .データセット        import データセット as DS
from .オブジェクト.シーン import シーンID

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃ＭＭＰによる演奏
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class BGM_DFP():

    # シーン別のMP3ファイル再生時間
    シーン = {1:168, 2:240, 3:240 }

	#────────────────────────────────────
    # シーンに合ったBGMを演奏する
	#────────────────────────────────────
    def 自動選択():
        シーン  = DS.情報.シーン
        if   シーン == シーンID.タイトル画面: BGM_DFP.演奏(1)
        elif シーン == シーンID.プレイ画面  : BGM_DFP.演奏(2)
        elif シーン == シーンID.終了画面    : BGM_DFP.演奏(3)
	#────────────────────────────────────
    # ルートフォルダの指定トラックをループ演奏する
	#────────────────────────────────────
    def 演奏(引数_ファイル番号):
        DS.情報.再生時間 = BGM_DFP.シーン[引数_ファイル番号]
        入出力.MMP.DFP_PlayFolderTrack(1,1,引数_ファイル番号)

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃ＭＭＰによる入力走査
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 入出力():

    MMP     = None  # MMPオブジェクト

	#────────────────────────────────────    
    def MMP_初期化():
        #┬
        #●MMPを実体化する。
        入出力.MMP = mmp()
        #│
        #●MMPを接続する
        入出力.MMP.通信接続_自動()
        #│
        #●アナログ入力を設定する
        入出力.MMP.アナログ設定(
                4,  # 使用するHC4067の個数(1～4)
                1,  # 使用するHC4067のPin数(1～16)
                100 # アナログ値の丸め(この数値以下は切り捨て)
                )
        #┴