#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃ゲーム本体
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
import main.GAME共通                              as 共通処理
from   .データセット        import データセット   as DS
from   .コントローラ.変更   import 変更機能の生成
from   .コントローラ.結果   import 結果機能の生成
from   .オブジェクト.シーン import *

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 開始:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #○Pyxel(画面/音楽)を初期化する
        self.初期化_リソース()
        #│
        #○処理で用いる各種オブジェクトを作成する
        self.初期化_処理セット()
        #│
        #●シーンを『終了画面』から『タイトル画面』に遷移する
        DS.情報.シーン   = シーンID.終了画面
        DS.情報.遷移要否 = True
        self.結果機能.P遷移.実行()
        #│
        #○フレーム処理に、コントローラを登録する
        pyxel.run(self.変更機能.実行, self.結果機能.実行)
        #┴

    #┌───────────────────────────────────
    #│リソースの初期化
    #└───────────────────────────────────
    def 初期化_リソース(self):
        #┬
        #○画面を初期化する
        pyxel.init(
                DS.仕様.画面幅,
                DS.仕様.画面高,
                title="Ver.2025/08/05-00")
        #│
        #○リソースファイルを読み込む
        pyxel.load("./リソース.pyxres")
        #│
        #●MMPを初期化する
        共通処理.入出力.MMP_初期化()
        #┴

    #┌───────────────────────────────────
    #│処理セットの初期化
    #└───────────────────────────────────
    def 初期化_処理セット(self):
        #┬
        #≫シーンを生成する
        DS.obj.シーン = {
            シーンID.タイトル画面 : タイトル画面の生成(),
            シーンID.プレイ画面   : プレイ画面の生成()  ,
            シーンID.終了画面     : 終了画面の生成()    }
        #│
        #≫変更コントローラを生成する
        #≫結果コントローラを生成する
        self.変更機能 = 変更機能の生成()
        self.結果機能 = 結果機能の生成()
        #┴