#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃ゲーム本体
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
from   .汎用部品          import MMP
from   .データセット      import データセット   as DS
from   .コントローラ.変更 import 変更コントローラの生成
from   .コントローラ.結果 import 結果コントローラの生成
from   .シーン            import *

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 開始:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #○Pyxel(画面/音楽)を初期化する
        self.初期化_リソース()
        #│
        #○処理で用いる各種オブジェクトを作成する
        self.初期化_処理セット()
        #│
        #●シーンを『終了画面』から『タイトル画面』に遷移する
        DS.obj.シーン[DS.仕様.シーンID.終了画面].FN遷移.実行()
        #│
        #○フレーム処理を開始する
        pyxel.run(self.C変更.実行, self.C結果.実行)
        #┴

    #┌───────────────────────────────────
    #│リソースの初期化
    #└───────────────────────────────────
    def 初期化_リソース(self):
        #┬
        #○画面を初期化する
        pyxel.init(
                DS.仕様.画面幅,
                DS.仕様.画面高,
                title="Ver.2025/08/06-00")
        #│
        #○リソースファイルを読み込む
        pyxel.load("./resource.pyxres")
        #│
        #●MMPを初期化する
        MMP.初期化()
        #┴

    #┌───────────────────────────────────
    #│処理セットの初期化
    #└───────────────────────────────────
    def 初期化_処理セット(self):
        #┬
        #≫シーンを生成する
        DS.obj.シーン = {
            DS.仕様.シーンID.タイトル画面 : タイトル画面の生成(),
            DS.仕様.シーンID.プレイ画面   : プレイ画面の生成()  ,
            DS.仕様.シーンID.終了画面     : 終了画面の生成()    }
        #│
        #≫コントローラを生成する
        self.C変更 = 変更コントローラの生成()
        self.C結果 = 結果コントローラの生成()
        #┴