// filename : device/UART.cpp
//========================================================
// 通信デバイス：UARTポート
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
//┬
//■インクルード
//┴

//########################################################
//# 前空間：通信デバイス(UARTポート)
//########################################################
namespace devUART {
//========================================================
// 基本情報
//========================================================
  bool ENABLED = false; // 有効判定：有効：true、無効：false

//========================================================
// ハードウェア
//========================================================
  // 通信速度の定義
  int IntBaud = 115200;

//========================================================
// メイン処理
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //----------------------------------
  // 戻り値：処理結果（論理値）
  // ・true ：失敗
  // ・false：成功
  //━━━━━━━━━━━━━━━━━
  void START(){

    // UARTポートを起動
#if defined(BOARD_ESP32_S3_TINY) // --------┨WS社 ESP32S3-Tiny┠┐
    Serial1.begin(IntBaud, SERIAL_8N1, 17, 18);
  #if defined(MMP_TYPE_MAIN) // --┨ＭＭＰ本体┠┐
    // ※Serial2はMP3プレイヤーで使用
  #else // -------------------------------------┤
    Serial2.begin(IntBaud, SERIAL_8N1, 11, 12);
  #endif // ------------------------------------┘

#elif  defined(BOARD_M5STAMP_S3) // -------------┨M5SampS3(A)┠┤
    Serial1.begin(IntBaud, SERIAL_8N1,  1,  2);

#elif  defined(BOARD_PICO2W) // --------------┨ラズパイpico2W┠┤
    Serial1.begin(IntBaud, SERIAL_8N1, 13, 17);
    Serial2.begin(IntBaud, SERIAL_8N1,  5,  9);

#else // --------------------------------------------------------┤
  #error "【設定エラー】ボードが未定義です！"
#endif // -------------------------------------------------------┘

    //○有効性セット
    Serial.println("　[OK] UART(#01) -> " + String(IntBaud) + "bps");
    ENABLED = true;
  } /* START() */
} /* namespace devUART */