// filename : device/UART.cpp
//========================================================
// 通信デバイス初期化：ＵＡＲＴ
//--------------------------------------------------------
//【目的】
// ＵＡＲＴポートを任意のボーレートで初期化する
// オンボードのRGB-LEDの色でボーレートを知らせる
//--------------------------------------------------------
//【公開資源】
//・ENABLE ：このデバイスの有効性
//・START()：UARTポートを通信可能にする
//--------------------------------------------------------
//【処理機能】
//・3本のGPIOピンで8通りのボーレートを選択する
//・ボーレートごとに固有の色でRGB-LEDを点灯する
//・UARTポートを指定のボーレートで使用開始する
//・初期化の状況をシリアルに表示する
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/23) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //┴
//┴

//########################################################
//# 専用名の前空間
//########################################################
namespace devUART {
//========================================================
// 基本情報
//========================================================
  bool ENABLED = false; // 有効判定：有効：true、無効：false

//========================================================
// ハードウェア
//========================================================

  //─────────────────
  // ボーレートのプリセット
  //─────────────────
  static const int BAUD_PRESETS[8] = {
    921600,
    115200,
    57600,
    19200,
    9600,
    4800,
    2400,
    300
  };

  //─────────────────
  // ボーレート変更スイッチのGPIO
  //─────────────────
  #define SW_PIN_A 18 // bit-0
  #define SW_PIN_B 14 // bit-1
  #define SW_PIN_C 13 // bit-2

//========================================================
// メイン処理
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //----------------------------------
  // 戻り値：処理結果（論理値）
  // ・true ：失敗
  // ・false：成功
  //━━━━━━━━━━━━━━━━━
  void START(){

    // ボーレート設定ボタンのピンを定義
    pinMode(SW_PIN_A, INPUT_PULLUP);
    pinMode(SW_PIN_B, INPUT_PULLUP);
    pinMode(SW_PIN_C, INPUT_PULLUP);
    delay(10);

    // ボタンを読取
    int A = (digitalRead(SW_PIN_A) == LOW) ? 1 : 0;
    int B = (digitalRead(SW_PIN_B) == LOW) ? 1 : 0;
    int C = (digitalRead(SW_PIN_C) == LOW) ? 1 : 0;

    //ボーレートIDを取得
    int id = 7;
    if      (A==0 && B==0 && C==0) id = 0; // □□□
    else if (A==1 && B==0 && C==0) id = 1; // ■□□
    else if (A==0 && B==1 && C==0) id = 2; // □■□
    else if (A==0 && B==0 && C==1) id = 3; // □□■
    else if (A==1 && B==1 && C==0) id = 4; // ■■□
    else if (A==0 && B==1 && C==1) id = 5; // □■■
    else if (A==1 && B==0 && C==1) id = 6; // ■□■
    else if (A==1 && B==1 && C==1) id = 7; // ■■■

    // USB(CDC)ポートを起動
    Serial.begin(115200);          // USB(CDC)
    Serial.setDebugOutput(false);  // SDKデバッグ出力を抑止

    // UARTポートを起動
    int intBaud = BAUD_PRESETS[id];
    Serial1.begin(intBaud, SERIAL_8N1, 44, 43); // GPIO Serial
    delay(3000); // 安定するまで待つ
    
    // 起動メッセージを表示
    Serial.println("<<通信デバイスの初期化>>");
    Serial.println(" [Serial device]"  );
    Serial.println("　 [OK] USB (CDC) -> 115,200bps");
    Serial.println("　 [OK] UART(#01) -> " + String(intBaud) + "bps");

    //○有効性セット
    ENABLED = true;
  } /* START() */
} /* namespace devUART */