#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃特殊効果：データベース
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from    enum import IntEnum, auto

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃特殊効果の区分ID
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 効果ID(IntEnum):

    補給    = 0         # 使い切りのアイテム
    速度    = auto()    # 移動速度を上げる
    連射    = auto()    # 連射可能にする
    貫通弾  = auto()    # 弾が敵を貫通する
    発射数  = auto()    # 同時発射数を増やす
    防御    = auto()    # 敵からのダメージを緩和する

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃アイテムの識別ID
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class アイテムID(IntEnum):

    # 補給系
    弾薬	    = 0         # 弾薬を満タンにする
    シールド	= auto()    # シールドを満タンにする

    # 永続効果
    速度UP	    = auto()    # 0.5ずつ速くなる
    弾_連射   	= auto()    # 連射可能にする
    弾_貫通弾	= auto()    # 弾が敵を貫通する
    弾_発射数   = auto()    # 同時発射数を増やす

    # 敵からのダメージを緩和
    防御_半減	= auto()    # ダメージが半減する
    防御_無し	= auto()    # ノーダメージになる

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃アイテムのデータベース
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# キー      　　　　: アイテムの個体を一意に示す識別子
#------------------------------------------------------------------------
#[0] 効果ID         : 属する効果ID 
#------------------------------------------------------------------------
#[1] 出現情報 
#   [0] 難易度     ： 出現に必要な難易度の下限 
#   [1] 出現率     ： 他アイテムと相対的に比較する(多いほど出現しやすい) 
#------------------------------------------------------------------------
#[2] 詳細情報 
#   [0] 持続性     ： 効果が続く時間（単位：秒）
#                   ・-1  ：使い切り(補給物資に使用する)
#                   ・0   ：永続
#                   ・1～ ：有限(秒)
#   [1] 登録値 
#       ・Noneの場合　： 未使用として扱う
#       ・値の場合  　： 個別処理で扱う値（用途が異なる）
#       ・タプルの場合： 複数取得で[0]値ずつ加算し、[1]上限値を設ける
#        　[0] 値     ： 個別処理で扱う値
#        　[1] 上限値 ： 上記値の上限 
#------------------------------------------------------------------------
アイテムDB = {
    アイテムID.弾薬	    :(効果ID.補給  , ( 1,  0) , (-1, None       ) ),
    アイテムID.シールド :(効果ID.補給  , ( 2,  0) , (-1, None       ) ),
    アイテムID.速度UP	:(効果ID.速度  , ( 1, 30) , ( 0, ( 0.3,1.5) ) ),
    アイテムID.弾_連射  :(効果ID.連射  , ( 2, 70) , ( 0, None       ) ),
    アイテムID.弾_発射数:(効果ID.発射数, ( 3, 80) , ( 0, (   1, 4 ) ) ),
    アイテムID.弾_貫通弾:(効果ID.貫通弾, ( 4, 50) , (15, None       ) ),
    アイテムID.防御_半減:(効果ID.防御  , ( 5, 20) , (10, 0.5        ) ),
    アイテムID.防御_無し:(効果ID.防御  , ( 7, 10) , (10, 0          ) ),
    }