#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃特殊効果(移動機能)
#┠─────────────────────────────────────
#┃更新コントローラが移動プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import  pyxel
from    main.データセット   import データセット as DS
from    .DB                 import *

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self, 引数_上位): #① 上位のコンポジットクラス
        #┬
        #○データセット(コンポジット)のリファレンスを用意する
        self._上位 = 引数_上位
        self._仕様 = 引数_上位.仕様
        self._情報 = 引数_上位.情報
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #○プレイ時間を確認する
        if DS.情報.プレイ時間 % 30 != 0: return
        #│＼（発射タイミングではない場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #◎└┐永続以外のエントリに対し、残り時間を減らす
        tmp辞書 = {}
        for key, (残り時間, 値) in self._情報.発動中.items():
            #│＼（すべてのエントリを処理し終えた場合）
            #│ ↓
            #│ ▼繰り返し処理を脱出する
            #│
            #○時間切れを確認する
            if 残り時間 == 1: continue
            #│＼（時間切れの場合）
            #│ ↓
            #│ ▼次のエントリを照会する
            #│
            #○残り時間を減らす
            残り時間 = (残り時間) if 残り時間 == 0 else (残り時間 - 1)
            #│
            #○このエントリを一覧に加える
            tmp辞書[key] = (残り時間, 値)
            #┴
        #│
        #●BGMを切替える
        #chk既存 = (効果ID.防御 in self._情報.発動中)
        #chk最新 = (効果ID.防御 not in tmp辞書)
        #if chk既存 and chk最新: 共通処理.BGM.自動選択()
        #│
        #○リストアップした内容で上書きする
        self._情報.発動中 = tmp辞書
        #┴

    #┌───────────────────────────────────
    #│ボス登場時の効果はく奪に利用 ※永続効果は残る
    #└───────────────────────────────────
    def 強制解除(self):
        #┬
        #◎└┐永続以外のエントリをリストアップする
        tmp辞書 = {}
        for key, (残り時間, 値) in self._情報.発動中.items():
            #│＼（すべてのエントリを処理し終えた場合）
            #│ ↓
            #│ ▼繰り返し処理を脱出する
            #│
            #○持続性を確認する
            if 残り時間 != 0: continue
            #│＼（永続以外の場合）
            #│ ↓
            #│ ▼次のエントリを照会する
            #│
            #○このエントリを一覧に加える
            tmp辞書[key] = (残り時間, 値)
            #┴
        #│
        #●BGMを切替える
#        chk既存 = (効果ID.防御 in self._情報.発動中)
#        chk最新 = (効果ID.防御 not in tmp辞書)
#        if chk既存 and chk最新: 共通処理.BGM.自動選択()
        #│
        #○リストアップした内容で上書きする
        self._情報.発動中 = tmp辞書
        #┴