#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃特殊効果
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [要素クラス]
from .FN動作 import 本体 as 動作機能の生成
from .FN衝突 import 本体 as 衝突機能の生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:

    #キー：効果ＩＤ
    #値　：タプル（持続時間，値）
    #　　　[0] 持続時間：秒単位（ただしゼロ値は永続となる）
    #　　　[1] 登録値 ※タプルの場合もある
    #┬
    発動中 = {}
    #┴

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫データセットを用意する
        self.仕様  = 仕様()
        self.情報  = 情報()
        #│
        #≫プロセス機能を用意する
        self.FN動作 = 動作機能の生成(self)
        self.FN衝突 = 衝突機能の生成(self)
        #┴