#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：更新：衝突プロセス：衝突判定
#┠─────────────────────────────────────
#┃衝突による関係オブジェクトのアクション・メソッド実行を指示
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [ゲーム共通]
from ....         import 共通部品
from ....汎用部品 import 位置関係

# [別クラス]
from ....オブジェクト.キャラ.敵機 import 機体ID

# [要素クラス]
from .P実行 import *

#┌───────────────────────────────────
#│詳細アクション実行（攻撃）
#├───────────────────────────────────
#│自機の弾の衝突で、関係オブジェクトのアクション・メソッド実行を指示
#└───────────────────────────────────
def P判定_攻撃(
        引数_弾         ,   #① 自分のオブジェクト(弾)
        引数_対象一覧 ) :   #② 相手のオブジェクト(アイテム/敵機/弾)
                            #【戻り値】 True:破壊された／False：存在する
    #┬
    #○弾の衝突条件を用意する
    条件_弾 = (引数_弾.情報.X, 引数_弾.情報.Y)
    条件_弾 = (条件_弾, 引数_弾.仕様.衝突範囲)
    #│
    #◎└┐相手を処理する
    for 対象 in 引数_対象一覧.copy():
        #│＼（すべての処理を終えた場合）
        #│ ↓
        #│ ▼繰り返し処理を抜ける
        #│
        #○相手の衝突条件を用意する
        条件_対象 = (対象.情報.X, 対象.情報.Y)
        条件_対象 = (条件_対象, 対象.仕様.衝突範囲)
        #│
        #●弾と相手の衝突を判定する
        if not 位置関係.衝突判定(条件_弾, 条件_対象): continue
        #│＼（衝突していない場合）
        #│ ↓
        #│ ▼次の相手を処理する
        #│
        #●機雷との衝突を処理する
        if Fn機雷判定(対象): 
        #　 ＼（相手が機雷の場合）
            #↓
            #●敵機・弾(自機)・弾(敵機)を壊滅する
            #▼弾が『破壊された』を返す
            共通部品.爆発.壊滅(DS.obj.敵機    )
            共通部品.爆発.壊滅(DS.obj.弾_自機 )
            共通部品.爆発.壊滅(DS.obj.弾_敵機 )
            return True
        #│
        #●弾で攻撃する
        if P実行_攻撃(引数_弾, 対象): return True
        #│＼（弾が存在しない場合）
        #│ ↓
        #│ ▼弾が『破壊された』を返す
        #┴
    #│
    #▼弾が『存在する』を返す
    return False

#┌───────────────────────────────────
#│詳細アクション実行（体当たり）
#├───────────────────────────────────
#│自機の体当たり衝突で、関係オブジェクトのアクション・メソッド実行を指示
#└───────────────────────────────────
def P判定_体当たり(
        引数_自機       ,   #① 自分のオブジェクト(自機)
        引数_対象一覧   ):  #② 相手のオブジェクト(アイテム/敵機/弾)
                            #【戻り値】 True:破壊された／False：存在する
    #┬
    #○自分の衝突条件を用意する
    条件_自機 = (引数_自機.情報.X, 引数_自機.情報.Y)
    条件_自機 = (条件_自機, DS.obj.自機共通.仕様.衝突範囲)
    #│
    #◎└┐相手を処理する
    for 対象 in 引数_対象一覧.copy():
        #│＼（すべての処理を終えた場合）
        #│ ↓
        #│ ▼繰り返し処理を抜ける
        #│
        #○相手の衝突条件を用意する
        条件_対象 = (対象.情報.X, 対象.情報.Y)
        条件_対象 = (条件_対象, 対象.仕様.衝突範囲)
        #│
        #●自分と相手の衝突を判定する
        if not 位置関係.衝突判定(条件_自機, 条件_対象): continue
        #│＼（衝突していない場合）
        #│ ↓
        #│ ▼次の相手を処理する
        #│
        #●機雷との衝突を処理する
        if Fn機雷判定(対象): 
        #　 ＼（相手が機雷の場合）
            #↓
            #●機雷を破壊する
            #●自機を破壊する
            #▼自機が『破壊された』を返す
            対象.FN衝突.実行()
            引数_自機.FN衝突.実行()
            return True
        #│
        #●自機での体当たりする
        if P実行_体当たり(引数_自機, 対象): return True
        #│＼（自機が存在しない場合）
        #│ ↓
        #│ ▼自機が『破壊された』を返す
        #┴
    #│
    #▼自機が『存在する』を返す
    return False

#────────────────────────────────────	
def Fn機雷判定(引数_対象):  #① 相手のオブジェクト(アイテム/敵機/弾)
                            #【戻り値】 True:機雷／False：機雷以外
    #┬
    #○条件を確認する
    if 引数_対象.仕様.アイテム区分            : return False
    if 引数_対象.仕様.ボス区分                : return False
    if 引数_対象.仕様.種類ID != 機体ID.機雷   : return False
    #│＼（対象が『機雷以外』の場合）
    #│ ↓
    #│ ▼『機雷以外』を返す
    #│
    #▼『機雷』を返す
    return True