#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：更新：衝突プロセス：衝突判定：アクション
#┠─────────────────────────────────────
#┃関係オブジェクトのアクション・メソッド実行
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [ゲーム共通]
from ....データセット import データセット as DS

#┌───────────────────────────────────
#│詳細アクション実行（攻撃）
#└───────────────────────────────────
def P実行_攻撃(
        引数_自弾 ,   #① 自分のオブジェクト(弾)
        引数_対象 ):  #② 衝突対象のオブジェクト(アイテム,敵機,弾)
                      #【戻り値】 True:破壊された／False：存在する
    #┬
    #○条件を確認する
    if 引数_対象.仕様.アイテム区分: return
    #│＼（アイテムの場合）
    #│ ↓
    #│ ▼処理を中断する
    #│
    #●自機の弾を爆破する
    #●対象にダメージを与える
    引数_自弾.FN衝突.実行()
    引数_対象.FN衝突.実行(DS.obj.自機共通.仕様.威力_弾)
    #│
    #▼弾の破壊可否を返す
    return (引数_自弾 not in DS.obj.弾_自機)

#┌───────────────────────────────────
#│詳細アクション実行（体当たり）
#└───────────────────────────────────
def P実行_体当たり(
        引数_自機 ,  #① 自分のオブジェクト(自機)
        引数_対象 ): #② 衝突対象のオブジェクト(アイテム,敵機,弾)
                     #【戻り値】 True:破壊された／False：存在する
    #┬
    #◇┐衝突を処理する
    if 引数_対象.仕様.アイテム区分:
    #　├┐（相手が『アイテム』の場合）
        #↓
        #≫アイテムの効果を発動する
        #≫アイテムを消滅する
        DS.obj.特殊効果.FN衝突.実行(引数_対象.仕様.種類ID)
        引数_対象.FN衝突.実行(1)
        #┴ 
    else:
    #　└┐（その他）
        #↓
        #●自機にダメージ(体当たり)を与える
        #●対象にダメージ(体当たり)を与える
        引数_自機.FN衝突.実行(引数_対象.仕様.威力               )
        引数_対象.FN衝突.実行(DS.obj.自機共通.仕様.威力_体当たり)
    #│
    #▼自機の破壊状況を返す
    return (引数_自機 not in DS.obj.自機)
