// filename : adp.h
//========================================================
// アダプタ共通
//--------------------------------------------------------
// Ver 2.0.a (2026/09/01) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■rduinoシステム
  #include <Arduino.h>
  #include <queue>
  #include <mutex>
  //│
  //■ＭＭＰシステム
  //┴
//┴

//========================================================
// アダプタの公開情報
//========================================================
  //【通信アダプタ：ＢＬＥ】
  namespace adpBLE{
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

/*
  //【通信アダプタ：ＬｏＲａ】
  namespace adpLoRa{
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }
*/

//========================================================
// アダプタのトリガ
//========================================================
  void INIT_ADAPTER(); // 初期化
  void KICK_HANDLE() ; // ハンドルをキック