#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：更新：動作プロセス
#┠─────────────────────────────────────
#┃各オブジェクトのアクション・メソッドを実行する
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセス実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●└┐オブジェクトを更新(動作)する
        Pアクション((
                DS.obj.背景       ,
                DS.obj.特殊効果   ,
                DS.obj.自機       ,
                DS.obj.敵機       ,
                DS.obj.アイテム   ,
                DS.obj.弾_自機    ,
                DS.obj.弾_敵機    ,
                DS.obj.爆発       ))
        #│
        DS.obj.シーン[ DS.情報.シーン ].FN動作.実行()
        #┴ 

#┌───────────────────────────────────
#│アクション・メソッド実行
#└───────────────────────────────────
def Pアクション(引数_対象一覧):  #① 処理の一覧 ※一覧の入れ子OK
    #┬
    #◎└┐すべてのオブジェクトを描画する
    for 各対象 in 引数_対象一覧:
        #│＼（すべての処理を終えた場合）
        #│ ↓
        #│ ▼繰り返し処理を抜ける
        #│
        #◇┐要素オブジェクトを描画する
        if isinstance(各対象, list):
        #　├┐（一覧オブジェクトの場合）
            #↓
            #◎└┐要素オブジェクトを描画する
            for 各要素 in 各対象:
                #│＼（すべての処理を終えた場合）
                #│ ↓
                #│ ▼繰り返し処理を抜ける
                #│
                #●オブジェクトの中味を確認する
                if 各対象 is None: continue
                #│＼（すべての処理を終えた場合）
                #│ ↓
                #│ ▼次の要素オブジェクトを処理する
                #│
                #●オブジェクトを動作する
                各要素.FN動作.実行()
                #┴ 

        elif 各対象 is not None:
        #　├┐（要素で中味がある場合）
            #↓
            #≫アクション・メソッドでオブジェクトを動作する
            各対象.FN動作.実行()
        #　└┐（その他）
    #┴　┴　┴
