#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃Pythonで実行          ： python ./main.py
#┃リソースエディタ起動  ： pyxel edit ".\main\リソース.pyxres"
#┃Pythonのキャッシュ削除： ./キャッシュ削除.bat ※Windowsで実行
#┠─────────────────────────────────────
#┃<<配線>>
#┃   MMP/PWM側ピン    アダプタピン              フィールド側
#┃
#┃ MMP:0,1-1 (ADC)    ←  [01]  ←   フォトリフレクタ1
#┃ MMP:0,1-2 (ADC)    ←  [02]  ←   フォトリフレクタ2
#┃   PWM:1,3-SIG      →  [03]  →   モータドライバ（LED,音声モジュール） 
#┃   PWM:0,2-5V       →  [04]  →   モータドライバ
#┃ MMP:0,1-5 (3.3V)   →  [05]  →   フォトリフレクタ(1,2)
#┃   PWM:0,2-SIG      →  [06]  →   モータドライバ（DCモータ）
#┃   PWM:0,2-GND      ←  [07]  ←   モータドライバ
#┃ MMP:0,1-5 (GND)    ←  [08]  ←   フォトリフレクタ(1,2)
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import main

main.開始()