#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ：自機
#┠─────────────────────────────────────
#┃自機オブジェクト用クラス
#┃・下位にデータセット･クラス(仕様｜情報)を持つ
#┃・下位に機能クラス(移動｜衝突｜発射｜描画)をもつ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット  import データセット as DS
from .FN移動            import 移動クラス
from .FN衝突            import 衝突クラス
from .FN発射            import 発射クラス
from .FN描画            import 描画クラス

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:
    def __init__(self   ,
            引数_番号   ):  #① プレイヤ番号
        #--------------------------------------------------------------------
        # 識別
        #--------------------------------------------------------------------
        #□ プレイヤ番号
        self.番号 = 引数_番号

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報クラス:
    def __init__(self   ,
            引数_X座標  ,   #① 画面位置(X座標)
            引数_Y座標  ):  #② 画面位置置(Y座標)
        #--------------------------------------------------------------------
        # 位置
        #--------------------------------------------------------------------
        #□ 画面位置(X座標)
        #□ 画面位置(Y座標)
        self.X = 引数_X座標
        self.Y = 引数_Y座標

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    def __init__(self   ,
            引数_番号   ,   #① プレイヤー番号 ※0,1
            引数_X座標  ,	#② 出現させる位置(X座標)
            引数_Y座標  ):  #③ 出現させる位置(Y座標)
        #┬
        #≫データセットを用意する
        self.仕様   = 仕様クラス(引数_番号)
        self.情報   = 情報クラス(引数_X座標, 引数_Y座標)
        #│
        #≫処理セットを用意する
        self.FN移動 = 移動クラス(self)
        self.FN衝突 = 衝突クラス(self)
        self.FN発射 = 発射クラス(self)
        self.FN描画 = 描画クラス(self)
        #│
        #○用意済みのインスタンスに生成する
        DS.obj.自機.append(self)
        #┴