#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ：自機
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [ゲーム共通]
from main.データセット import DS

# [要素クラス]
from .FN動作           import 本体 as 動作機能の生成
from .FN衝突           import 本体 as 衝突機能の生成
from .FN発射           import 本体 as 発射機能の生成
from .FN表現           import 本体 as 表現機能の生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    def __init__(self   ,
            引数_番号   ):  #① プレイヤ番号
        #--------------------------------------------------------------------
        # 識別
        #--------------------------------------------------------------------
        #□ プレイヤ番号
        self.番号 = 引数_番号

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    def __init__(self   ,
            引数_X座標  ,   #① 画面位置(X座標)
            引数_Y座標  ):  #② 画面位置置(Y座標)
        #--------------------------------------------------------------------
        # 位置
        #--------------------------------------------------------------------
        #□ 画面位置(X座標)
        #□ 画面位置(Y座標)
        self.X = 引数_X座標
        self.Y = 引数_Y座標

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    def __init__(self   ,
            引数_番号   ,   #① プレイヤー番号 ※0,1
            引数_X座標  ,	#② 出現させる位置(X座標)
            引数_Y座標  ):  #③ 出現させる位置(Y座標)
        #┬
        #≫データセットを用意する
        self.仕様   = 仕様(引数_番号)
        self.情報   = 情報(引数_X座標, 引数_Y座標)
        #│
        #≫処理セットを用意する
        self.FN動作 = 動作機能の生成(self)
        self.FN衝突 = 衝突機能の生成(self)
        self.FN発射 = 発射機能の生成(self)
        self.FN表現 = 表現機能の生成(self)
        #│
        #○用意済みのインスタンスに生成する
        DS.obj.自機.append(self)
        #┴