// filename : adp.h
//========================================================
// アダプタ共通
//--------------------------------------------------------
// Ver 2.0.a (2026/09/01) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Arduino.h>
  #include <queue>
  #include <mutex>
  //│
  //■ＭＭＰシステム
  #include "mmpCtx.h"
//┴

//━━━━━━━━━━━━━━━━━
// グローバル資源
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // コンテクスト
  //----------------------------------
  // ※定義：mmpCtx.h、実装：adp.cpp
  //─────────────────
  extern MmpContext ctx;


//========================================================
// ユーザ認証
//========================================================
  //─────────────────
  // 特殊コマンド
  //─────────────────
  static const String SP_CMD_START = "_START_!"; // 認証開始

  //─────────────────
  // テーブル初期化
  //─────────────────
  void AUTH_INIT_TBL();

//========================================================
// 処理プロセス
//========================================================
  void   P0_SETUP_CONTEXT(String argAdpID, String argFrame);
  void   P1_FORMAT_URI(String &str);
  void   P1_SET_ACD_CPATH();
  bool   P2_CHECK_AUTH();
  void   P3_RUN();
  void   P9_SHOW_LOG();

//========================================================
// アダプタの公開情報
//========================================================
  //【通信アダプタ：ＵＡＲＴ】
  namespace adpUART{
    void HANDLE(Stream* argConn) ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＷＥＢ ＡＰＩ】
  namespace adpWAPI{     
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //========================================================
// アダプタのトリガ
//========================================================
  void INIT_ADAPTER(); // 初期化
  void KICK_HANDLE() ; // ハンドルをキック