// filename : adp.cpp
//========================================================
// アダプタ共通：アダプタ全体のライフサイクルを統括する
//--------------------------------------------------------
// Ver 2.0.a (2026/09/01) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■ＭＭＰシステム
  #include "adp.h"  // 通信アダプタ共通へ公開
  //┴
//┴

//━━━━━━━━━━━━━━━━━
// グローバル資源
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // コンテクスト
  //----------------------------------
  //・定義元：mmpCtx.h
  //・利用法：externで実体をアクセス
  //・用途等：
  //  - 通信アダプタ  ：受信データ・処理状態の共有領域
  //  - コマンド管理  ：コマンド実行情報の共有領域
  //  - 機能モジュール：レスポンス生成領域、ユーザメモリ管理
  //─────────────────
  MmpContext ctx;

  //─────────────────
  // コマンド管理
  //----------------------------------
  //・定義元：cmd.h
  //・利用法：公開ポインタ経由でアクセス
  //・用途等：
  //  - 通信アダプタ  ：コマンド管理への移譲
  //  - コマンド管理  ：定義元自身
  //─────────────────
  #include "cmd.h"                // 定義元ソースファイル
  CmdManager  OBJ_CMD(ctx)      ; // 本体(依存性注入)
  CmdManager* INO_CMD = &OBJ_CMD; // 外部公開ポインタ

  
//========================================================
// アダプタの初期化
//--------------------------------------------------------
// 認証TBL・アダプタ・コマンド管理を開始
//========================================================
  void INIT_ADAPTER() {
    //┬
    //○開始表示
    Serial.println("<<アダプタの初期化>>");
    //│
    //●認証情報TBLを初期化
    AUTH_INIT_TBL();
    //│
    adpWAPI::START();
    //│
    //○終了表示
    Serial.println("");
    //│
    //●コマンド管理を初期化
    INO_CMD->START();
    //┴
  } /* INIT_ADAPTER() */

//========================================================
// アダプタ起動のポーリング用ハンドル
//========================================================
  void KICK_HANDLE(){
    //┬
    //●ハンドルをキック
    adpUART::HANDLE(&Serial1);
//  adpUART::HANDLE(&Serial2);
//  adpUART::HANDLE(&Serial3);
//  adpUART::HANDLE(&Serial4);
    adpWAPI::HANDLE();
    //┴
  } /* KICK_HANDLE() */