// filename : adpUART.cpp
//========================================================
// 通信アダプタ：ＵＡＲＴ
//--------------------------------------------------------
// Ver 1.2.1 (2026/08/27) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■ＭＭＰシステム
  #include "adp.h"  // 通信アダプタ共通へ公開
  //┴
//┴

//########################################################
//# 専用名の前空間
//########################################################
namespace adpUART {
//========================================================
// Ａ．アダプタの基本
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 基本情報
  //━━━━━━━━━━━━━━━━━
    //─────────────────
    // ステータス
    //─────────────────
    const String ADP_ID   = "UART"; // アダプタID

//========================================================
// Ｂ．レスポンス
//========================================================
  void SEND_CONN(Stream* argConn){
    //┬
    //○メッセージをレスポンス
    if (argConn != nullptr) argConn->print(ctx.resMSG);
    P9_SHOW_LOG();
    //┴
  } /* SEND_CONN() */

//========================================================
// Ｅ．公開機能
//========================================================
  //━━━━━━━━━━━━━━━━━
  // ハンドラ
  //━━━━━━━━━━━━━━━━━
  void HANDLE(Stream* argConn){
    //┬
    //○サブ機からキューを要求
    argConn->print("REUEST!"); // 受信開始を通知
    //│
    //○サブから要求を受信
    String strFrame = "";
    while (argConn->available()) strFrame += (char)argConn->read();
    if (strFrame == "!NONE!") return;
    //│＼（要求がない場合）
    //│ ▼終了：早期リターン
    //│
    //●キュー情報をワークにセット
    P0_SETUP_CONTEXT(ADP_ID, strFrame);
    //│
    //○リクエストをデータ項目に分解
    P1_SET_ACD_CPATH();
    //│
    //●認証処理を実施
    if (P2_CHECK_AUTH()){SEND_CONN(argConn); return;}
    //│＼（処理継続が不可の場合）
    //│ ●エラーをレスポンス
    //│ ▼終了：早期リターン
    //│
    //●コマンド実行
    P3_RUN();
    //│
    //●実行結果をレスポンス
    SEND_CONN(argConn);
    //┴
  } /* HANDLE() */

} /* namespace adpUART */