#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：変更機能
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [システム共通]
import pyxel

# [アプリ共通]
import sys; sys.path.append('..'); import 共通.MMP
import sys; sys.path.append('..'); import 共通.音声

# [ゲーム共通]
from   main.データセット import DS

# [要素クラス]
from .P動作 import 動作プロセスの生成
from .P発射 import 発射プロセスの生成
from .P衝突 import 衝突プロセスの生成
from .P出現 import 出現プロセスの生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫データセットを用意する
        self.仕様  = 仕様()
        self.情報  = 情報()
        #│
        #≫プロセス一覧を用意する
        self.プロセス一覧 = [
            動作プロセスの生成() ,
            発射プロセスの生成() ,
            衝突プロセスの生成() ,
            出現プロセスの生成() ]
        #┴

	#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	#┃機能をコントロール
	#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
    def 実行(self):
        #┬
        #●アナログ値を読み取る
        if DS.情報.シーン == DS.仕様.シーンID.プレイ画面: 共通.MMP.接続.アナログ読取()
        #│
        #●ＢＧＭをリピート再生する                
        共通.音声.リピート再生()
        #│
        #●プロセス一覧を実行する
        for プロセス in self.プロセス一覧:プロセス.実行()
        #│
        #○自爆する
        if DS.obj.自機共通 is None      : return
        if not pyxel.btnr(pyxel.KEY_F10): return
        DS.obj.自機共通.情報.シールド = 0
        #┴
