#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：更新
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import  pyxel
import sys; sys.path.append('..'); import 共通.MMP
import sys; sys.path.append('..'); import 共通.音声
import main.共通部品 as 共通部品
from   ...データセット             import データセット as DS

from .P動作 import 動作プロセスの生成
from .P発射 import 発射プロセスの生成
from .P衝突 import 衝突プロセスの生成
from .P出現 import 出現プロセスの生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫更新アクションの一覧を作る
        self.アクション一覧 = (
            動作プロセスの生成() ,
            発射プロセスの生成() ,
            衝突プロセスの生成() ,
            出現プロセスの生成() )
        #┴

	#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	#┃機能をコントロール
	#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
    def 実行(self):
        #┬
        #●アナログ値を読み取る
        共通.MMP.接続.アナログ読取()
        #│
        #●ＢＧＭをリピート再生する
        self.FnリピートBGM()
        #│
        #◎└┐アクションを実行する
        for 各アクション in self.アクション一覧:
            #│＼（すべての処理を終えた場合）
            #│ ↓
            #│ ▼繰り返し処理を抜ける
            #│
            #●キャラクタを更新する
            if 各アクション is not None: 各アクション.実行()
        #┴ 	┴
	#────────────────────────────────────
    def FnリピートBGM(self):
        #┬
        #○BGMをリピート条件を確認する
        フレーム判定 = (pyxel.frame_count % 30 != 0)
        再生中要否   = (DS.情報.再生時間 is None)
        if フレーム判定 or 再生中要否: return
        #│＼（フレーム処理タイミングでないか、BGMの再生が不要の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #○再生時間カウンタをカウントダウンする
        DS.情報.再生時間 -= 1
        if DS.情報.再生時間 > 0: return
        #│＼（再生時間が終了していない場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #○再生時間カウンタを初期化する
        DS.情報.再生時間 = None
        #│
        #△┐ＢＧＭを再生する
        if DS.情報.シーン != DS.仕様.シーンID.プレイ画面:
        #　├┐（画面／終了画面の場合）
            #↓
            #●ＢＧＭを繰返し再生する
            共通.音声.繰返し再生()
            #┴
        elif DS.情報.ボスシーン is None:
        #　├┐（ボス画面の場合）
            #↓
            #●ＢＧＭを再生する
            共通部品.BGM_DFP.指定曲ザコ()
            #┴
        else:
        #　└┐（その他）
            #↓
            #●ＢＧＭを再生する
            共通部品.BGM_DFP.指定曲ボス()
        #┴　┴
