#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：更新
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [システム共通]
import pyxel

# [アプリ共通]
import sys; sys.path.append('..'); import 共通.MMP
import sys; sys.path.append('..'); import 共通.音声

# [ゲーム共通]
from main            import 共通部品
from main.データセット import DS

# [要素クラス]
from .P動作 import 動作プロセスの生成
from .P発射 import 発射プロセスの生成
from .P衝突 import 衝突プロセスの生成
from .P出現 import 出現プロセスの生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫データセットを用意する
        self.仕様  = 仕様()
        self.情報  = 情報()
        #│
        #≫プロセス一覧を用意する
        self.プロセス一覧 = [
            動作プロセスの生成() ,
            発射プロセスの生成() ,
            衝突プロセスの生成() ,
            出現プロセスの生成() ]
        #┴

	#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	#┃機能をコントロール
	#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
    def 実行(self):
        #┬
        #●アナログ値を読み取る
        共通.MMP.接続.アナログ読取()
        #│
        #△┐ＢＧＭを再生する
        判定 = (DS.情報.シーン == DS.仕様.シーンID.プレイ画面)
        if 判定: self.Fnプレイ画面用BGM()
        else   : 共通.音声.繰返し再生()
        #　├┐（画面／終了画面の場合）
            #↓
            #●プレイ画面用を再生する
            #┴
        #　└┐（その他）
            #↓
            #●プレイ画面以外用を再生する
            #┴
        #│
        #●プロセス一覧を実行する
        for プロセス in self.プロセス一覧:プロセス.実行()
        #┴

	#────────────────────────────────────
    def Fnプレイ画面用BGM(self):
        #┬
        #○BGMをリピート条件を確認する
        フレーム判定 = (pyxel.frame_count % 30 != 0)
        再生中要否   = (共通部品.BGM.再生時間 is None)
        if フレーム判定 or 再生中要否: return
        #│＼（フレーム処理タイミングでないか、BGMの再生が不要の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #○再生時間カウンタをカウントダウンする
        共通部品.BGM.再生時間 -= 1
        if 共通部品.BGM.再生時間 > 0: return
        #│＼（再生時間が終了していない場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #○再生時間カウンタを初期化する
        共通部品.BGM.再生時間 = None
        #│
        if DS.情報.ボスシーン is None: 共通部品.BGM.指定曲ザコ()
        else                         : 共通部品.BGM.指定曲ボス()
        #　├┐（ボス画面の場合）
            #↓
            #●ＢＧＭを再生する                
            #┴
        #　└┐（その他）
            #↓
            #●ＢＧＭを再生する
        #┴　┴