// filename : stream.h
//========================================================
// ストリーミング共通
//--------------------------------------------------------
// Ver 2.0.a (2026/09/01) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Arduino.h>
  //┴
//┴

//━━━━━━━━━━━━━━━━━
// 基本情報
//━━━━━━━━━━━━━━━━━
  static const int SS_RX_SIZE = 128 ; // 受信バッファ容量

//━━━━━━━━━━━━━━━━━
// スロット
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // 構造体
  //----------------------------------
  // 通信アダプタの名前空間で派生(名称:T_SLOT)し実体化(名称:ssTBL)
  //─────────────────
  struct SS_SLOT_TYPE {
    bool    used   = false ; // スロット有効性
    String  rx     = ""    ; // 受信バッファ
    bool    isOver = false ; // 容量超過フラグ
  };

  //─────────────────
  // スロット初期化
  //----------------------------------
  // 通信アダプタの名前空間で派生(名称:INIT_SLOT)
  //─────────────────
  void SS_INI_SLOT_BASE(SS_SLOT_TYPE& argSlot);

  //━━━━━━━━━━━━━━━━━
  // スロット
  //━━━━━━━━━━━━━━━━━
  String RECEIVE_STREAM(Stream& argConn, SS_SLOT_TYPE argBASE);
