// filename : command/_index_.h
//========================================================
// コマンド実行部門
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#pragma once
//┬
//□┐保有資源
  //│
  //□┐作業標準
    //│
    //□基本情報
    #define REQUEST_LENGTH 96 // リクエスト全体のバッファ長
    #define DAT_COUNT      10 // コマンド＋引数の個数
    #define DAT_LENGTH     20 // トークン最大長（未定義時のフォールバック）
    //│
    //□機能アダプタ情報（スロット構造体）
    struct T_MOD {
      const char* name; // 名前
      const char* desc; // 説明
    };
    //┴
  //│
  //□┐組織
    //│
    //□メンバー(経路アダプタ)
    #include "member/_index_.h"
    //┴
  //┴
//┴