// filename : connection/member/_API_.h
//========================================================
// 経路アダプタAPI（抽象基底クラス）
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#pragma once
//┬
//■インクルード
//┴

//========================================================
// 経路アダプタの抽象基底クラス
//========================================================
class AdapterBase {
protected:
  //┬
  //□┐メンバ
    //□コンテクスト(参照)
    MmpContext& ctx; // コンテクスト(参照)
    //┴

public:
  //┬
  //○コンストラクタ
  AdapterBase(MmpContext& argCtx): ctx(argCtx){}
  //┴
  //┬
  //○デストラクタ
  virtual ~AdapterBase(){}
  //┴
  
  //┬
  //□┐共通インタフェイス
    //│
    //□実行ハンドル
    virtual void handle() = 0;
  //┴
//┴
};