// filename : Dep_Connect/mode/main.cpp
//========================================================
// 接続部門／処理手順：メインモード共通
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/27)
//========================================================

 namespace modeMain{
//========================================================
//§公開機能
//========================================================
  //━━━━━━━━━━━━━━━━━
  // メインモード実行
  //━━━━━━━━━━━━━━━━━
  void RUN(){
    //┬
    //●ユーザ認証を実施
    if (adpFnAuth::CHECK()) return;
    //│＼（処理継続が不可の場合）
    //│ ▼終了：早期リターン
    //│
    //●コマンド部門に後続処理を移譲
    DepCommand::RunCommand();
    //┴
  } /* RUN() */

} /* namespace modeMain */