// filename : Dep_Connect/mode/sub.cpp
//========================================================
// 接続部門／処理手順：サブモード編
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/23)
//========================================================

//########################################################
 namespace modeSub{
//########################################################

//========================================================
//§非公開機能
//========================================================
  //─────────────────
  // 内部コマンドに応答
  //----------------------------------
  //【戻り値】
  // 応答の有無(論理値型)
  //  true ：あり
  //  false：なし
  //─────────────────
  bool Sys_Command() {
    //┬
    //●Sysコマンドを実行
    //▼終了：処理結果
    return adpFnBase::SysCmd(ctx.strFrame);
    //┴
  }

//========================================================
//§公開機能
//========================================================
  //━━━━━━━━━━━━━━━━━
  // サブモード
  //━━━━━━━━━━━━━━━━━
  void RUN(){
    //┬
    //●システムコマンドに応答
    if (Sys_Command()) return;
    //│＼（応答した場合）
    //│ ▼終了：早期リターン
    //│
    //○リクエストをMMPメインへ転送
    Log::Outln("(1/3) Requested to MMP(MAIN).");
    Serial1.print(ctx.strFrame);
    //│
    //◎┐受信待ちデータの取り込み
    Log::Outln("(2/3) Reading from MMP(MAIN).");
    String strRX = "";
    unsigned long startTime = millis();
    while (!strRX.endsWith("!")) {
      //│＼（終端に達した場合）
      //│ ▽完了：走査終了
      //│
      //○経過時間を確認
      if (millis() - startTime > LIMIT::TIME_READ) {
      //│＼（タイムアウトした場合）
          //○レスポンスMSGにエラーCDを反映
          //▼終了：早期リターン
          ctx.resMSG = RCD::TimOut;
          Log::Outln("(3/3) Error:Response timeout from MMP(MAIN).");
          return;
      } //～if
      //│
      //○受信データを受信バッファに加える
      if (Serial1.available()) strRX += (char)Serial1.read();
      //┴
    } //～while
    //│
    //○レスポンスMSGに[MMP本体からのレスポンス]を反映
    Log::Outln("(3/3) Success.");
    ctx.resMSG = strRX;
    //┴
  } /* RUN() */
} /* namespace modeSub */