#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能→表現プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
from   main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセス実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #○画面をクリアする
        pyxel.cls(0)
        #│
        #●キャラクタ別で表現する
        self.Fnキャラクタ別()
        #│
        #●シーン別で表現する
        DS.obj.シーン[DS.情報.シーン].FN表現.実行()
        #┴

	#────────────────────────────────────
    # キャラクタ別で表現
	#────────────────────────────────────
    def Fnキャラクタ別(self):
        #┬
        #○コンテナを確認する
        if len(DS.obj.カモロボ) == 0: return
        #│＼（コンテナが空の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #◎└┐キャラクタで表現する
        for カモロボ in DS.obj.カモロボ: カモロボ.FN表現.実行()
            #│＼（全チームを走査した場合）
            #│ ↓
            #│ ▼処理を中断する
            #│
            #●カモロボで表現する
        #┴