#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ：カモロボ(移動プロセス)
#┠─────────────────────────────────────
#┃更新コントローラが衝突プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import main.GAME共通 as 共通処理

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 衝突クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self   ,
            引数_個体   ):   #① 個体オブジェクト
        #┬
        #〇個体オブジェクトのリファレンスを用意する
        self._仕様  = 引数_個体.仕様
        self._情報  = 引数_個体.情報
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #├───────────────────────────────────
    #│カモロボの信号(LEDがON/OFF)に応じて、命中回数を更新する。
    #│カモロボの信号(LEDがON/OFF)に応じて、命中回数を更新する。
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #◎└┐命中のリアクションを処理する
        for 各ポート in self._仕様.ポート一覧:
            #│＼（全ポートを走査した場合）
            #│ ↓
            #│ ▼走査を終了する
            #│
            #●カモロボの状況を用意する
            結果 = 共通処理.入出力.入力走査(各ポート)
            #│
            #○命中回数を更新する
            if 結果[1] == 1 and self._情報.反応回数 == 0:
            #　 ＼（LEDが『ON』で『最初の反応』の場合）
                #↓
                #○反応回数を1にする
                #○命中回数を1つ増やす
                #○命中タイマをセットする
                self._情報.反応回数  = 1
                self._情報.命中回数 += 1
                self._情報.命中タイマ = self._仕様.命中タイマ
                #┴
            #│
            #○リアクション状態を確認する
            if 結果[1] != -1: return
            #│＼（LEDが『ON→OFF』ではない場合）
            #│ ↓
            #│ ▼処理を中断する
            #│
            #○反応回数を更新する
            self._情報.反応回数 += 1
            if self._情報.反応回数 > self._仕様.反応回数:
            #　 ＼（『最後の反応』の場合）
                #↓
                #○反応回数をリセットする
                self._情報.反応回数 = 0
        #┴　┴　┴