// filename : adNetTcp.h
//========================================================
// 通信アダプタ：ＴＣＰブリッジ
//--------------------------------------------------------
// ・TCP Bridgeサーバの起動
// ・TCP Bridgeのポーリング処理
//   受信→認証開始→認証検証→コマンド実行→結果返却
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/05) α版 
// ・ファイル名を変更
// ・全体的にリファクタリング
// ・各種リソース(処理/構造体など)を共通側に定義
// ・ユーザIDは共通関数で求めるよう変更
// ・フレームが完成したら後続処理するよう変更
// ・受信データの容量超過に対応
//========================================================
#pragma once
#include "ad.h"  // 通信アダプタ共通

//━━━━━━━━━━━━━━━━━
// グローバル資源(宣言)
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // 統一入口：fnPerser.hで定義
  //─────────────────
  extern String MMP_REQUEST(const String& cmdPath, int usrID);

//─────────────────
// サーバ情報
//----------------------------------
// 値セット:adNet.h - InitNet_Json2()
//─────────────────
struct typeServer {
  int      maxClients   = 0     ; // 最大接続数
  bool     writeLock    = false ; // 書込ロック有無
  uint32_t writeLockMs  = 0     ; // 書込ロック時間[単位:ms]
};
typeServer g_SRV_TCP;


//========================================================
// メイン処理
//--------------------------------------------------------
//【マルチ接続・持続型】
// TCPブリッジの各TCP接続を1ユーザとして扱う。
// 接続状態は継続的に保持する。
// タイムアウトや再接続があるため、ユーザー認証を行う。
//--------------------------------------------------------
//・フレーム書式   ：認証コード/コマンドパス!
//・状態管理       ：TCP接続ごとに1スロット
//・認証機能
//　├ 接続スロット：あり
//　└ 認証コード  ：あり
//========================================================
namespace {
//━━━━━━━━━━━━━━━━━
// ネームスペース資源(宣言)
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // 基本情報
  //─────────────────
  static const int ROUTE_ID    = ROUTE_ID_TCP ; // 通信経路のID
  WiFiServer*  ns_ACCEPTOR     = nullptr      ; // ユーザ受付資源
  static SLOT_TCP* ssTBL       = nullptr      ; // 接続管理TBL
  static TYPE_AUTH_SLOT AUTH_TBL[SS_SLOTS]    ; // 認証情報TBL

//━━━━━━━━━━━━━━━━━
// 接続管理
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // スロットを開放
  //----------------------------------
  // 当該接続は管理から外れる
  //─────────────────
  // 戻り値：なし
  //─────────────────
  void DETACH_SS_SLOT_SID(SLOT_TCP& argSlot){
    if (argSlot.conn) argSlot.conn .stop(); // 接続を切断
    INIT_SLOT_TCP(argSlot);
  } /* DETACH_SS_SLOT_SID() */

  //─────────────────
  // スロットを開放(キー：認証コード)
  //----------------------------------
  // 当該接続は管理から外れる
  //─────────────────
  // 戻り値：なし
  //─────────────────
  void DETACH_SS_SLOT_ACD(const String& argCD){
  //┬
  //◎┐先頭から走査
  for (int id = 0 ; id < g_SRV_TCP.maxClients ; id++) {
    //○次データの捜査を開始
    // ＼（全スロットを走査し終えた場合）
      //▼ループ処理を中断
    //│
    //◇┐スロットと照合
    if ( ssTBL[id].authCD == argCD ) DETACH_SS_SLOT_SID(ssTBL[id]);
      //├→（認証コードが一致する場合）
        //●この接続を管理から外す
        //┴
      //└┐
        //┴
  } /* END-for */
    //┴
  //┴
  } /* DETACH_SS_SLOT_ACD() */

  //─────────────────
  // 空きスロットを照会
  //----------------------------------
  // 該当条件：未使用
  //----------------------------------
  // 戻り値：
  // ・0,1,2...：空きスロットのID
  // ・-1：空きスロットが無い
  //─────────────────
  int GET_FREE_SID() {
  //┬
  //◎┐先頭から走査
  for (int id = 0 ; id < g_SRV_TCP.maxClients ; id++) {
    //○次データの捜査を開始
    // ＼（全スロットを走査し終えた場合）
      //▼ループ処理を中断
    //│
    //◇┐空きスロットを返す
    if ( !ssTBL[id].used ) return id;
      //├→（未使用の場合）
        //▼当該スロットIDを返す
        //┴
      //└┐
        //┴
  } /* END-for */
    //┴
  //│
  //▼エラーコードを返す(空きスロットがない)
  return -1;
  //┴
  } /* GET_FREE_SID() */

  //─────────────────
  // 古いスロットを照会
  //----------------------------------
  // 該当条件：使用中 かつ タイムアウト
  //----------------------------------
  // 戻り値：
  // ・0,1,2...：空きスロットのID
  // ・-1：空きスロットが無い
  //─────────────────
  int GET_OLD_SID() {
  //┬
  //◎┐先頭から走査
  for (int id = 0 ; id < g_SRV_TCP.maxClients ; id++) {
    //○次データの捜査を開始
    // ＼（全スロットを走査し終えた場合）
      //▼ループ処理を中断
    //│
    //◇┐空きスロットを返す
    if ( ssTBL[id].used &&
         millis() - ssTBL[id].lastActive > SS_TIME_LIMIT) return id;
      //├→（使用中でタイムアウト の場合）
        //▼当該スロットIDを返す
      //└┐
        //┴
    //┴
  } /* END-for */
  //│
  //▼エラーコードを返す(空きスロットがない)
  return -1;
  //┴
  } /* GET_OLD_SID() */

  //─────────────────
  // 接続管理TBLを作る
  //----------------------------------
  // 戻り値：なし
  //─────────────────
  void CREATE_SS_TBL(){
  //┬
  //○領域サイズをセット
  int maxCount = g_SRV_TCP.maxClients;
  //│
  //○領域を確保
   ssTBL = new SLOT_TCP[maxCount];
  //│
  //◎┐TBL全体を初期化
  for (int id = 0; id < maxCount ; id++) INIT_SLOT_TCP(ssTBL[id]);
    //●このスロットを初期化
    //┴
  //┴
  } /* CREATE_SS_TBL() */

  //─────────────────
  // 接続を接続スロットに割り当てる
  //----------------------------------
  // 戻り値：なし
  //----------------------------------
  // WiFiServerが受け付けた新たなTCP接続を
  // 自前の接続管理下に置く
  // ポーリング毎に実行される
  //─────────────────
  void ATTACH_SS_SLOT(){
  //┬
  //◎┐未管理のTCP接続をMMP管理対象へ登録する
  while (true) {
    //○新規のTCP接続を取得
    //  ※受付待ちキュー内のTCP接続情報を取得
    //  ※取得後、受付待ち状態から管理処理へ移行
    WiFiClient newConn = ns_ACCEPTOR ->available();
    if (!newConn) break;
    // ＼（取得に失敗(待ち接続なし)の場合）
      //▼ループ処理を中断
    //│
    //●空きスロットを探す
    int id = GET_FREE_SID();
    if (id < 0) {
    // ＼（空きスロットがない）
      //●古いスロットを探す
      id = GET_OLD_SID();
      if (id < 0) {
      // ＼（古いスロットがない）
        //▼カレント処理をスキップ
        newConn.stop();
        continue;
      //│
      //●古いスロットを開放
      DETACH_SS_SLOT_SID(ssTBL[id]);
      } /* END-if */
      //┴
    } /* END-if */
    //│
    //●スロットを初期化
    INIT_SLOT_TCP(ssTBL[id]);
    //│
    //○スロットに新規接続を登録
    ssTBL[id].used       = true     ; // 管理スロットを使用中へ変更
    ssTBL[id].conn       = newConn  ; // 新規のTCP接続を管理スロットへ登録
    ssTBL[id].conn .setNoDelay(true); // TCPパケット遅延制御を設定
    ssTBL[id].lastActive = millis() ; // 最終活動時刻を初期設定
    //┴
  } // while
  //┴
  } /* ATTACH_SS_SLOT() */

//━━━━━━━━━━━━━━━━━
// ルート別の処理
//----------------------------------
// 実行元：mmp.ino - loop()
//----------------------------------
// ルーティング先は１つ(MMPコマンド)
// ロジックで明示的に呼び出す..handle()を参照
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // ルート０：ホスト直下
  //─────────────────
  //　➡【該当処理なし】

  //─────────────────
  // ルート１：ＭＭＰコマンド
  //----------------------------------
  // 引数：
  // (参)接続管理スロット
  //─────────────────
  void routeMMP(SLOT_TCP& argSS){
  //┬
  //○┐０．前処理
    //○┐0-1.処理継続可否を確認
      //○物理条件(TCP接続状態)を確認
      if (!argSS.conn.connected()) return;
      // ＼（通信断の場合）
        //▼ルーティング処理を中断
      //│
      //○論理条件(接続管理状態)を確認
      if (!argSS.used) return;
      // ＼（未使用スロットの場合）
        // ▼ルーティング処理を中断
      //┴
    //│
    //○0-2.準備完了フラグを用意
    bool isReady = false;
    //│
    //○0-3.レスポンス内容の編集ワークを用意
    String strResp; // 文字列型
    //┴
  //│
  //◎┐１．受信待ちデータの取り込み
  while (argSS.conn.available()) {
    //○1-1.取り込みの継続を確認
    // ＼（受信待ちデータがない場合）
      //▼取り込みを終了
    //│
    //○1-2.受信バッファに受信データを加える
    char ch = (char)argSS.conn.read(); // ※バイト単位
    if (argSS.rx.length() < SS_RX_SIZE) {argSS.rx += ch;}
    else {
    // ＼（受信バッファが許容サイズを超過した場合）
      //○データ容量超過状態へ移行
      //○受信バッファの内容を破棄
      //▼ルーティング処理を中断
      //  ※残りの受信待ちデータは次回のルーティングで処理される
      argSS.isOverflow = true;
      argSS.rx         = "";
      return;
    } /*【1-2.受信バッファに１バイト取り込み】*/
    //│
    //◇┐1-3.フレーム完成時の処理フローを制御
    if (ch == '!') {
      //├→（コマンド終端を検出した場合）
        //◇┐1-3-1.処理フローを制御
        if (!argSS.isOverflow) {
        //├→（容量超過状態ではない場合）
          //○準備完了フラグを[ON]
          //▼取り込みを終了
          isReady = true;
          break;
        //└┐（その他；受信バッファ溢れ中の場合）
          //○データ容量超過状態を解除
          //○受信バッファをクリア
          argSS.isOverflow = false;
          argSS.rx         = ""   ;
          //│
          //○┐エラーコードをレスポンス
            //○レスポンス内容を編集
            //○ユーザにレスポンス
            strResp = "#DFL!";  // 受信バッファ溢れ
            argSS.conn.print(strResp);
            //┴
          //│
          //▼ルーティング処理を中断
          return;
        } /*【1-3-1.処理フローを制御】*/
    //┴
    } /*【1-3.取り込み終了条件を確認】*/
  } /*【１．受信待ちデータをすべて取り込み】*/
  //│
  //○┐２．事前準備
    //○2-1.後続処理の継続を判断
      if (!isReady) return;
    // ＼（準備が未完了の場合）
        //▼ルーティング処理を中断
    //│
    //●2-2.受信バッファをURI形式に変換
    FormatURI(argSS.rx);
    //│
    //○┐2-3.事前データを用意
      //○2-3-1.認証コードを取得
      //○2-3-2.コマンドパスを取得
      String authCD  = GetToken1(argSS.rx);
      String cmdPath = GetToken2(argSS.rx);
      //┴
    //│
    //○2-4.受信バッファを破棄
    argSS.rx = "";
    //┴
  //│
  //○┐３．認証を実施
    //○3-1.認証開始要求を処理
    if (authCD == "_START_!") {
      //├→（例外的に認証コードの中身が「接続開始コマンド」の文字列の場合）
        //●3-1-1.この接続を認証管理に加える
        String newAuthCD = AUTH_START(AUTH_TBL[0]);
        if(newAuthCD == ""){
        // ＼（管理開始に失敗した場合）
          //○┐エラーコードをレスポンス
            //○レスポンス内容を編集
            //○ユーザにレスポンス
            strResp = "#SS1!";  // 認証管理開始に失敗
            argSS.conn.print(strResp);
            //┴
          //│
          //▼ルーティング処理を中断
          return;
        } /* END-if*/
        //│
        //○3-1-2.認証コードをスロットに反映
        argSS.authCD = newAuthCD;
        //│
        //○┐3-1-3.認証コードをレスポンス
          //○レスポンス内容を編集
          //○ユーザにレスポンス
          strResp = newAuthCD;  // 認証コード
          argSS.conn.print(strResp);
          //┴
        //│
        //▼3-1-4.ルーティング処理を中断
        return;
      //┴
    } /*【3-1.この接続を認証管理の対象に登録】*/
    //│
    //○┐3-2.認証の実施
      //●3-2-1.認証情報と照合
      int authID = AUTH_GET_ID(AUTH_TBL[0], authCD);
      if (authID < 0) {
      // ＼（存在しない場合）
        //○┐エラーコードをレスポンス
          //○レスポンス内容を編集
          //○ユーザにレスポンス
          strResp = "#SS2!";  // 接続認証に失敗
          argSS.conn.print(strResp);
          //┴
        //│
        //▼ルーティング処理を中断
        return;
      } /* END-if */
      //│
      //○┐3-2-2.接続管理と照合
        //○認証コードを比較
        if (argSS.authCD != authCD) {
        // ＼（異なる場合）※再接続の条件
          //●古い接続管理を開放
          //○認証コードを上書き
          DETACH_SS_SLOT_ACD(authCD);
          argSS.authCD = authCD;
          //┴
        } /*【3-2-2.接続管理と照合】*/
        //│
        //●認証通過の痕跡を記録
        argSS.lastActive = millis();
        //┴
      //┴
    //┴
  //│
  //○┐４．MMPコマンドを実行
    //○┐4-1.コマンドを実行
      //●4-1-1.対象ユーザを特定
      //●4-1-2.コマンドパーサーへ処理を移譲
      int usrID = GET_USER_ID(ROUTE_ID, authID); // ※認証情報から照会
      String mmpResp = MMP_REQUEST(cmdPath, usrID);
      //┴
    //│
    //○┐4-2.実行結果をレスポンス
      //○4-2-1.レスポンス内容を編集
      //○4-2-2.ユーザにレスポンス
      strResp = mmpResp;  // コマンドパーサからのレスポンスのまま
      argSS.conn.print(strResp);
      //┴
    //┴
  //┴
  } /* routeMMP() */

//━━━━━━━━━━━━━━━━━
// ルーティング登録
//----------------------------------
// ロジックで明示的に呼び出す..handle()を参照
//━━━━━━━━━━━━━━━━━
//　➡【該当処理なし】

} /* namespace(匿名) */


//========================================================
// ハンドラ関連処理
//========================================================
namespace srvTcp {
  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //----------------------------------
  // 実行元：adNet.h - InitNet_Service()
  //━━━━━━━━━━━━━━━━━
  bool start(uint16_t port){

    // 1) 二重起動防止
    if (ns_ACCEPTOR ) return true      ; // ユーザ受付が準備済みか

    // 2) サーバを起動
    ns_ACCEPTOR  = new WiFiServer(port); // ユーザ受付に資源をセット
    ns_ACCEPTOR ->begin()              ; // サーバ起動 ※ポインタ経由
    ns_ACCEPTOR ->setNoDelay(true)     ; // TCPの遅延を抑制

    // 3) 接続管理TBLを作成
    CREATE_SS_TBL(); // 領域確保

    // 4) 正常終了
    return true;
  } /* start() */

  //━━━━━━━━━━━━━━━━━
  // ハンドラ入口（ポーリング入口）
  //----------------------------------
  // 実行元：mmp.ino - loop()
  //━━━━━━━━━━━━━━━━━
  void handle(){

    // 1) 起動チェック
    if (!ns_ACCEPTOR ) return; // サーバの実体化有無を評価

    // 2) {新規接続時｜再接続時}を管理対象に加える
    ATTACH_SS_SLOT();

    // 3) ルーティング処理
    int maxCount = g_SRV_TCP.maxClients; // 経路別の最大ユーザ数
    for (int id = 0; id < maxCount; id++) routeMMP(ssTBL[id]);
  } /* handle() */

} /* namespace srvTcp */
