// filename : adp-func.cpp
//========================================================
// 通信アダプタ共通：処理フロー
//  - 処理プロセスごとの部品を提供
//--------------------------------------------------------
// 2026/08/21 : 分離・大幅にリファクタリング
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <string.h>
  //│
  //■ＭＭＰシステム
  #include "conf.h" // [P5_RUN()]
  #include "adp.h"  // 通信アダプタ共通へ公開
  //┴
//┴

//━━━━━━━━━━━━━━━━━
// グローバル資源
//━━━━━━━━━━━━━━━━━
#if   defined(MMP_TYPE_MAIN)
  //─────────────────
  // コマンド管理
  //─────────────────
  #include "cmd.h" // RUN_COMMAND()
  extern String RUN_COMMAND(); // 所在：parser.h
#endif

//========================================================
// 処理プロセス（ユーザ認証以外）
//========================================================
//━━━━━━━━━━━━━━━━━
// ２．フレームを取得
//─────────────────
// 受付資源からフレーム文字列を取得する。
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // 受信バッファをURI形式に変換
  //----------------------------------
  //・先頭/末尾の不要文字を除去
  //・エスケープ文字処理 ※予定
  //・URI書式へ整形　　　※予定
  //─────────────────
  void P2_FORMAT_URI(String &str){
    while (str.startsWith("/")){str.remove(0, 1);            } // 先頭の'/' をすべて削除
    while (str.endsWith("/")  ){str.remove(str.length() - 1);} // 末尾の'/'をすべて削除
  }

//━━━━━━━━━━━━━━━━━
// ３．基本情報を取得
//─────────────────
// フレームから[認証コード][コマンドパス]を取得する。
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // フレームから第１トークンを取り出す
  //----------------------------------
  // 戻り値：第1トークン文字列
  //・正常：余計な文字を省いた純粋な内容
  //─────────────────
  String P3_GET_TOKEN1(String &pURI){
    //┬
    //◇┐URIから切り出す
    String retStr = ""   ; // リクエストURI
    int    pos    = pURI.indexOf('/');
    if (pos >= 0) {
      //├┐（URIに"/"がある）
        //○URIから第１トークンを取得
        retStr  = pURI.substring(0, pos) ;
        //┴
    } else {
      //└┐（その他；URIに"/"が無い）
        //○URIから第１トークンを取得
        retStr = pURI;
        //┴
    }   /* if */
    //│
    //●切り出した文字列を整形
    //▼RETURN：整形済みトークン ※末尾'!'があれば残る
    P2_FORMAT_URI(retStr); // 参照渡しなので内容は上書き
    return retStr  ;
    //┴
  } /* P3_GET_TOKEN1() */

  //─────────────────
  // フレームから第2トークン以降を取り出す
  //----------------------------------
  // 戻り値：第２トークン以降の文字列
  // ・正常：余計な文字を省いた純粋な内容
  //─────────────────
  String P3_GET_TOKEN2(String &pURI){
    //┬
    //◇┐URIから切り出す
    String retStr = ""   ; // 戻り値
    int    pos    = pURI.indexOf('/');
    if (pos >= 0) {
      //├┐（URIに"/"がある）
        //○URIから第２トークン以降を取得
        retStr = pURI.substring(pos + 1);
        //┴
      //└┐
        //┴
    } /* END-if */
    //│
    //●切り出した文字列を整形
    //▼RETURN：整形済みトークン以降 ※末尾'!'があれば残る
    P2_FORMAT_URI(retStr); // 参照渡しなので内容は上書き
    return retStr    ;
    //┴
  } /* P3_GET_TOKEN2() */

  //─────────────────
  // フレームから認証CDとコマンドパスをセット
  //----------------------------------
  // コンテクストのメンバを直接編集
  //─────────────────
  void P3_SET_ACD_CPATH() {
    //┬
    //◇┐認証CDを取得
    String tmpFrame = ctx.strFrame;
    if (tmpFrame.startsWith("@")) {
      //├┐（認証コードの開始文字がある場合）
        //○先頭の'@'を削除
        tmpFrame.remove(0, 1);
        //│
        //○[認証CD]に第１トークンをセット
        ctx.authCD  = P3_GET_TOKEN1(tmpFrame);
        //│
        //○[コマンドパス]に第２トークン以降をセット
        ctx.cmdPath = P3_GET_TOKEN2(tmpFrame);
        //┴
    } else {
      //└┐
        //○コマンドパスにフレーム全体(認証コード無し)をセット
         ctx.cmdPath = tmpFrame;
        //┴
    } /* END-if */
    //┴
  } /* P3_SET_ACD_CPATH() */

//━━━━━━━━━━━━━━━━━
// ５．MMPコマンドを実行
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // アクセスIDを求めてからコマンドを実行
  //----------------------------------
  // MMP本体：コマンド管理にＭＭＰコマンドの実行を指示
  // MMPサブ：MMP本体にシリアルコマンドをリクエスト
  //----------------------------------
  // 戻り値：文字列
  // ・正常：コマンド管理のレスポンス
  //─────────────────
  String P5_RUN(){
#if defined(MMP_TYPE_MAIN) // --┨ＭＭＰ本体┠----┐
    //┬
    //●RETURN:ＭＭＰコマンドを実行→リターン
    return RUN_COMMAND();
    //┴
#else // -----------------------┨ＭＭＰサブ┠----┤
    //┬
    //○コマンドをMMP本体にUART送信
    Serial1.print(ctx.strFrame); // 
    //│
    //◎┐受信待ちデータの取り込み
    String strRX = "";
    while (!strRX.endsWith("!")) {
      //│ ＼（終端文字を取得した場合）
      //│  ▼RETURN:可能(フレームが未完成)
      //│
      //○受信データを受信バッファに加える
      if (Serial1.available()) strRX += (char)Serial1.read();
      //┴
    } /* END-while */
    //│
    //▼処理継続の判定を返す
    return strRX;
    //┴
#endif // ----------------------------------------┘
  } /* P5_RUN() */