// filename : adp-func.cpp
//========================================================
// 通信アダプタ共通：処理フロー
//  - 処理プロセスごとの部品を提供
//--------------------------------------------------------
// 2026/08/21 : 分離・大幅にリファクタリング
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <string.h>
  //│
  //■ＭＭＰシステム
  #include "conf.h" // [F5_RUN()]
  #include "adp.h"  // 通信アダプタ共通へ公開
  //┴
//┴

//━━━━━━━━━━━━━━━━━
// グローバル資源
//━━━━━━━━━━━━━━━━━
#if defined(MMP_TYPE_MAIN) // --┨ＭＭＰ本体┠----┐
  //─────────────────
  // コマンド管理
  //─────────────────
  #include "cmd.h" // RUN_COMMAND()
  extern String RUN_COMMAND(); // 所在：parser.h
#endif // ----------------------------------------┘

//========================================================
// 処理プロセス（ユーザ認証以外）
//========================================================
//━━━━━━━━━━━━━━━━━
// ２．フレームを取得
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // 受信バッファをURI形式に変換
  //----------------------------------
  //・先頭/末尾の不要文字を除去
  //─────────────────
  void F2_FORMAT_URI(String &str){
    //┬
    //○先頭の不要な文字をすべて削除
    while (str.length() > 0) {
      char c = str.charAt(0);
      if (c=='/'||c==' '||c=='\t'||c=='\r'||c=='\n'||c=='\0')
      {str.remove(0, 1);} else {break;}
      } /* END-while */ 
    //│
    //○末尾の不要な文字をすべて削除
    while (str.length() > 0) {
      char c = str.charAt(str.length() - 1);
      if (c=='/'||c==' '||c=='\t'||c=='\r'||c=='\n'||c=='\0')
      {str.remove(str.length()-1);} else {break;}
      } /* END-while */ 
    //┴
  } /* F2_FORMAT_URI() */

  //━━━━━━━━━━━━━━━━━
  // ストリーム型のデータ処理
  //----------------------------------
  // 引数：
  // ・受信バッファ
  // ・オーバーフローフラグ
  // ・エラーメッセージ
  //----------------------------------
  // 戻り値：受信継続の要否（論理値）
  // ・true ：受信継続が「不要」
  // ・false：受信継続が「必要」
  //━━━━━━━━━━━━━━━━━
  bool F2_STREAM(
    String &argRx    , // 受信バッファ
    bool   &argIsOver, // オーバーフローフラグ
    String &argErrMsg  // エラーメッセージ
  ){
    //┬
    argErrMsg  = "";
    //│
    //○オーバーフロー発生を確認
    if (argRx.length() > SS_RX_SIZE) {
    //│＼（発生した場合）
        //○オーバーフロー中へ移行
        //○受信バッファをクリア
        //▼RETURN：受信継続が「不要」
        argIsOver = true;
        argRx     = ""  ;
        return true;
    } /* END-if */
    //│
    //○取り込み状態を確認
    if (!argRx.endsWith("!")) return false;
    //│＼（終端に達していない場合）
    //│ ▼RETURN：受信継続が「必要」
    //│
    //○オーバーフロー中を確認
    if (argIsOver) {
    //│＼（オーバーフロー中の場合）
        //○オーバーフロー中を解除
        //○受信バッファをクリア
        //●エラーコードをレスポンス
        //▼RETURN：受信継続が「不要」
        argIsOver = false  ;
        argRx     = ""     ;
        argErrMsg = "#DFL!";
        return true;
    } /* END-if */
    //│
    //○┐フレームを作成
      //○受信バッファをフレームにセット
      //○受信バッファをクリア
      //●フレームをURI形式に変換
      ctx.strFrame = argRx;
      argRx        = ""   ;
      F2_FORMAT_URI(ctx.strFrame);
      //┴
    //│
    //▼RETURN：受信継続が「不要」
    return true;
    //┴
  } /* F2_STREAM() */

//━━━━━━━━━━━━━━━━━
// ３．基本情報を取得
//─────────────────
// フレームから[認証コード][コマンドパス]を取得する。
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // フレームから第１トークンを取り出す
  //----------------------------------
  // 戻り値：第1トークン文字列
  //─────────────────
  String GET_TOK1(String &pURI){
    //┬
    //◇┐URIから切り出す
    String retStr = ""   ; // リクエストURI
    int    pos    = pURI.indexOf('/');
    if (pos >= 0) {
      //├┐（URIに"/"がある）
        //○URIから第１トークンを取得
        retStr  = pURI.substring(0, pos) ;
        //┴
    } else {
      //└┐（その他；URIに"/"が無い）
        //○URIから第１トークンを取得
        retStr = pURI;
        //┴
    }   /* if */
    //│
    //●切り出した文字列を整形
    F2_FORMAT_URI(retStr); // 参照渡しなので内容は上書き
    //│
    //▼RETURN：整形済みトークン
    return retStr  ;
    //┴
  } /* GET_TOK1() */

  //─────────────────
  // フレームから第2トークン以降を取り出す
  //----------------------------------
  // 戻り値：第２トークン以降の文字列
  //─────────────────
  String GET_TOK2(String &pURI){
    //┬
    //◇┐URIから切り出す
    String retStr = ""   ; // 戻り値
    int    pos    = pURI.indexOf('/');
    if (pos >= 0) {
      //├┐（URIに"/"がある）
        //○URIから第２トークン以降を取得
        retStr = pURI.substring(pos + 1);
        //┴
      //└┐
        //┴
    } /* END-if */
    //│
    //●切り出した文字列を整形
    F2_FORMAT_URI(retStr); // 参照渡しなので内容は上書き
    //│
    //▼RETURN：整形済みトークン以降
    return retStr    ;
    //┴
  } /* GET_TOK2() */

  //━━━━━━━━━━━━━━━━━
  // フレームから認証CDとコマンドパスをセット
  //━━━━━━━━━━━━━━━━━
  void F3_SET_ACD_CPATH() {
    //┬
    //◇┐認証CDを取得
    String tmpFrame = ctx.strFrame;
    if (tmpFrame.startsWith("@")) {
      //├┐（認証コードの開始文字がある場合）
        //○先頭の'@'を削除
        tmpFrame.remove(0, 1);
        //│
        //●第１トークンを[認証CD]にセット
        ctx.authCD  = GET_TOK1(tmpFrame);
        //│
        //●第２トークン以降を[コマンドパス]にセット
        ctx.cmdPath = GET_TOK2(tmpFrame);
        //┴
    } else {
      //└┐
        //○コマンドパスにフレーム全体(認証コード無し)をセット
         ctx.cmdPath = tmpFrame;
        //┴
    //│
    //○コマンドパスを大文字に置換
    ctx.cmdPath.toUpperCase();
    } /* END-if */
    //┴
  } /* F3_SET_ACD_CPATH() */

//━━━━━━━━━━━━━━━━━
// ５．MMPコマンドを実行
//━━━━━━━━━━━━━━━━━
  //━━━━━━━━━━━━━━━━━
  // コマンドを実行 または ＭＭＰ本体へ移譲
  //----------------------------------
  // MMP本体：コマンド管理にＭＭＰコマンドの実行を指示
  // MMPサブ：MMP本体にシリアルコマンドをリクエスト
  //----------------------------------
  // 戻り値：コマンド実行結果(文字列)
  //━━━━━━━━━━━━━━━━━
  String F5_RUN(){
#if defined(MMP_TYPE_MAIN) // --┨ＭＭＰ本体┠----┐
    //┬
    //●ＭＭＰコマンドを実行
    //▼RETURN：実行結果
    return RUN_COMMAND();
    //┴
#else // -----------------------┨ＭＭＰサブ┠----┤
    //┬
    //○コマンドをMMP本体にUART送信
    Serial1.print(ctx.strFrame); // 
    //│
    //◎┐受信待ちデータの取り込み
    String strRX = "";
    while (!strRX.endsWith("!")) {
      //│＼（終端文字を取得した場合）
      //│ ▼BREAK：取り込みをやめる
      //│
      //○受信データを受信バッファに加える
      if (Serial1.available()) strRX += (char)Serial1.read();
      //┴
    } /* END-while */
    //│
    //▼RETURN：ＭＭＰ本体からのレスポンス
    return strRX;
    //┴
#endif // ----------------------------------------┘
  } /* F5_RUN() */