// filename : adp.h
//========================================================
// アダプタ共通
//--------------------------------------------------------
//【目的】
// ・アダプタのトリガ資源を公開する
// ・アダプタが利用する共通関数・構造体定義を公開する
// ・アダプタのインタフェイスを公開する
//--------------------------------------------------------
// Ver 1.2.0 (2026/09/02) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Arduino.h>
  #include <queue>
  #include <mutex>
  //│
  //■ＭＭＰシステム
  #include "conf.h"
  #include "context.h"
  //┴
//┴

//━━━━━━━━━━━━━━━━━
// グローバル資源
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // コンテクスト
  //----------------------------------
  // ※定義：mmpCtx.h、実装：adp.cpp
  //─────────────────
  extern MmpContext ctx;


//========================================================
// ユーザ認証
//========================================================
  //─────────────────
  // 特殊コマンド
  //─────────────────
  static const String SP_CMD_START = "_START_!"; // 認証開始

  //─────────────────
  // テーブル初期化
  //─────────────────
  void AUTH_INIT_TBL();

//========================================================
// 接続情報：接続ごとの受信状態を管理
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 基本情報
  //━━━━━━━━━━━━━━━━━
  static const int SS_RX_SIZE = 128 ; // 受信バッファ容量

  //━━━━━━━━━━━━━━━━━
  // スロット
  //━━━━━━━━━━━━━━━━━
    //─────────────────
    // 構造体
    //─────────────────
    struct SS_SLOT_TYPE {
      bool    used   = false ; // スロット有効性
      String  rx     = ""    ; // 受信バッファ
      bool    isOver = false ; // 容量超過フラグ
    };

//========================================================
// 共通部品
//========================================================
  //【基本】
  namespace adpBase{
    void RUN(String argAdpID, String argFrame);
    void P9_SHOW_LOG();
  }

  //【ストリーム処理】
  namespace adpStream{
    void SS_INI_SLOT_BASE(SS_SLOT_TYPE& argSlot);
    String P1_STREAM(Stream& argConn, SS_SLOT_TYPE argBASES);
  }

  //【認証処理】
  namespace adpAUTH{
    void INIT_TBL(); // [adp]で利用
    bool CHECK()   ; // [adpBase]で利用
  }

  //【URI整形】
  void FORMAT_URI(String &str);  // [adpBase][adpStream]で利用


//========================================================
// アダプタ
//========================================================
  //【通信アダプタ：ＵＡＲＴ】
  namespace adpUART{
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＴＣＰ】
  namespace adpTCP{
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＷＥＢ ＡＰＩ】
  namespace adpWAPI{     
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＷｅｂＳｏｃｋｅｔ】
  namespace adpWSOC{     
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＢＬＥ】
  namespace adpBLE{
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＥＳＰ－ＮＯＷ】
  namespace adpESPN{
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＩＩＣ】
  namespace adpI2C{
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【ＷＥＢアダプタ：ＷＥＢ画面】
  namespace adpWEB{
    extern       bool ENABLED  ; // 有効性：{有効：true|無効：false}
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

//========================================================
// アダプタのトリガ
//========================================================
  void INIT_ADAPTER(); // 初期化
  void KICK_HANDLE() ; // ハンドルをキック