// filename : adp.h
//========================================================
// クライアント接続部門
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Arduino.h>
  //│
  //■全体資源
  #include "conf.h"    // 初期設定
  #include "context.h" // コンテクスト
  //┴
//┴

//━━━━━━━━━━━━━━━━━
// 全体共通資源
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // コンテクスト
  //─────────────────
  extern MmpContext ctx;

//========================================================
// 統括マネージャ
//========================================================
#include "adapter/mamager.cpp"
namespace AdapterManager{
  void INIT()  ; // 初期化
  void HANDLE(); // ハンドルをキック
}