// filename : adp.cpp
//========================================================
// アダプタ共通：アダプタ全体のライフサイクルを統括する
//--------------------------------------------------------
//【目的】
// ・アダプタのトリガを実行する
// ・各プロセスの共通処理を提供する
//--------------------------------------------------------
//【アダプタのトリガ】
//・INIT_ADAPTER()：アダプタを初期化
//・KICK_HANDLE() ：ダプタをポーリング
//--------------------------------------------------------
// Ver 1.2.0 (2026/08/25) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■ＭＭＰシステム
  #include "adp.h"  // 通信アダプタ共通へ公開
  //┴
//┴

//━━━━━━━━━━━━━━━━━
// グローバル資源
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // コンテクスト
  //----------------------------------
  //・定義元：mmpCtx.h
  //・利用法：externで実体をアクセス
  //・用途等：
  //  - 通信アダプタ  ：受信データ・処理状態の共有領域
  //  - コマンド管理  ：コマンド実行情報の共有領域
  //  - 機能モジュール：レスポンス生成領域、ユーザメモリ管理
  //─────────────────
  MmpContext ctx;

 #if defined(MMP_TYPE_MAIN) // ------------┨ＭＭＰ本体┠----┐
  //─────────────────
  // コマンド管理
  //----------------------------------
  //・定義元：cmd.h
  //・利用法：公開ポインタ経由でアクセス
  //・用途等：
  //  - 通信アダプタ  ：コマンド管理への移譲
  //  - コマンド管理  ：定義元自身
  //─────────────────
  #include "cmd.h"                // 定義元ソースファイル
  CmdManager  OBJ_CMD(ctx)      ; // 本体(依存性注入)
  CmdManager* INO_CMD = &OBJ_CMD; // 外部公開ポインタ
#endif // --------------------------------------------------┘

  
//========================================================
// アダプタの初期化
//--------------------------------------------------------
// 認証TBL・アダプタ・コマンド管理を開始
//========================================================
  void INIT_ADAPTER() {
    //┬
    //○開始表示
    Serial.println("<<アダプタの初期化>>");
    //│
#if defined(MMP_TYPE_MAIN) //┨ＭＭＰ本体┠┐
    //●認証情報TBLを初期化
    AUTH_INIT_TBL();
#endif //----------------------------------┘
    //│
    //●通信アダプタを初期化
#if defined(ADP_COM_UART ) //----┨UART┠--┐
    adpUART::START();
#endif //----------------------------------┘
    //│
#if defined(ADP_COM_TCP  ) //----┨TcpRaw┠┐
    adpTCP ::START();
#endif //----------------------------------┘
    //│
#if defined(ADP_COM_WAPI ) //----┨WebAPI┠┐
    adpWAPI::START();
#endif //----------------------------------┘
    //│
#if defined(ADP_COM_WSOC ) //----┨WebSoc┠┐
    adpWSOC::START();
#endif //----------------------------------┘
    //│    
#if defined(ADP_COM_BLE  ) //----┨ＢＬＥ┠┐
    adpBLE ::START();
#endif //----------------------------------┘
    //│    
#if defined(ADP_COM_ESPN ) //---┨ESP-NOW┠┐
    adpESPN::START();
#endif //----------------------------------┘
    //│    
#if defined(ADP_COM_I2C ) //-----┨ｉ２ｃ┠┐
    adpI2C ::START();
#endif //----------------------------------┘
    //│
    #if defined(ADP_WEB      ) //----┨ＷＥＢ┠┐
    adpWEB ::START();
#endif //----------------------------------┘
    //│
    //○終了表示
    Serial.println("");
    //│
#if defined(MMP_TYPE_MAIN) //┨ＭＭＰ本体┠┐
    //●コマンド管理を初期化
    INO_CMD->START();
#endif //----------------------------------┘
    //┴
  } /* INIT_ADAPTER() */

//========================================================
// アダプタ起動のポーリング用ハンドル
//========================================================
  void KICK_HANDLE(){
    //┬
    //●ハンドルをキック
#if defined(ADP_COM_UART) //---┨UART┠┐
    adpUART::HANDLE();
#endif //------------------------------┘
    //│
#if defined(ADP_COM_TCP ) //-┨TcpRaw┠┐
    adpTCP ::HANDLE();
#endif //------------------------------┘
    //│
#if defined(ADP_COM_WAPI) //-┨WebAPI┠┐
    adpWAPI::HANDLE();
#endif //------------------------------┘
    //│
#if defined(ADP_COM_WSOC) //-┨WebSoc┠┐
    adpWSOC::HANDLE();
#endif //------------------------------┘
    //│
#if defined(ADP_COM_BLE ) //-┨ＢＬＥ┠┐
    adpBLE ::HANDLE();
#endif //------------------------------┘
    //│
#if defined(ADP_COM_ESPN) //┨ESP-NOW┠┐
    adpESPN::HANDLE();
#endif //------------------------------┘
    //│
#if defined(ADP_COM_I2C ) //-┨ｉ２ｃ┠┐
    adpI2C ::HANDLE();
#endif //------------------------------┘
    //│
#if defined(ADP_WEB     ) //-┨ＷＥＢ┠┐
    adpWEB ::HANDLE();
#endif //------------------------------┘
    //┴
  } /* KICK_HANDLE() */