// filename : adp.h
//========================================================
// アダプタ共通
//--------------------------------------------------------
//【目的】
// ・アダプタのトリガ資源を公開する
// ・アダプタが利用する共通関数・構造体定義を公開する
// ・アダプタのインタフェイスを公開する
//--------------------------------------------------------
// Ver 1.2.0 (2026/08/25) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Arduino.h>
  #include <queue>
  #include <mutex>
  //│
  //■ＭＭＰシステム
  #include "conf.h"
  #include "mmpCtx.h"
//┴

//━━━━━━━━━━━━━━━━━
// グローバル資源
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // コンテクスト
  //----------------------------------
  // ※定義：mmpCtx.h、実装：adp.cpp
  //─────────────────
  extern MmpContext ctx;


//========================================================
// ユーザ認証
//========================================================
  //─────────────────
  // 特殊コマンド
  //─────────────────
  static const String SP_CMD_START = "_START_!"; // 認証開始

  //─────────────────
  // テーブル初期化
  //─────────────────
  void AUTH_INIT_TBL();

//========================================================
// 接続情報：接続ごとの受信状態を管理
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 基本情報
  //━━━━━━━━━━━━━━━━━
  static const int SS_RX_SIZE = 128 ; // 受信バッファ容量

  //━━━━━━━━━━━━━━━━━
  // スロット
  //━━━━━━━━━━━━━━━━━
    //─────────────────
    // 構造体
    //----------------------------------
    // 通信アダプタの名前空間で派生(名称:T_SLOT)し実体化(名称:ssTBL)
    //─────────────────
    struct SS_SLOT_TYPE {
      bool    used   = false ; // スロット有効性
      String  rx     = ""    ; // 受信バッファ
      bool    isOver = false ; // 容量超過フラグ
    };

    //─────────────────
    // スロット初期化
    //----------------------------------
    // 通信アダプタの名前空間で派生(名称:INIT_SLOT)
    //─────────────────
    void SS_INI_SLOT_BASE(SS_SLOT_TYPE& argSlot);

//========================================================
// 処理プロセス
//========================================================
  void   P0_SETUP_CONTEXT(String argAdpID, String argFrame);
  void   P1_FORMAT_URI(String &str);
  String P2_STREAM(Stream& argConn, SS_SLOT_TYPE argBASES);
  void   P1_SET_ACD_CPATH();
  bool   P2_CHECK_AUTH();
  void   P3_RUN();
  void   P9_SHOW_LOG();

//========================================================
// アダプタの公開情報
//========================================================
  //【通信アダプタ：ＵＡＲＴ】
  namespace adpUART{
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＴＣＰ】
  namespace adpTCP{
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＷＥＢ ＡＰＩ】
  namespace adpWAPI{     
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＷｅｂＳｏｃｋｅｔ】
  namespace adpWSOC{     
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＢＬＥ】
  namespace adpBLE{
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＥＳＰ－ＮＯＷ】
  namespace adpESPN{
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【通信アダプタ：Ｉ２Ｃ】
  namespace adpI2C{
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【ＷＥＢアダプタ：ＷＥＢ画面】
  namespace adpWEB{
    extern       bool ENABLED  ; // 有効性：{有効：true|無効：false}
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

//========================================================
// アダプタのトリガ
//========================================================
  void INIT_ADAPTER(); // 初期化
  void KICK_HANDLE() ; // ハンドルをキック