// filename : adp.h
//========================================================
// 通信アダプタ共通
//  - サービス・アダプタの共通資源を提供
//  - サービス・アダプタの初期化
//  - サービス・アダプタのハンドルをキック
//--------------------------------------------------------
// Ver 1.0.1 (2026/08/13) α版
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  //│
  //■ＭＭＰシステム
  #include "mmpCtx.h"
//┴

//━━━━━━━━━━━━━━━━━
// グローバル資源
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // コンテクスト
  //─────────────────
  extern MmpContext ctx;

//========================================================
// 基本情報
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 通信経路：この種類ごとにアダプタがある
  //━━━━━━━━━━━━━━━━━
  static const int PORTS_SERIAL    = 2 ; // シリアル系経路の総数
  static const int ROUTE_ID_SERIAL = 0 ; // シリアル用
  static const int ROUTE_ID_TCP    = 1 ; // TCPブリッジ用
  static const int ROUTE_ID_HTTP   = 2 ; // WebAPI用


//========================================================
// 接続情報：接続ごとの受信状態を管理
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 基本情報
  //━━━━━━━━━━━━━━━━━
  static const int SS_SLOTS   = 10  ; // 経路毎のスロット総数
  static const int SS_RX_SIZE = 256 ; // 受信バッファ容量

  //━━━━━━━━━━━━━━━━━
  // スロット
  //━━━━━━━━━━━━━━━━━
    //─────────────────
    // 構造体
    //----------------------------------
    // 通信アダプタの名前空間で派生(名称:T_SLOT)し実体化(名称:ssTBL)
    //─────────────────
    struct T_SS_BASE {
      bool    used       = false ; // スロット有効性
      String  rx         = ""    ; // 受信バッファ
      bool    isOverflow = false ; // 容量超過フラグ
    };

    //─────────────────
    // スロット初期化
    //----------------------------------
    // 通信アダプタの名前空間で派生(名称:INIT_SLOT)
    //─────────────────
    void INI_SS_SLOT_BASE(T_SS_BASE& argSlot);


//========================================================
// ユーザ認証
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 基本情報
  //━━━━━━━━━━━━━━━━━
  static const int AUTH_SLOTS      = 15     ; // 認証情報総数
  static const int AUTH_ROUTES     = 2      ; // 認証を用いる通信経路の総数
  const  uint32_t  AUTH_TIME_LIMIT = 100000 ; // タイムアウト閾値

  //━━━━━━━━━━━━━━━━━
  // スロット
  //━━━━━━━━━━━━━━━━━
    //─────────────────
    // 構造体
    //----------------------------------
    // 通信アダプタの名前空間で実体化(名称:authTBL)
    //─────────────────
    struct T_AUTH_SLOT {
      bool     used       = false ; // 有効性判定
      String   authCD     = ""    ; // 認証コード
      uint32_t lastActive = 0     ; // 最終更新時刻 ※単位：ms
    };

    //─────────────────
    // 初期化
    //----------------------------------
    // 通信アダプタの名前空間で派生(名称:INIT_SLOT)
    //─────────────────
    void INIT_SLOT_AUTH(T_AUTH_SLOT& argSlot);

    //─────────────────
    // 古いスロットを照会
    //----------------------------------
    // 該当条件：使用中 かつ タイムアウト
    //----------------------------------
    // 戻り値：
    // ・0,1,2...：タイムアウトしたスロットID
    // ・-1：タイムアウトしたスロットが無い
    //─────────────────
    int AUTH_GET_ID_OLD(T_AUTH_SLOT* pTBL);


//========================================================
// 処理プロセス
//========================================================
  //━━━━━━━━━━━━━━━━━
  // ０．ポーリング ハンドル
  //─────────────────
  // 接続スロットごとに行う前処理
  //━━━━━━━━━━━━━━━━━
  void P0_SETUP_CTX(int argRID, int argSID);

  //━━━━━━━━━━━━━━━━━
  // ２．フレームを取得
  //─────────────────
  // 受付資源からフレーム文字列を取得する。
  //━━━━━━━━━━━━━━━━━
    //─────────────────
    // 受信バッファをURI形式に変換
    //----------------------------------
    //・先頭/末尾の不要文字を除去
    //・エスケープ文字処理 ※予定
    //・URI書式へ整形　　　※予定
    //─────────────────
    void P2_FORMAT_URI(String &str);

  //━━━━━━━━━━━━━━━━━
  // ３．基本情報を取得
  //─────────────────
  // フレームから[認証コード][コマンドパス]を取得する。
  //━━━━━━━━━━━━━━━━━
    //─────────────────
    // フレームから第１トークンを取り出す
    //----------------------------------
    // 戻り値：第1トークン文字列
    //・正常：余計な文字を省いた純粋な内容
    //─────────────────
    String P3_GET_TOKEN1(String &pURI);

    //─────────────────
    // フレームから第2トークン以降を取り出す
    //----------------------------------
    // 戻り値：第２トークン以降の文字列
    // ・正常：余計な文字を省いた純粋な内容
    //─────────────────
    String P3_GET_TOKEN2(String &pURI);

  //━━━━━━━━━━━━━━━━━
  // ４．認証を実施
  //─────────────────
  // 新たに認証コードを発行し、当該ユーザの管理を開始する。
  // 認証コードで、認証情報TBLを照会する。
  //━━━━━━━━━━━━━━━━━
    //─────────────────
    // ユーザ認証を実施
    //----------------------------------
    // 認証コードが一致するスロットIDを取得
    //----------------------------------
    //─────────────────
    int P4_GET_ID(
      T_AUTH_SLOT*  pTBL,
      const String& pKeyCD
    );

    //─────────────────
    // 認証管理に加える
    //----------------------------------
    // 新たな認証コードでスロットを作成
    //----------------------------------
    String P4_START(T_AUTH_SLOT* pTBL);

  //━━━━━━━━━━━━━━━━━
  // ５．MMPコマンドを実行
  //─────────────────
  // コンテクストの内容を用いてアクセスIDを求める。
  // コマンド管理にＭＭＰコマンドの実行を指示する。
  //━━━━━━━━━━━━━━━━━
    String P5_RUN();


//━━━━━━━━━━━━━━━━━
// アダプタの公開情報
//━━━━━━━━━━━━━━━━━
  //【通信アダプタ：シリアル】
  namespace adpSerial{
    extern bool ENABLED ; // 有効性
    void start()        ; // サービス開始の指示
    void handle()       ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＴＣＰブリッジ】
  namespace adpTcp{
    extern int  SRV_PORT; // サーバのポート
    extern bool ENABLED ; // 有効性
    void start()        ; // サービス開始の指示
    void handle()       ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＷＥＢ ＡＰＩ】
  namespace adpHttp{     
    extern int  SRV_PORT; // サーバのポート
    extern bool ENABLED ; // 有効性
    void start()        ; // サービス開始の指示
    void handle()       ; // ポーリングのハンドル
  }

  //【ＷＥＢアダプタ：管理画面】
  namespace adpAdmin{
    extern int  SRV_PORT; // サーバのポート
    extern bool ENABLED ; // 有効性
    void start()        ; // サービス開始の指示
    void handle()       ; // ポーリングのハンドル
  }

  // サービス・アダプタ
  void InitAdapter(); // 初期化
  void kickHandle() ; // ハンドルをキック