// filename : adp.h
//========================================================
// 通信アダプタ共通
//  - サービス・アダプタの共通資源を提供
//  - サービス・アダプタの初期化
//  - サービス・アダプタのハンドルをキック
//--------------------------------------------------------
// 2026/08/21 : 新設
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  //│
  //■ＭＭＰシステム
  #include "conf.h"
  #include "mmpCtx.h"
//┴

//━━━━━━━━━━━━━━━━━
// グローバル資源
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // コンテクスト
  //─────────────────
  extern MmpContext ctx;

//========================================================
// 通信経路
//========================================================
  //─────────────────
  // 経路ID
  //─────────────────
  static const int ROUTE_ID_SERIAL = 0 ; // シリアル
  static const int ROUTE_ID_BLE    = 1 ; // BLE
  static const int ROUTE_ID_TCP    = 2 ; // TCPブリッジ
  static const int ROUTE_ID_HTTP   = 3 ; // WebAPI

//========================================================
// ユーザ認証
//========================================================
  //─────────────────
  // テーブル初期化
  //─────────────────
  void AUTH_INIT_TBL();

//========================================================
// 接続情報：接続ごとの受信状態を管理
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 基本情報
  //━━━━━━━━━━━━━━━━━
  static const int SS_RX_SIZE = 256 ; // 受信バッファ容量

  //━━━━━━━━━━━━━━━━━
  // スロット
  //━━━━━━━━━━━━━━━━━
    //─────────────────
    // 構造体
    //----------------------------------
    // 通信アダプタの名前空間で派生(名称:T_SLOT)し実体化(名称:ssTBL)
    //─────────────────
    struct SS_SLOT_TYPE {
      bool    used   = false ; // スロット有効性
      String  rx     = ""    ; // 受信バッファ
      bool    isOver = false ; // 容量超過フラグ
    };

    //─────────────────
    // スロット初期化
    //----------------------------------
    // 通信アダプタの名前空間で派生(名称:INIT_SLOT)
    //─────────────────
    void SS_INI_SLOT_BASE(SS_SLOT_TYPE& argSlot);


//========================================================
// 処理プロセス
//========================================================
  //━━━━━━━━━━━━━━━━━
  // ０．ハンドル
  //━━━━━━━━━━━━━━━━━
  void F0_SETUP(int argRID, int argSID);

  //━━━━━━━━━━━━━━━━━
  // ２．フレームを取得
  //━━━━━━━━━━━━━━━━━
  void F2_FORMAT_URI(String &str);
  bool F2_STREAM(
    String &argRx   , // 受信バッファ
    bool   &argOver , // オーバーフローフラグ
    String &argMsg    // エラーメッセージ
    );

  //━━━━━━━━━━━━━━━━━
  // ３．基本情報を取得
  //━━━━━━━━━━━━━━━━━
  void F3_SET_ACD_CPATH();

  //━━━━━━━━━━━━━━━━━
  // ４．認証を実施
  //━━━━━━━━━━━━━━━━━
  String F4_CHECK_AUTH();

  //━━━━━━━━━━━━━━━━━
  // ５．MMPコマンドを実行
  //━━━━━━━━━━━━━━━━━
  String F5_RUN();

  //━━━━━━━━━━━━━━━━━
  // デバッグログ表示
  //━━━━━━━━━━━━━━━━━
   void F_SHOW_LOG(String Msg);


//========================================================
// アダプタの公開情報
//========================================================
  //【通信アダプタ：シリアル】
  namespace adpSerial{
    extern const int  ROUTE_ID ; // 経路ID
    extern const int  SS_SLOTS ; // 使用スロット数
    extern       bool ENABLED  ; // 有効性：{有効：true|無効：false}
    void start()  ; // サービス開始の指示
    void handle() ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＴＣＰブリッジ】
  namespace adpTcp{
    extern const int  ROUTE_ID ; // 経路ID
    extern const int  SS_SLOTS ; // 使用スロット数
    extern       bool ENABLED  ; // 有効性：{有効：true|無効：false}
    void start()  ; // サービス開始の指示
    void handle() ; // ポーリングのハンドル
  }

  //【通信アダプタ：ＷＥＢ ＡＰＩ】
  namespace adpHttp{     
    extern const int  ROUTE_ID ; // 経路ID
    extern const int  SS_SLOTS ; // 使用スロット数
    extern       bool ENABLED  ; // 有効性：{有効：true|無効：false}
    void start()  ; // サービス開始の指示
    void handle() ; // ポーリングのハンドル
  }

  //【通信アダプタ：Bluetoothブリッジ】
  namespace adpBLE{
    extern const int  ROUTE_ID ; // 経路ID
    extern const int  SS_SLOTS ; // 使用スロット数
    extern       bool ENABLED  ; // 有効性：{有効：true|無効：false}
    void start()  ; // サービス開始の指示
    void handle() ; // ポーリングのハンドル
  }

  //【ＷＥＢアダプタ：ＷＥＢ画面】
  namespace adpWEB{
    extern       bool ENABLED  ; // 有効性：{有効：true|無効：false}
    void start()  ; // サービス開始の指示
    void handle() ; // ポーリングのハンドル
  }

//========================================================
// アダプタのトリガ
//========================================================
  void INIT_ADAPTER(); // 初期化
  void KICK_HANDLE() ; // ハンドルをキック