// filename : adp_auth.cpp
//========================================================
// 通信アダプタ共通：ユーザ認証用
//--------------------------------------------------------
//【目的】
// ・各プロセスの共通処理（ユーザ認証のみ）を提供する
//--------------------------------------------------------
//【共通資源】
//・CHECK_AUTH()：認証を実施・認証開始コマンド応答
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/23) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■ＭＭＰシステム
  #include "adp.h"
  //┴
//┴


//########################################################
//# 前空間
//########################################################
namespace adpAUTH{
//========================================================
//【非公開機能】
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 基本情報
  //━━━━━━━━━━━━━━━━━
  const uint32_t AUTH_TIME_LIMIT = 100000 ; // タイムアウト閾値

  //─────────────────
  // 構造体
  //─────────────────
  struct AU_SLOT_TYPE {
    bool     used       = false ; // 有効性判定
    String   authCD     = ""    ; // 認証コード
    uint32_t lastActive = 0     ; // 最終更新時刻 ※単位：ms
  };
  static AU_SLOT_TYPE* auTBL = nullptr; // 領域確保


  //─────────────────
  // スロット初期化
  //----------------------------------
  // 通信アダプタの名前空間で派生(名称:INIT_SLOT)
  //─────────────────
  void AUTH_INIT_SLOT(AU_SLOT_TYPE& argSlot){
    argSlot.used       = false ; // 有効性判定リセット(無効)
    argSlot.authCD     = ""    ; // 認証コードをクリア
    argSlot.lastActive = 0     ; // 最終更新時刻をリセット
  } /* AUTH_INIT_SLOT */


  //─────────────────
  // 認証コード生成
  //----------------------------------
  // 仕様:
  // ・AUTH_GROUPS の各グループから1文字採用
  // ・文字配置はランダム
  //----------------------------------
  // 戻り値：認証コード
  //─────────────────
  static const char* AUTH_GROUPS[] = { // 文字グループ
    "ABCDEFGHIJKLMNOPQRSTUVWXYZ",      // ・アルファベット大文字
    "abcdefghijklmnopqrstuvwxyz",      // ・アルファベット小文字
    "0123456789",                      // ・数字
    "-+(){}[]$%_^&"                    // ・記号
  };
  static constexpr int AUTH_CHR_GROUPS = sizeof(AUTH_GROUPS) / sizeof(AUTH_GROUPS[0]);
  //----------------------------------
  String AUTH_CREATE_ACD(){
    //┬
    //○前処理
    String tmpAID = "";
    //│
    //◎┐各グループから最低1文字取得
    for (int grpID = 0; grpID < AUTH_CHR_GROUPS; grpID++){
      //○カウンタ(グループID)を判定
      //│＼（全グループ処理が完了した場合）
      //│ ▽完了：走査終了
      //│
      //○当該グループの文字セットからランダムな１文字を追加
      int len = strlen(AUTH_GROUPS[grpID])   ; // データセット長
      tmpAID += AUTH_GROUPS[grpID][random(len)]; // ランダムな１文字を後方マージ
      //┴
    } /* END-for */
    //│
    //◎┐文字位置をシャッフル
    for (int nowID = 0; nowID < tmpAID.length(); nowID++){
      //│＼（最終桁に到達した場合）
      //│ ▽完了：走査終了
      //│
      //○当該桁の文字をランダムな桁の文字と入れ替え
      int  swapID    = random(tmpAID.length()); // 移動元桁数をランダムに取得
      char tmpChar   = tmpAID[nowID ]         ; // 当該桁の文字を退避
      tmpAID[nowID ] = tmpAID[swapID]         ; // 当該桁に移動元桁の文字を移送
      tmpAID[swapID] = tmpChar                ; // 移動元桁に退避した文字を移送
    }   /* for */
    //│
    //▼認証コードを返す
    return tmpAID;
  } /* AUTH_CREATE_ACD() */

  //─────────────────
  // 古いスロットを照会
  //----------------------------------
  // 該当条件：使用中 かつ タイムアウト
  //----------------------------------
  // 戻り値：
  // ・0～：タイムアウトしたスロットID
  // ・-1 ：空きスロットがない
  //─────────────────
  int AUTH_GET_ID_OLD() {
    //┬
    //◎┐先頭から走査
    for (int oldID = 0; oldID < ctx.accIDS; oldID++) {
      //│＼（スロットの上限に達した場合）
      //│ ▽完了：走査終了
      //│
      //○一致確認
      if ( auTBL[oldID].used &&
        millis() - auTBL[oldID].lastActive > AUTH_TIME_LIMIT) return oldID;
      //│＼（使用中でタイムアウトしている場合）
      //│ ▼返却：当該スロットID
      //┴
    } /* END-for */
    //│
    //▼返却：空きスロットがない
    return -1;
  } /* AUTH_GET_ID_OLD() */

  //─────────────────
  // ユーザ認証を実施
  //----------------------------------
  // 認証コードが一致するかを確認
  //----------------------------------
  // 引数：
  // ・認証コード ：検索キー
  //----------------------------------
  // 戻り値：認証ID(数値型)
  //  既データなし： -1
  //  既データあり： 0～
  //─────────────────
  int GET_EXIST_AID(String argACD){
    //┬
    //◎┐認証情報全体を照合
    for (int extID = 0; extID < ctx.accIDS; extID++){
      //│＼（スロットの上限に達した場合）
      //│ ▽完了：走査終了
      //│
      //○現在の認証情報と照合
      if (auTBL[extID].used && auTBL[extID].authCD == argACD) {
      //│＼（認証コードが一致)
          //○タイムスタンプを更新
          //▼返却：既データあり
          auTBL[extID].lastActive = millis();
          return extID;
      } /* END-if  */
      //┴
    } /* END-for */
    //│
    //▼返却：既データなし
    return -1;
  } /* GET_EXIST_AID() */

  //─────────────────
  // ユーザの認証管理を開始
  //----------------------------------
  // 新たな認証コードでスロットを作成
  // 新たな認証コードは認証情報TBL内で一意
  // 空きスロットが無い場合は失敗
  //----------------------------------
  // 戻り値：認証コード(文字列型)
  // ・成功： false
  // ・失敗： true
  //─────────────────
  bool NEW_USER(){
    //┬
    //○前処理
    String retCD = "" ; // 戻り値を[失敗]で初期化
    String newCD = "" ; // 新しい認証コード
    ctx.accID    = -1 ; // アクセスIDをクリア
    //│
    //◎┐新たな認証情報を登録
    for (int freeID = 0; freeID < ctx.accIDS; freeID++){
      //│＼（スロットの上限に達した場合）
      //│ ▽完了：走査終了
      //│
      //◇┐空きスロットに登録
      if (!auTBL[freeID].used){
        //├┐（スロットが未使用の場合)
          //◎┐新しい認証コードを生成
          while (true){
            //●認証コードを生成
            newCD = AUTH_CREATE_ACD();
            //│
            //●重複していないかを確認
            if (GET_EXIST_AID(newCD) < 0){break;}
            // ＼（存在しない場合）
              //▽中断：作成した認証コードを採用
          } /* END-while */
          //│
          //○コンテクストを更新
          ctx.resMSG = newCD + "!"; // レスポンス
          ctx.authCD = newCD      ; // 認証CD
          ctx.accID  = freeID     ; // アクセスID
          //│
          //○空きスロットに登録
          auTBL[freeID].authCD     = newCD;
          auTBL[freeID].used       = true;
          auTBL[freeID].lastActive = millis();
          //│
          //▼返却：成功
          return false;
        //└┐（その他）
          //┴
      } /* END-if */
      //┴
    } /* END-for */
    //│
    //▼返却：失敗
    return true;
  } /* NEW_USER() */


//========================================================
//【公開機能】
//========================================================
  //─────────────────
  // テーブル初期化
  //----------------------------------
  // アダプタ初期化の直前で実行
  //─────────────────
  void INIT_TBL() {
    auTBL = new AU_SLOT_TYPE[ctx.accIDS];
  } /* INIT_TBL() */

  //─────────────────
  // 認証を実施・認証開始コマンド応答
  //----------------------------------
  // 戻り値：認証結果（論理値）
  // ・false： 処理継続が可能
  // ・true ： 処理継続が不可
  //----------------------------------
  // 処理継続が可能の場合、早期エラーメッセージにセット
  //─────────────────
  bool CHECK(){
    //┬
    //◇┐認証開始要求に応答
    if (ctx.cmdPath == SP_CMD_START) {
      //├┐（「認証コード発行コマンド」の場合）
        //●認証管理に加える
        if(NEW_USER()){ctx.resMSG = "#SS1!";}
        //│＼（失敗した場合）
        //│ ○レスポンスにエラーIDをセット
        //│ ┴
        //│
        //▼返却：認証開始コマンド(要レスポンス)
        return true;
    } /* END-if */
    //│
    //○ユーザ認証対象を確認
    if (ctx.authCD == ""){ctx.accID = 0; return false;}
    //│＼（認証が不要の場合）
    //│ ○ユーザIDを共用IDにセット
    //│ ▼返却：認証が不要
    //│
    //○ユーザ認証を実施
    ctx.accID = GET_EXIST_AID(ctx.authCD);
    if (ctx.accID < 0){ctx.resMSG = "#SS2!"; return true;}
    //│＼（認証に失敗した場合）
    //│ ▼返却：[3]認証に失敗(要レスポンス)
    //│
    //▼返却：認証に成功
    return false;
  } /* CHECK() */

} /* namespace adpAUTH */