// filename : adpBLE.cpp
//========================================================
// 通信アダプタ：ＢＬＥ
//（イベント・コールバック型の通信）
//--------------------------------------------------------
//【目的】
// リクエストに従い、ＭＭＰコマンドを実行して、
// 結果をレスポンスする。
//--------------------------------------------------------
//【処理機能】
//・パケット処理なので１スロットを使いまわす。
//・コールバックによるイベントでリクエストをキューイングする。
//・同時接続数を１つに制限する為、コールバック(接続／切断)時に入場制限を管理する。
//--------------------------------------------------------
// Ver 1.2.0 (2026/08/25) 
// ・全体のロジックをシンプル化
//========================================================
#pragma once
//┬
//■┐インクルード
  //■┐Arduinoシステム
    //■BLE関連
    #include <BLEDevice.h> // ユーザ受付資源を
    #include <BLEServer.h> // ユーザ受付資源
    #include <BLEUtils.h > // ユーザ受付資源
    #include <BLE2902.h  > // ユーザ受付資源
    //│
    //■キューイング関連
    #include <Arduino.h>
    #include <queue>
    #include <mutex>
    //┴
  //│
  //■ＭＭＰシステム
  #include "adp.h"  // 通信アダプタ共通へ公開
  #include "dev.h"  // 統合デバイス定義（devBLEの公開資源を含む）
  //┴
//┴

//########################################################
//# 専用名の前空間
//########################################################
namespace adpBLE {
//========================================================
// Ａ．基本情報
//========================================================
  //─────────────────
  // 固有データ
  //─────────────────
  const int  ROUTE_ID = ROUTE_ID_BLE   ; // ＢＬＥ
  const int  SS_SLOTS = 1              ; // 固定スロット(1個を使いまわし)
        bool ENABLED  = false          ; // 有効性：{有効：true|無効：false}

  //─────────────────
  // 使用するサービス
  //─────────────────
  // ※BLEはサービスポートを持たないため、
  //   dev.hで公開されたBLE固有の受付資源を使用
  // ・BLE_RX：受信用キャラクタリスティック
  // ・BLE_TX：送信用キャラクタリスティック

  //─────────────────
  // 接続スロット
  //─────────────────
  struct T_SS_SLOT{
    SS_SLOT_TYPE       Base             ; // 基本メンバ
    String             connRX  = ""     ; // 受信資源（文字列ワーク）
    BLECharacteristic* connTX  = nullptr; // 送信資源（参照）
  };
  static T_SS_SLOT*    ssTBL   = nullptr; // 事前予約

  //─────────────────
  // キューイング
  //─────────────────
  const int WAIT_MS = 15        ; // 受信タイムラグ
  std::queue<String> QUEUE      ; // キューバッファ
  std::mutex         QUEUE_MUTEX; // 別スレッドとの衝突回避用のロック

//========================================================
// Ｂ．接続管理
//========================================================
  //─────────────────
  // 初期化
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  void SS_INI_SLOT(T_SS_SLOT& argSlot){}
  // ➡【該当処理なし】

  //─────────────────
  // 空きSID取得
  //----------------------------------
  // 戻り値：スロットID
  // ・0,1,2...：空きスロットのID
  // ・-1：空きスロットが無い
  //─────────────────
  int SS_GET_FREE_ID(){return -1;}
  // ➡【該当処理なし】

  //─────────────────
  // 動的アタッチ
  //----------------------------------
  // 戻り値 ：処理結果（論理値）
  // ・false：正常
  // ・true ：異常
  //─────────────────
  bool SS_ATTACH(){return true;}
  // ➡【該当処理なし】

//========================================================
// Ｃ．レスポンス
//========================================================
  //─────────────────
  // スロットの受付資源に送信
  //─────────────────
  void SEND_CONN(
    T_SS_SLOT&    argSS, // 送信先
    const String& argMSG // 送信メッセージ
  ){
    //┬
    //●ログ出力
    if (ctx.sysLog >= 0) F_SHOW_LOG(argMSG);
    //│
    //○メッセージをレスポンス
    if (argSS.connTX != nullptr) {
      argSS.connTX->setValue(argMSG.c_str());
      argSS.connTX->notify();
    } /* END-if */
    //┴
  } /* SEND_CONN() */

//========================================================
// Ｄ．プロセス部品
//========================================================
  //─────────────────
  // １．フレームを取得
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //----------------------------------
  // 戻り値：フレーム作成状況（論理値）
  // ・true ：未完成
  // ・false：完成
  //----------------------------------
  //【データ受信方式】
  // ・取得単位  ：パケット
  // ・データ受信：サーバ(参照) pCharacteristic->getValue()
  //─────────────────
  bool P1_MAKE_FRAME(T_SS_SLOT& argSS){
    //┬
    //○受信データからフレームを作成
    ctx.strFrame = argSS.connRX;
    //│
    //●フレームをURI形式に変換
    F2_FORMAT_URI(ctx.strFrame);
    //│
    //▼返却：フレームの作成状況
    return (ctx.strFrame == "" ? true : false);
  } /* P1_MAKE_FRAME() */

  //─────────────────
  // ２．基本情報を取得
  //─────────────────
  void P2_MAKE_INFO(){
    //┬
    //〇フレームの内容をもとに認証CD・コマンドパスにセット
    F3_SET_ACD_CPATH();
    //┴
  } /* P2_MAKE_INFO() */

  //─────────────────
  // ３．認証を実施
  //----------------------------------
  // 戻り値：認証結果（論理値）
  // ・false： 処理継続が可能
  // ・true ： 処理継続が不可
  //─────────────────
  bool P3_AUTH(T_SS_SLOT& argSS){
    //┬
    //●認証処理を実施
    if (F4_CHECK_AUTH()){SEND_CONN(argSS, ctx.errMSG); return true;}
    //│＼（処理継続が不可の場合）
    //│ ●エラーをレスポンス
    //│ ▼返却：処理継続が不可
    //│
    //▼返却：処理継続が可能
    return false;
  } /* P3_AUTH() */

  //─────────────────
  // ４．MMPコマンドを実行
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  void P4_RUN_COMMAND(T_SS_SLOT& argSS){
    //┬
    //●MMPコマンドを実行
    String resMMP = F5_RUN();
    //│
    //●実行結果をレスポンス
    SEND_CONN(argSS, resMMP);
    //┴
  } /* P4_RUN_COMMAND() */

//========================================================
// Ｅ．ルーティング処理（プロセス）
//========================================================
  void routeMMP(T_SS_SLOT& argSS){
    //┬
    //●１．フレームを取得
    if (P1_MAKE_FRAME(argSS)) return;
    //│＼（未完成の場合）
    //│ ▼終了：早期リターン
    //│
#if defined(MMP_TYPE_MAIN) // --┨ＭＭＰ本体┠----┐
    //○２．基本情報を取得
    P2_MAKE_INFO();
    //│
    //○３．ユーザ認証を実施
    if (P3_AUTH(argSS)) return;
    //│＼（処理継続が不可の場合）
    //│ ▼終了：早期リターン
#endif // ----------------------------------------┘
    //│
    //●４．MMPコマンドを実行
    P4_RUN_COMMAND(argSS);
    //┴
  } /* routeMMP() */

//========================================================
// Ｆ．コールバック・ルーティングの登録
//========================================================
  //━━━━━━━━━━━━━━━━━
  // コールバック：サーバ用
  //━━━━━━━━━━━━━━━━━
  class Callback_Server : public BLEServerCallbacks {
    //─────────────────
    // 接続イベント：接続制限（同時1人）
    //─────────────────
    void onConnect(BLEServer* pServer) override {
      //┬
      //○接続状況を確認
      if (ssTBL[0].Base.used) return;
      //│＼（既に参加している場合）
      //│ ▼終了：これ以上は参加させない
      //│
      //○アドバタイジングを停止(新規の侵入を物理的に防ぐ)
      if (devBLE::MY_SRV != nullptr) devBLE::MY_SRV->getAdvertising()->stop();
      //┴
    } /* onConnect() */

    //─────────────────
    // 切断イベント：接続制限を解除
    //─────────────────
    void onDisconnect(BLEServer* pServer) override {
      //┬
      //○アドバタイジングを再開
      if (devBLE::MY_SRV != nullptr) devBLE::MY_SRV->startAdvertising();
      //┴
    } /* onDisconnect() */
  }; /* Callback_Server */

  //━━━━━━━━━━━━━━━━━
  // コールバック：クライアント用
  //━━━━━━━━━━━━━━━━━
  class Callback_Client : public BLECharacteristicCallbacks {
    void onWrite(BLECharacteristic *pCharacteristic) override {
      //┬
      //○未取り込みデータを受信（getValue()参照後は消費されない）
      delay(WAIT_MS);
      String rxData = pCharacteristic->getValue(); // データ複製
      if (rxData.length() < 1) return;
      //│＼（空の場合）
      //│ ▼終了：早期リターン
      //│
      //○受信データをキューに追加
      std::lock_guard<std::mutex> lock(QUEUE_MUTEX);
      QUEUE.push(rxData);
      //┴
    }; /* onWrite() */
  }; /* Callback_Client */

  static Callback_Server ON_CONNECTION; // 接続・切断
  static Callback_Client ON_RECIVE    ; // データ受信

  //─────────────────
  // キューの取り出し
  //----------------------------------
  // 引数：
  // ・キュー受取用の変数
  //----------------------------------
  // 戻り値：キューの有無（論理値）
  // ・true ：あり
  // ・false：なし
  //─────────────────
  bool popQueue(String &rxData) {
    //┬
    //○別スレッドとの衝突回避用のロック
    std::lock_guard<std::mutex> lock(QUEUE_MUTEX);
    //│
    //○キューの容量を確認
    if (QUEUE.empty()) return false;
    //│＼（通信デバイスが起動していない場合）
    //│ ▼返却：なし
    //│
    //○先頭を抽出
    rxData = QUEUE.front();
    //│
    //○先頭を削除
    QUEUE.pop();
    //│
    //▼返却：あり
     return true;
  } /* popQueue() */

//========================================================
// Ｇ．公開機能
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //━━━━━━━━━━━━━━━━━
  void START() {
    //┬
    //○１．サービス資源を生成
    devBLE::MY_SRV->setCallbacks(&ON_CONNECTION); // サーバ(接続/切断)
    //│
    //○２．接続管理TBLを作成
    ssTBL = new T_SS_SLOT[SS_SLOTS];
    //│
    //○３．接続管理スロットを静的アタッチ
    ssTBL[0].Base.used = true          ; // 使用中
    ssTBL[0].connTX    = devBLE::BLE_TX; // サービス資源を登録
    //│
    //○４．ルーティングを登録
    devBLE::BLE_RX->setCallbacks(&ON_RECIVE    ); // サーバ(接続/切断)
    //│
    //○５．サービスを開始
    // ➡【該当処理なし】
    //│
    //○６．アダプタを有効化
    ENABLED = true; 
    //│
    //○７．起動ログを表示（正常終了）
    Serial.println("　[OK] Bluetooth");
    //┴
  } /* START() */

  //━━━━━━━━━━━━━━━━━
  // ハンドラ入口（ポーリング入口）
  //━━━━━━━━━━━━━━━━━
  void HANDLE(){
    //┬
    //○起動チェック
    if (!ENABLED) return; // 初期化済み
    //│＼（このアダプタが無効の場合）
    //│ ▼終了：早期リターン
    //│
    //◎┐ルーティングを指示
    String popDat;
    while (popQueue(popDat)) {
      //│＼（キューが空の場合）
      //│ ▼BREAK：ルーティングを終了
      //│
      //○接続管理スロットを動的アタッチ
      ssTBL[0].connRX = popDat;
      //│
      //●対象スロットを宣言
      F0_SETUP(ROUTE_ID, 0);
      //│
      //●MMPコマンドへルーティング
      routeMMP(ssTBL[0]);
      //┴
    } /* END-while */
    //┴
  } /* HANDLE() */

} /* namespace adpBLE */