// filename : adpSerial.h
//========================================================
// 通信アダプタ：シリアル
//--------------------------------------------------------
// ・シリアル通信のポーリング処理
//   受信→コマンド実行→結果返却
//-------------------------------------------------------- 
//--------------------------------------------------------
// Ver 1.0.1 (2026/08/05) α版 
//・ファイル名を変更
//・インクルードファイルを最適化
//・コメントを強化
//・namespaceを固有の1つにまとめた
//・各種リソース(処理/構造体など)を共通側に定義
//・ルート１：ＭＭＰコマンド
//  - 引数をスロット(オブジェクト)に変更
//  - プロセスを見直し
//  - ★接続情報を取り入れ
//  - フレームが完成したら後続処理するよう変更
//・必要な情報はすべてコンテストに集約
//・スロットを再設計
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  //│
  //■ＭＭＰシステム
  #include "adp.h" // 通信アダプタ共通
  //┴
//┴

//========================================================
// グローバル資源
//========================================================
  //━━━━━━━━━━━━━━━━━
  // コンテクスト
  //━━━━━━━━━━━━━━━━━
  extern MmpContext ctx;       // 所在：mmpCtx.h、実装：mmp.ino

  //━━━━━━━━━━━━━━━━━
  // コマンドパーサ
  //━━━━━━━━━━━━━━━━━
  extern String MMP_REQUEST(); // 所在：parser.h

//========================================================
// シリアル通信アダプター
//========================================================
namespace adpSerial {
//━━━━━━━━━━━━━━━━━
// 基本情報
//━━━━━━━━━━━━━━━━━
  static constexpr int ROUTE_ID = ROUTE_ID_SERIAL; // 経路IDを定義

//━━━━━━━━━━━━━━━━━
// ユーザ認証
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // スロット
  //─────────────────
  //　➡【該当処理なし】※常時接続は対象外

//━━━━━━━━━━━━━━━━━
// 接続情報
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // スロット
  //─────────────────
  static SLOT_STREAM* ssTBL = nullptr; // スロット型を定義

  //─────────────────
  // 接続情報TBLを作る
  //----------------------------------
  // 戻り値：なし
  //─────────────────
  void CREATE_SS_TBL(){
  //┬
  //○領域を確保
  ssTBL = new SLOT_STREAM[PORTS_SERIAL]; // シリアルポート総数
  //│
  //◎┐TBL全体を初期化
  for (int id = 0; id < PORTS_SERIAL; id++) INIT_SLOT_STREAM(ssTBL[id]);
    //●このスロットを初期化
    //┴
  //┴
  } /* CREATE_SS_TBL() */

  //─────────────────
  // スロットを開放
  //─────────────────
  //　➡【該当処理なし】※マルチ接続系が対象

  //─────────────────
  // 空きスロットを照会
  //─────────────────
  //　➡【該当処理なし】※マルチ接続系が対象

  //─────────────────
  // 接続を登録
  //----------------------------------
  // 開始処理で「一度だけ」実行すること
  //─────────────────
  void ATTACH_SS_SLOT(){
  //┬
  //○スロットに[USB-CDC]接続を登録
  ssTBL[0].conn   = &Serial  ; // 接続を登録(既存オブジェクトを指す)
  ssTBL[0].roomNo = 0        ; // ルーム番号
  //│
  //○スロットに[UART1]接続を登録
  ssTBL[1].conn   = &Serial1 ; // 接続を登録(既存オブジェクトを指す)
  ssTBL[1].roomNo = 1        ; // ルーム番号
  //┴
  } /* ATTACH_SS_SLOT() */

  //─────────────────
  // 4-2-2.接続認証を実施
  //─────────────────
  //　➡【該当処理なし】※常時接続は対象外

//━━━━━━━━━━━━━━━━━
// レスポンス
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // データ送信
  //─────────────────
  void SEND_CONN(
    SLOT_STREAM&  argSS  , // 送信先
    const String& argMSG   // 送信メッセージ
  ){
  //┬
  //○メッセージをレスポンス
  argSS.conn->print(argMSG);
  //┴
  } /* SEND_CONN() */


//━━━━━━━━━━━━━━━━━
// ルーティング処理
//----------------------------------
// ロジックで明示的に呼び出す ※handle()参照
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // ルート０：ホスト直下
  //─────────────────
    //　➡【該当処理なし】※Webサーバが対象

  //─────────────────
  // ルート１：ＭＭＰコマンド
  //----------------------------------
  // 引数：
  // (参)接続情報スロット
  //----------------------------------
  //【常時接続：切断時スロット維持型】
  //・物理ポート別の複数スロットが利用する
  //・1ユーザ・１スロットの構成
  //・通信状態は継続的に保持する
  //・常時接続のため、認証は行わない
  //----------------------------------
  //【処理フロー】
  //・状態管理       ：しない ※常時稼働なので不要
  //・フレーム分割   ：しない
  //・ユーザ認証     ：しない
  //・接続認証       ：しない
  //----------------------------------
  //【処理詳細】
  // 資源            ：Stream* (参照)
  // 資源の実体所有  ：しない
  // フレーム書式    ：{コマンドパス}!
  // データ受信単位  ：1byte[conn->read()]
  // フレーム化処理  ：する
  // 受信バッファ    ：する ※ポーリング跨ぎにも対応
  // 受信継続判定    ：available()
  // フレーム終端判定：する(データ受信単位で確認)
  //─────────────────
  void routeMMP(SLOT_STREAM& argSS){
  //┬
  //○┐０．前処理
    //○0-1.チェックアウトを確認
    //　➡【該当処理なし】※常時接続の物理ポートなので確認は不要
    //│
    //○0-2.ワーク変数を用意
    bool isReady = false;
    //│
    //○0-3.コンテクストを初期化
    ctx.cmdPath = ""          ; // コマンドパス（この後で取得）
    ctx.roomNo  = argSS.roomNo; // ルーム番号  （接続情報）
    ctx.zoneNo  = 0           ; // ゾーン番号  （0：固定）
    ctx.accNo   = -1          ; // アクセスID  （この後で取得）
    //┴
  //│
  //◎┐１．受信待ちデータの取り込み
  while (argSS.conn->available()){
    //○1-1.取り込みの継続を確認
    // ＼（受信待ちデータがない場合）
      //▼取り込みを終了
    //│
    //○1-2.受信データを受信バッファに加える
    char ch = (char)argSS.conn->read(); // ※バイト単位
    if (argSS.rx.length() < SS_RX_SIZE) {argSS.rx += ch;}
    else {
    // ＼（オーバーフローした場合）
      //○オーバーフロー中へ移行
      //○受信バッファの内容を破棄
      //▼ルーティング処理を中断
      //  ※残りの受信待ちデータは次回のルーティングで処理される
      argSS.isOverflow = true;
      argSS.rx         = "";
      return;
    } /*【1-2.受信データを受信バッファに加える】*/
    //│
    //◇┐1-3.フレームの完成を確認
    if (ch == '!') {
      //├→（コマンド終端を検出した場合）
        //●オーバーフローを確認
        if (argSS.isOverflow) {
        // ＼（オーバーフロー中の場合）
          //○オーバーフロー中を解除
          //○受信バッファを破棄
          argSS.isOverflow = false;
          argSS.rx         = ""   ;
          //│
          //●エラーコードをレスポンス
          //▼ルーティング処理を中断
          SEND_CONN(argSS, "#DFL!");
          return;
        } /*【1-3-1.オーバーフローを確認】*/
        //│
        //○準備完了フラグを[ON]
        //▼取り込みを終了
        isReady = true;
        break;
      //└┐
        //┴
    } /*【1-3.フレームの完成を確認】*/
    //┴
  } /*【１．受信待ちデータの取り込み】*/
  //│
  //○２．後続処理の継続を判断
  if (!isReady) return;
  // ＼（準備が未完了の場合）
    //▼ルーティング処理を中断
  //│
  //○┐３．事前準備
    //●3-1.受信バッファをURI形式に変換
    //○3-2.事前データを用意
    //○2-3.受信バッファを破棄
    FormatURI(argSS.rx);
    ctx.cmdPath = argSS.rx;
    argSS.rx    = "";
    //┴
  //│
  //○４．認証を実施
  //　➡【該当処理なし】
  //│
  //○┐５．MMPコマンドを実行
    //●5-1.コンテクストの内容を確定
    //●5-2.コマンドパーサーへ処理を移譲
    //●5-3.実行結果をレスポンス
    ctx.accNo      = GET_ACC_NO(); // コンテクスト：アクセスID
    String mmpResp = MMP_REQUEST();
    SEND_CONN(argSS, mmpResp);
    //┴
  //┴
  } /* routeMMP() */


//========================================================
// ポーリング
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //----------------------------------
  // 実行元：iniSerial.h - InitSerial()
  //━━━━━━━━━━━━━━━━━
  bool start() {

    // 1) 二重起動防止
    if(ssTBL) return true ; // 接続情報TBLの状況を評価

    // 2) サーバ資源生成
    //　➡【該当処理なし】※セットアップ処理で事前に初期化済み

    // 3) 接続情報TBLを作成
    CREATE_SS_TBL()       ; // 領域確保
    ATTACH_SS_SLOT()      ; // 常時接続スロットを登録

    // 4) ルーティング登録
    //　➡【該当処理なし】※Webサーバが対象

    // 5) サーバ開始
    //　➡【該当処理なし】※ネットワーク系が対象

    // 6) 正常終了
    return true;
  } /* start() */

  //━━━━━━━━━━━━━━━━━
  // ハンドラ入口（ポーリング入口）
  //----------------------------------
  // 実行元：mmp.ino - loop()
  //━━━━━━━━━━━━━━━━━
  void handle(){

    // 1) 起動チェック
    if(!ssTBL) return; // 接続情報TBLの状況を評価

    // 2) 経路を指定
    ctx.floorNo = ROUTE_ID    ; // フロア番号（経路ID）

    // 3) 新規接続のスロットを登録
    //　➡【該当処理なし】※start()で登録済み

    // 4) ルーティング処理
    for (int id = 0; id < PORTS_SERIAL; id++) routeMMP(ssTBL[id]);

  } /* handle() */

} /* namespace adpSerial */