// filename : adpTCP.cpp
//========================================================
// 通信アダプタ：ＴＣＰ
//（接続を維持するネットワーク通信）
//--------------------------------------------------------
//【目的】
// リクエストに従い、ＭＭＰコマンドを実行して、
// 結果をレスポンスする。
//--------------------------------------------------------
//【処理機能】
//・WiFiサーバの「全TCP接続」を順次処理する
//・リクエストを取得する
//  - ストリームが空の時点で、次のポーリングに引き継ぐ
//  - 既定サイズ超過の時点で、次のポーリングに引き継ぐ
//  - １リクエストを取得した時点で、処理を進行する
//  - １リクエストを取得できない場合はMMPコマンドは実行されない
//・リクエストを基に共通情報(コンテクスト)を纏める
//・必要に応じてユーザ認証を実施する
//・MMPコマンドを実行する
//・MMPコマンドの実行結果をレスポンする
//・処理中にエラーなどがあれば適宜レスポンスする
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/23) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <WiFi.h> // ユーザ受付資源
  //│
  //■ＭＭＰシステム
  #include "adp.h"  // 通信アダプタ共通へ公開
  //┴
//┴

//########################################################
//# 専用名の前空間
//########################################################
namespace adpTCP {
//========================================================
// Ａ．基本情報
//========================================================
  //─────────────────
  // 公開情報
  //─────────────────
  const int  ROUTE_ID = ROUTE_ID_TCP   ; // ＴＣＰ
  const int  SS_SLOTS = 10             ; // 複数スロット(接続タイミングで登録)
        bool ENABLED  = false          ; // 有効性：{有効：true|無効：false}

  //─────────────────
  // 使用するサービス
  //─────────────────
  static WiFiServer* ADP_SRV = nullptr; // WiFiサーバ
  static int         SRV_PORT = 8081  ; // ポート番号

  //─────────────────
  // 接続スロット
  //─────────────────
  struct T_SS_SLOT{
    SS_SLOT_TYPE Base; // 基本メンバ
    WiFiClient   conn; // アクセス資源(TCP接続の実体)
  };
  static T_SS_SLOT* ssTBL = nullptr; // 事前予約

//========================================================
// Ｂ．接続管理
//========================================================
  //─────────────────
  // 初期化
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  void SS_INI_SLOT(T_SS_SLOT& argSlot){
    SS_INI_SLOT_BASE(argSlot.Base)       ; // 基本メンバを初期化
    if (argSlot.conn) argSlot.conn.stop(); // アクセス資源を切断
  } /* SS_INI_SLOT() */

  //─────────────────
  // 空きSID取得
  //----------------------------------
  // 戻り値：スロットID
  // ・0,1,2...：空きスロットのID
  // ・-1：空きスロットが無い
  //─────────────────
  int SS_GET_FREE_ID() {
    //┬
    //◎┐先頭から走査
    for (int id = 0; id < SS_SLOTS; id++) {
    //│＼（全スロットを走査し終えた場合）
    //│ ▽中断：ループ処理を中断
    //│
    //○スロットを確認
    if (!ssTBL[id].Base.used) return id;
    //│＼（未使用の場合）
    //│ ▼返却：当該スロットIDを返す
    } /* END-for */
    //│
    //▼返却：エラーコード(空きスロットがない)
    return -1;
  } /* SS_GET_FREE_ID() */

  //─────────────────
  // 登録（自動1スロット）
  //----------------------------------
  // 戻り値：スロットID（数値）
  // ・-1   ：失敗
  // ・0以上：成功
  //─────────────────
  int SS_ATTACH_EACH(){return -1;}
  // ➡【該当処理なし】

  //─────────────────
  // 登録（自動一括スロット）
  //----------------------------------
  // 戻り値 ：スロットID（数値）
  // ・false：成功
  // ・true ：失敗
  //─────────────────
  bool SS_ATTACH_FOREACH(){
    //┬
    //◎┐未管理のTCP接続をMMP管理対象へ登録する
    while (true) {
      //○新規のTCP接続を取得
      //  ※受付待ちキュー内のTCP接続管理を取得
      //  ※取得後、受付待ち状態から管理処理へ移行
      WiFiClient newConn = ADP_SRV->available();
      if (!newConn) break;
      //│＼（取得に失敗(待ち接続なし)の場合）
      //│ ▽中断：ループ処理を中断
      //│
      //●空きスロットを探す
      int freeID = SS_GET_FREE_ID();
      if (freeID < 0) {continue;}
      //│＼（空きスロットがない）
      //│ ▽次へ：次を探す
      //│
      //●スロットを初期化
      SS_INI_SLOT(ssTBL[freeID]);
      //│
      //○スロットに新規接続を登録
      ssTBL[freeID].Base.used = true      ; // 使用中
      ssTBL[freeID].conn      = newConn   ; // TCP接続(実体)を登録
      ssTBL[freeID].conn.setNoDelay(true) ; // TCPパケット遅延制御
      //┴
    } //* END-while */
    //┴
  } /* SS_ATTACH_FOREACH() */

  //─────────────────
  // 登録（固定スロット）
  //─────────────────
  void SS_ATTACH_STATIC(){}
  // ➡【該当処理なし】

//========================================================
// Ｃ．レスポンス
//========================================================
  //─────────────────
  // スロットの受付資源に送信
  //─────────────────
  void SEND_CONN(
    T_SS_SLOT&    argSS, // 送信先
    const String& argMSG // 送信メッセージ
  ){
    //┬
    //●ログ出力
    if (ctx.sysLog >= 0) F_SHOW_LOG(argMSG);
    //│
    //○メッセージをレスポンス
    argSS.conn.print(argMSG);
    //┴
  } /* SEND_CONN() */

//========================================================
// Ｄ．プロセス部品
//========================================================
  //─────────────────
  // １．接続状態を確認
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //----------------------------------
  // 戻り値：接続状態（論理値）
  // ・false：良好
  // ・true ：不良
  //----------------------------------
  //【詳細】切断の場合：スロットを廃棄
  //─────────────────
  bool P1_CONNECT(T_SS_SLOT& argSS){
    //┬
    //○接続状態を確認
    if (!argSS.Base.used || !argSS.conn.connected()) {
    //│＼（[未使用スロット]または[接続切れ]の場合）
        //●スロットを初期化
        //▼返却：不良
        SS_INI_SLOT(argSS);
        return true;
    } // END-if */
    //│
    //▼返却：良好
    return false;
  } /* P1_CONNECT() */

  //─────────────────
  // ２．フレームを取得
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //----------------------------------
  // 戻り値：フレーム作成状況（論理値）
  // ・true ：未完成
  // ・false：完成
  //─────────────────
  bool P2_MAKE_FRAME(T_SS_SLOT& argSS){
    bool res = F2_STREAM(argSS.conn, argSS.Base);
    if (ctx.errMSG != "") SEND_CONN(argSS, ctx.errMSG);
    return res;
  } /* P2_MAKE_FRAME */

  //─────────────────
  // ３．基本情報を取得
  //─────────────────
  void P3_MAKE_INFO(){
    //┬
    //〇フレームの内容をもとに認証CD・コマンドパスにセット
    F3_SET_ACD_CPATH();
    //┴
  } /* P3_MAKE_INFO() */

  //─────────────────
  // ４．認証を実施
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //----------------------------------
  // 戻り値：認証後の指針(論理値)
  // ・false： 処理継続が可能
  // ・true ： 処理継続が不可
  //─────────────────
  bool P4_AUTH(T_SS_SLOT& argSS){
    //┬
    //●認証処理を実施
    if (F4_CHECK_AUTH()){SEND_CONN(argSS, ctx.errMSG); return true;}
    //│＼（処理継続が不可の場合）
    //│ ●エラーをレスポンス
    //│ ▼返却：処理継続が不可
    //│
    //▼返却：処理継続が可能
    return false;
  } /* P4_AUTH() */

  //─────────────────
  // ５．MMPコマンドを実行
  //─────────────────
  void P5_RUN_COMMAND(T_SS_SLOT& argSS){
    //┬
    //●MMPコマンドを実行
    String resMMP = F5_RUN();
    //│
    //●実行結果をレスポンス
    SEND_CONN(argSS, resMMP);
    //┴
  } /* P5_RUN_COMMAND() */

//========================================================
// Ｅ．ルーティング処理（プロセス）
//--------------------------------------------------------
// HANDLE()で明示的に呼び出す
//========================================================
  //─────────────────
  // ルート１：ＭＭＰコマンド
  //----------------------------------
  // 引数：
  // (参)接続管理スロット
  //─────────────────
  void routeMMP(T_SS_SLOT& argSS){
    //┬
    //○１．接続状態を確認
    if (P1_CONNECT(argSS)) return;
    //│＼（不良の場合）
    //│ ▼終了：早期リターン
    //│
    //●２．フレームを取得
    if (P2_MAKE_FRAME(argSS)) return;
    //│＼（未完成の場合）
    //│ ▼終了：早期リターン
    //│
#if defined(MMP_TYPE_MAIN) // --┨ＭＭＰ本体┠----┐
    //○３．基本情報を取得
    P3_MAKE_INFO();
    //│
    //○４．ユーザ認証を実施
    if (P4_AUTH(argSS)) return;
    //│＼（処理継続が不可の場合）
    //│ ▼終了：早期リターン
#endif // ----------------------------------------┘
    //│
    //●５．MMPコマンドを実行
    P5_RUN_COMMAND(argSS);
    //┴
  } /* routeMMP() */


//========================================================
// Ｆ．初期化・ポーリング用ハンドル
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //━━━━━━━━━━━━━━━━━
  void START(){
    //┬
    //○１．前準備の完了状態を確認
    if (ADP_SRV) {
    //│＼（通信デバイスが起動していない場合）
        //○エラーメッセージを表示
        //○無効化
        //▼終了：早期リターン
        Serial.println("　TCP Bridge : Wi-Fiサーバが起動していません ");
        ENABLED = false; // 無効
        return;
    } /* END-if */
    //│
    //○２．対象の通信経路を宣言
    ctx.routeID = ROUTE_ID; // コンテクストにルートIDをセット
    //│
    //○３．サーバ資源生成
    ADP_SRV = new WiFiServer(SRV_PORT) ; // WiFiServer
    //│
    //○４．接続管理TBLを作成
    ssTBL   = new T_SS_SLOT[SS_SLOTS];
    //│
    //○５．ルーティング登録
    // ➡【該当処理なし】※HANDLE()で明示的にルーティング
    //│
    //○６．サーバ開始
    ADP_SRV->setNoDelay(true)      ; // TCPの遅延を抑制
    ADP_SRV->begin();
    //│
    //○┐７．成功終了
      //○成功メッセージ
      //○有効化
      Serial.println(String("　[OK] TCP       -> port ") + String(SRV_PORT));
      ENABLED = true;
    //┴
  } /* START() */

  //━━━━━━━━━━━━━━━━━
  // ハンドラ入口（ポーリング入口）
  //━━━━━━━━━━━━━━━━━
  void HANDLE(){
    //┬
    //○１．起動チェック
    if (!ENABLED) return; // 初期化済み
    if (!ADP_SRV) return;
    //│＼（このアダプタが無効の場合）
    //│ ▼終了：早期リターン
    //│
    //○２．新規接続のスロットを登録
    SS_ATTACH_FOREACH();
    //│
    //◎┐３．ルーティング処理
    for (int slotID = 0; slotID < SS_SLOTS; slotID++) {
      //│＼（最終スロットに達した場合）
      //│ ▽完了：ルーティングを終了
      //│
      //●対象スロットをセット
      F0_SETUP(ROUTE_ID, slotID);
      //│
      //●MMPコマンドへルーティング
      routeMMP(ssTBL[slotID]);
      //┴
      } /* END-for */
    //┴
  } /* HANDLE() */

} /* namespace adpTCP */
