// filename : adpTcp.cpp
//========================================================
// 通信アダプタ：ＴＣＰブリッジ
//--------------------------------------------------------
//【常時接続：切断時スロット開放型】
//・基本処理      ：接続確認→受信→コマンド実行→結果返却
//・スロット構成  ：TCP接続毎に空スロットに動的割り当て
//・ポーリング跨ぎ：対応 ※通信状態は継続的に保持
//・ユーザ認証    ：常時接続のため行わない
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/13) α版 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <WiFi.h>
  //│
  //■ＭＭＰシステム
  #include "adp.h" // 通信アダプタ共通
  //┴
//┴

//########################################################
//# 専用名の前空間
//########################################################
namespace adpTcp {
//========================================================
// Ａ．基本情報
//========================================================
  static constexpr int ROUTE_ID = ROUTE_ID_TCP; // 経路IDを定義
  WiFiServer*      ns_ACCEPTOR  = nullptr     ; // ユーザ受付資源を定義
  bool ENABLED  = false; // ハンドル有効判定：有効：true、無効：false
  int  SRV_PORT = 8081 ; // サーバのポート

//========================================================
// Ｂ．ユーザ認証
//========================================================
  //─────────────────
  // スロット
  //─────────────────
  //　➡【該当処理なし】※常時接続は対象外


//========================================================
// Ｃ．接続情報
//========================================================
  //━━━━━━━━━━━━━━━━━
  // スロット
  //----------------------------------
  // 資源：WiFiClient (実体)
  // 所有：TCP接続のオブジェクトを所有する
  // 参照：外部生成されたストリーム資源
  // 割当：TCP接続ごとに１スロット
  // 持続：ポーリング中に新規接続で生成／切断で破棄
  //━━━━━━━━━━━━━━━━━
    //─────────────────
    // 領域確保：構造体の派生→実体化
    //─────────────────
    struct T_SS_SLOT : T_SS_BASE{ WiFiClient conn; };
    static T_SS_SLOT* ssTBL = nullptr;

    //─────────────────
    // スロット初期化：関数の派生
    //─────────────────
    void INI_SS_SLOT(T_SS_SLOT& argSlot){
      INI_SS_SLOT_BASE(argSlot);
      argSlot.conn.stop(); // 資源を破棄
    }

  //─────────────────
  // 接続情報TBLを作る
  //----------------------------------
  // 戻り値：なし
  //─────────────────
  void SS_CREATE_TBL(){
    //┬
    //○領域を確保
    ssTBL = new T_SS_SLOT[SS_SLOTS]; // 通信経路別の規定値
    //│
    //◎┐TBL全体を初期化
    for (int id = 0; id < SS_SLOTS ; id++) INI_SS_SLOT(ssTBL[id]);
      //│＼（全スロットを走査し終えた場合）
      //│ ▼ループ処理を中断
      //│
      //●このスロットを初期化
      //┴
    //┴
  } /* SS_CREATE_TBL() */

  //─────────────────
  // スロットを開放
  //----------------------------------
  // スロットを管理から外す
  //----------------------------------
  // 戻り値：なし
  //─────────────────
  void SS_DETACH_SLOT(T_SS_SLOT& argSlot){
    if (argSlot.conn) argSlot.conn .stop(); // 接続を切断
    INI_SS_SLOT(argSlot);
  } /* SS_DETACH_SLOT() */

  //─────────────────
  // 空きスロットを照会
  //----------------------------------
  // 該当条件：未使用
  //----------------------------------
  // 戻り値：
  // ・0,1,2...：空きスロットのID
  // ・-1：空きスロットが無い
  //─────────────────
  int SS_GET_FREE_ID() {
    //┬
    //◎┐先頭から走査
    for (int id = 0 ; id < SS_SLOTS ; id++) {
      //│＼（全スロットを走査し終えた場合）
      //│ ▼ループ処理を中断
      //│
      //○スロットを確認
      if (!ssTBL[id].used) return id;
      //│ ＼（未使用の場合）
      //│  ▼当該スロットIDを返す
      //┴
    } /* END-for */
    //│
    //▼エラーコードを返す(空きスロットがない)
    return -1;
    //┴
  } /* SS_GET_FREE_ID() */


  //─────────────────
  // 接続を登録
  //----------------------------------
  // 戻り値：なし
  //----------------------------------
  // 新たなTCP接続を接続情報下に置く
  // ポーリングで繰り返し実行される
  //─────────────────
  void SS_ATTACH_SLOT(){
    //┬
    //◎┐未管理のTCP接続をMMP管理対象へ登録する
    while (true) {
      //○新規のTCP接続を取得
      //  ※受付待ちキュー内のTCP接続情報を取得
      //  ※取得後、受付待ち状態から管理処理へ移行
      WiFiClient newConn = ns_ACCEPTOR->available();
      if (!newConn) break;
      //│ ＼（取得に失敗(待ち接続なし)の場合）
      //│  ▼ループ処理を中断
      //│
      //●空きスロットを探す
      int id = SS_GET_FREE_ID();
      if (id < 0) {continue;}
      //│ ＼（空きスロットがない）
      //│  ▼次を探す
      //│
      //●スロットを初期化
      INI_SS_SLOT(ssTBL[id]);
      //│
      //○スロットに新規接続を登録
      ssTBL[id].conn   = newConn      ; // CP接続を登録
      ssTBL[id].conn.setNoDelay(true) ; // TCPパケット遅延制御
      ssTBL[id].used   = true         ; // 仕様通
      //┴
    } // while
    //┴
  } /* SS_ATTACH_SLOT() */


//========================================================
// Ｄ．レスポンス
//========================================================
  //─────────────────
  // スロットの受付資源に送信
  //─────────────────
  void SEND_CONN(
    T_SS_SLOT&    argSS, // 送信先
    const String& argMSG // 送信メッセージ
  ){
    //┬
    //○メッセージをレスポンス
    argSS.conn.print(argMSG);
    //┴
  } /* SEND_CONN() */


//========================================================
// Ｅ．プロセス部品
//========================================================
  //─────────────────
  // １．接続状態を確認
  //----------------------------------
  //【詳細】
  // 常時接続の物理ポートなので確認は不要
  //----------------------------------
  // 戻り値：接続状態（論理値）
  // ・false：接続中
  // ・true ：切断中
  //─────────────────
  bool P1_CONNECT(T_SS_SLOT&  argSS){
    //┬
    //◇┐接続状態を判定
    if (argSS.conn.connected()) {
      //├┐（通常の場合）
        //▼RETURN：接続中
        return false;

    } else {
      //└┐（その他：切断の場合）
        //●スロットを廃棄
        //▼RETURN：切断中
        SS_DETACH_SLOT(argSS);
        return true; // 切断中
    } // END-if */
    //┴
  } /* P1_CONNECT() */

  //─────────────────
  // ２．フレームを取得(データ受信)
  //----------------------------------
  // 受信内容や状況から、受信データの取り込みを継続するかを判定する。
  // 条件(下記3を参照)を満たした場合、フレームをコンテクストに反映する。
  // 1.オーバーフローした場合、フラグ[ON]にセットし、処理継続を不可能と判定する。
  // 2.終端文字でない場合、処理継続を可能と判定する。
  // 3.終端文字を見つけた場合：
  //  ・通常            ：フレームをコンテクストに反映し、処理継続を不可能と判定する。
  //  ・オーバーフロー中：フラグを[OFF]にし、処理継続を不可能と判定する。
  //----------------------------------
  //【詳細】
  // データ受信単位  ：1byte[conn.read()] ★★実体★★
  // 受信バッファ    ：する ※ポーリング跨ぎにも対応
  // 受信継続判定    ：する ※オーバーフロー/終端文字/オーバーフロー解除/フレーム完成
  // フレーム終端判定：する ※データ受信単位で確認
  //----------------------------------
  // 戻り値：処理継続の判定（論理値）
  // ・true ：不可能
  // ・false：可能
  //─────────────────
  bool P21_RECEIVE(T_SS_SLOT&  argSS){
    //┬
    //○受信データを受信バッファに加える
    argSS.rx += (char)argSS.conn.read(); //★★実体★★
    //│
    //○受信バッファのオーバーフローを確認
    if (argSS.rx.length() > SS_RX_SIZE) {
    //│ ＼（オーバーフローになった場合）
        //▼当該スロットIDを返す
        //○オーバーフロー中へ移行
        //○受信バッファの内容を破棄
        //▼RETURN:不可能(オーバーフローが発生)
        argSS.isOverflow = true;
        argSS.rx         = "";
        return true;
    } /* END-if */
    //│
    //○取り込み状態を確認
    if (!argSS.rx.endsWith("!")) { return false; }
    //│ ＼（終端に達していない場合）※受信バッファを維持
    //│  ▼RETURN:可能(フレームが未完成)
    //│
    //◇┐理由別に処理
    if (!argSS.isOverflow) {
      //├┐（通常の場合）
        //●受信バッファをURI形式に変換
        //○コンテクストにフレームをセット
        P2_FORMAT_URI(argSS.rx);
        ctx.strFrame = argSS.rx;
        //┴
    } else {
      //└┐（その他）
        //○オーバーフロー中を解除
        //●エラーコードをレスポンス
        argSS.isOverflow = false;
        SEND_CONN(argSS, "#DFL!");
        //┴
    } /* END-if */
    //│
    //▼RETURN:不可能
    argSS.rx = "";
    return true;
    //┴
  } /* P21_RECEIVE() */

  //─────────────────
  // ２．フレームを取得
  //----------------------------------
  // フレームの作成状況を判定する。
  //----------------------------------
  //【詳細】
  // フレーム化処理  ：する
  // 受信継続判定    ：する[conn.available()] ★★実体★★
  //----------------------------------
  // 戻り値：フレーム作成状況（論理値）
  // ・true ：未完成
  // ・false：完成
  //─────────────────
  bool P2_MAKE_FRAME(T_SS_SLOT&  argSS){
    //┬
    //◎┐受信待ちデータの取り込み
    while (argSS.conn.available()){ //★★実体★★
      //│＼（未取り込みデータが空の場合）
      //│ ▼取り込みを終了
      //│
      //●受信バッファに蓄える
      if (P21_RECEIVE(argSS)) break;
      //│ ＼（継続が不可能と判断されたの場合）
      //│  ▼取り込みを打切り
      //┴
    } /* END-while */
    //│
    //▼処理継続の判定を返す
    return (ctx.strFrame == "" ? true : false);
    //┴
  } /* P2_MAKE_FRAME() */

  //─────────────────
  // ３．基本情報を取得
  //----------------------------------
  //【詳細】
  // フレーム書式    ：{コマンドパス}!
  //─────────────────
  void P3_MAKE_INFO(){
    //┬
    //〇受信待ちデータの取り込み
    ctx.cmdPath = ctx.strFrame;
    //┴
  } /* P3_MAKE_INFO() */

  //─────────────────
  // ４．認証を実施
  //----------------------------------
  //【詳細】
  // 常時接続のため、認証は行わない
  //----------------------------------
  // 戻り値：論理値
  // ・false：認証に成功
  // ・true ：認証に失敗
  //─────────────────
  bool P4_AUTH(){return false;}


//========================================================
// Ｆ．ルーティング処理
//--------------------------------------------------------
// handle()で明示的に呼び出す
//========================================================
  //─────────────────
  // ルート１：ＭＭＰコマンド
  //----------------------------------
  // 引数：
  // (参)接続情報スロット
  //─────────────────
  void routeMMP(T_SS_SLOT& argSS){
    //┬
    //○１．接続状態を確認
    if (P1_CONNECT(argSS)) return;
    //│ ＼（切断の場合）
    //│  ▼処理を中断
    //│
    //●２．フレームを取得
    if (P2_MAKE_FRAME(argSS)) return;
    //│ ＼（フレームが未完成の場合）
    //│  ▼処理を中断
    //│
    //○３．基本情報を取得
    P3_MAKE_INFO();
    //│
    //○４．認証を実施
    if (P4_AUTH()) return;
    //│ ＼（認証に失敗した場合）
    //│  ▼処理を中断
    //│
    //●５．MMPコマンドを実行
    String resMMP = P5_RUN();
    //│
    //●６．実行結果をレスポンス
    SEND_CONN(argSS, resMMP);
    //┴
  } /* routeMMP() */

  //─────────────────
  // ルート２：ホスト直下
  //─────────────────
  //　➡【該当処理なし】※Webサーバが対象


//========================================================
// Ｇ．初期化・ポーリング
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //----------------------------------
  // ロジックで明示的に呼び出す ※handle()参照
  //━━━━━━━━━━━━━━━━━
  void start(){
    //┬
    //○１．前準備の完了状態を確認
    if (ns_ACCEPTOR ) {
    //│ ＼（通信デバイスが起動していない場合）
        //○エラーメッセージを表示
        //○無効化
        //▼異常終了
        Serial.println("　TCP Bridge : Wi-Fiサーバが起動していません ");
        ENABLED = false; // 無効
        return;
    } /* END-if */
    //│
    //○２．サーバ資源生成
    ns_ACCEPTOR = new WiFiServer(SRV_PORT) ; // WiFiServer
    //│
    //○３．接続情報TBLを作成
    SS_CREATE_TBL()                    ; // 領域確保
    //│
    //○４．ルーティング登録
    //　➡【該当処理なし】※Webサーバが対象
    //│
    //○５．サーバ開始
    ns_ACCEPTOR->setNoDelay(true)      ; // TCPの遅延を抑制
    ns_ACCEPTOR->begin();
    //│
    //○┐６．成功終了
      //○成功メッセージ
      //○有効化
      Serial.println(String("　TCP Bridge : OK -> port ") + String(SRV_PORT));
      ENABLED = true;
    //┴
  } /* start() */

  //━━━━━━━━━━━━━━━━━
  // ハンドラ入口（ポーリング入口）
  //━━━━━━━━━━━━━━━━━
  void handle(){
    //┬
    //○１．起動チェック
    if (!ENABLED    ) return;
    if (!ns_ACCEPTOR) return; // サーバの実体化有無を評価
    //│
    //○２．新規接続のスロットを登録
    SS_ATTACH_SLOT();
    //│
    //◎┐３．ルーティング処理
    for (int slotID = 0; slotID < SS_SLOTS; slotID++) {
      //│＼（最終スロットに達した場合）
      //│ ▼ルーティングを終了
      //│
      //●コンテクストをセットアップ
      //●スロット処理を指示
      P0_SETUP_CTX(ROUTE_ID, slotID); // コンテクストをセットアップ
      routeMMP(ssTBL[slotID])        ; // MMPコマンドへルーティング
      //┴
      } /* END-for */
    //┴
  } /* handle() */

} /* namespace adpTcp */
