// filename : adpTCP.cpp
//========================================================
// 通信アダプタ：ＴｃｐＲＡＷ
//（接続を維持するネットワーク通信）
//--------------------------------------------------------
//【目的】
// リクエストに従い、ＭＭＰコマンドを実行して、
// 結果をレスポンスする。
//--------------------------------------------------------
//【処理機能】
//・TCP接続毎に資源の実体をスロットに割り当てる。
//・ポーリング跨りでストリーム処理するため接続数だけスロットを消費する。
//--------------------------------------------------------
// Ver 1.2.1 (2026/08/26) 
// ・全体のロジックをシンプル化
// ・ハンドルで切断スロットをパージする処理を追加
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <WiFi.h> // ユーザ受付資源
  //│
  //■ＭＭＰシステム
  #include "adp.h"  // 通信アダプタ共通へ公開
  //┴
//┴

//########################################################
//# 専用名の前空間
//########################################################
namespace adpTCP {
//========================================================
// Ａ．基本情報
//========================================================
  //─────────────────
  // 固有データ
  //─────────────────
  const int  ROUTE_ID = ROUTE_ID_TCP   ; // ＴＣＰ
  const int  SS_SLOTS = 10             ; // 複数スロット(接続タイミングで登録)
        bool ENABLED  = false          ; // 有効性：{有効：true|無効：false}

  //─────────────────
  // 使用するサービス
  //─────────────────
  static WiFiServer* ADP_SRV = nullptr; // WiFiサーバ
  static int         SRV_PORT = 8081  ; // ポート番号

  //─────────────────
  // 接続スロット
  //─────────────────
  struct T_SS_SLOT{
    SS_SLOT_TYPE    Base              ; // 基本メンバ
    WiFiClient      conn              ; // アクセス資源(TCP接続の実体)
  };
  static T_SS_SLOT* ssTBL = nullptr   ; // 事前予約

//========================================================
// Ｂ．接続管理
//========================================================
  //─────────────────
  // 初期化
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  void SS_INI_SLOT(T_SS_SLOT& argSlot){
    SS_INI_SLOT_BASE(argSlot.Base)       ; // 基本メンバを初期化
    if (argSlot.conn) argSlot.conn.stop(); // アクセス資源を切断
  } /* SS_INI_SLOT() */
  
  //─────────────────
  // 空きSID取得
  //----------------------------------
  // 戻り値：スロットID
  // ・0,1,2...：空きスロットのID
  // ・-1：空きスロットが無い
  //─────────────────
  int SS_GET_FREE_ID() {
    //┬
    //◎┐先頭から走査
    for (int ID = 0; ID < SS_SLOTS; ID++) {
      //│＼（全スロットを走査し終えた場合）
      //│ ▽中断：ループ処理を中断
      //│
      //○スロットを確認
      if (!ssTBL[ID].Base.used) return ID;
      //│＼（未使用の場合）
      //│ ▼返却：当該スロットIDを返す
      } /* END-for */
    //│
    //▼返却：エラーコード(空きスロットがない)
    return -1;
    //┴
  } /* SS_GET_FREE_ID() */

  //─────────────────
  // 動的アタッチ
  //----------------------------------
  // 戻り値 ：処理結果（論理値）
  // ・false：正常
  // ・true ：異常
  //─────────────────
  bool SS_ATTACH(){
    //┬
    //◎┐未管理のTCP接続をMMP管理対象へ登録する
    while (true) {
      //│
      //○新規のTCP接続を取得
      WiFiClient newConn = ADP_SRV->available();
      if (!newConn) return false;
      //│＼（あらたな接続がない場合）
      //│ ▼返却：正常
      //│
      //●空きスロットを探す
      int ID = SS_GET_FREE_ID();
      if (ID < 0) return true;
      //│＼（空きスロットがない）
      //│ ▼返却：異常
      //│
      //●スロットを初期化
      SS_INI_SLOT(ssTBL[ID]);
      //│
      //○スロットに新規接続を登録
      ssTBL[ID].Base.used = true      ; // 使用中
      ssTBL[ID].conn      = newConn   ; // TCP接続(実体)を登録
      ssTBL[ID].conn.setNoDelay(true) ; // TCPパケット遅延制御
      //┴
    } //* END-while */
  } /* SS_ATTACH() */

//========================================================
// Ｃ．レスポンス
//========================================================
  //─────────────────
  // スロットの受付資源に送信
  //─────────────────
  void SEND_CONN(T_SS_SLOT& argSS){
    //┬
    //○メッセージをレスポンス
    argSS.conn.print(ctx.resMSG);
    //│
    //●ログ出力
    F_SHOW_LOG();
    //┴
  } /* SEND_CONN() */

//========================================================
// Ｄ．プロセス部品
//========================================================
  //─────────────────
  // １．フレームを取得
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //----------------------------------
  // 戻り値：フレーム作成状況（論理値）
  // ・true ：未完成
  // ・false：完成
  //─────────────────
  bool P1_MAKE_FRAME(T_SS_SLOT& argSS){
    bool res = F2_STREAM(argSS.conn, argSS.Base);
    if (ctx.resMSG != "") SEND_CONN(argSS);
    return res;
  } /* P1_MAKE_FRAME */

  //─────────────────
  // ２．基本情報を取得
  //─────────────────
  void P2_MAKE_INFO(){
    //┬
    //〇フレームの内容をもとに認証CD・コマンドパスにセット
    F3_SET_ACD_CPATH();
    //┴
  } /* P2_MAKE_INFO() */

  //─────────────────
  // ３．認証を実施
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //----------------------------------
  // 戻り値：認証後の指針(論理値)
  // ・false： 処理継続が可能
  // ・true ： 処理継続が不可
  //─────────────────
  bool P3_AUTH(T_SS_SLOT& argSS){
    //┬
    //●認証処理を実施
    if (F4_CHECK_AUTH()){SEND_CONN(argSS); return true;}
    //│＼（処理継続が不可の場合）
    //│ ●エラーをレスポンス
    //│ ▼返却：処理継続が不可
    //│
    //▼返却：処理継続が可能
    return false;
  } /* P3_AUTH() */


//========================================================
// Ｅ．ルーティング処理（プロセス）
//--------------------------------------------------------
// HANDLE()で明示的に呼び出す
//========================================================
  //─────────────────
  // ルート１：ＭＭＰコマンド
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  void routeMMP(T_SS_SLOT& argSS){
    //┬
    //●１．フレームを取得
    if (P1_MAKE_FRAME(argSS)) return;
    //│＼（未完成の場合）
    //│ ▼終了：早期リターン
    //│
#if defined(MMP_TYPE_MAIN) // --┨ＭＭＰ本体┠----┐
    //○２．基本情報を取得
    P2_MAKE_INFO();
    //│
    //○３．ユーザ認証を実施
    if (P3_AUTH(argSS)) return;
    //│＼（処理継続が不可の場合）
    //│ ▼終了：早期リターン
#endif // ----------------------------------------┘
    //│
    //●MMPコマンドを実行
    F5_RUN();
    //│
    //●実行結果をレスポンス
    SEND_CONN(argSS);
    //┴
  } /* routeMMP() */

//========================================================
// Ｆ．コールバック・ルーティングの登録
//========================================================
// ➡【該当処理なし】

//========================================================
// Ｇ．公開機能
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //━━━━━━━━━━━━━━━━━
  void START() {
    //┬
    //○１．サービス資源を生成
    ADP_SRV = new WiFiServer(SRV_PORT) ; // WiFiServer
    //│
    //○２．接続管理TBLを作成
    ssTBL = new T_SS_SLOT[SS_SLOTS];
    //│
    //○３．接続管理スロットを静的アタッチ
    // ➡【該当処理なし】
    //│
    //○４．ルーティングを登録
    // ➡【該当処理なし】
    //│
    //○５．サービスを開始
    ADP_SRV->begin();
    //│
    //○７．起動ログを表示（正常終了）
    ENABLED = true; 
    //│
    //○７．起動ログを表示
    Serial.println(String("　[OK] TCP Raw   -> port ") + String(SRV_PORT));
    //┴
  } /* START() */

  //━━━━━━━━━━━━━━━━━
  // ハンドラ入口（ポーリング入口）
  //━━━━━━━━━━━━━━━━━
  void HANDLE(){
    //┬
    //○１．起動チェック
    if (!ENABLED) return; // 初期化済み
    if (!ADP_SRV) return; // サーバが起動済み
    //│＼（このアダプタが無効の場合）
    //│ ▼終了：早期リターン
    //│
    //○接続管理スロットを動的アタッチ
    bool Result = SS_ATTACH();
    //│
    //◎┐ルーティングを指示
    for (int ID = 0; ID < SS_SLOTS; ID++) {
      //│＼（最終スロットに達した場合）
      //│ ▽完了：ルーティングを終了
      //○┐スロットの有効性を確認
        //│
        //○使用状況を確認
        if (!ssTBL[ID].Base.used) continue;
        //│＼（未使用のスロットの場合）
        //│ ▽次へ：次のスロットを走査
        //│
        //○接続状況を確認
        if (!ssTBL[ID].conn.connected()) {
        //│＼（切断の場合）
            //○スロットを初期化する
            //▽次へ：次のスロットを走査
            SS_INI_SLOT(ssTBL[ID]);
            continue;
        } /* END-if */
        //┴
      //│
      //●対象スロットを宣言
      F0_SETUP(ROUTE_ID, ID);
      //│
      //●MMPコマンドへルーティング
      routeMMP(ssTBL[ID]);
      //┴
    } /* END-for */
    //┴
  } /* HANDLE() */

} /* namespace adpTCP */
