// filename : adpTcp.h
//========================================================
// 通信アダプタ：ＴＣＰブリッジ
//--------------------------------------------------------
// ・TCP Bridgeサーバの起動
// ・TCP Bridgeのポーリング処理
//   受信→認証開始→認証検証→コマンド実行→結果返却
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/11) α版 
//・ファイル名を変更
//・インクルードファイルを最適化
//・コメントを強化
//・namespaceを固有の1つにまとめた
//・各種リソース(処理/構造体など)を共通側に定義
//・g_SRV_TCPのセットを廃止
//・ルート１：ＭＭＰコマンド
//  - 引数をスロット(オブジェクト)に変更
//  - プロセスを見直し
//  - 接続管理を大幅変更
//  - フレームが完成したら後続処理するよう変更
//  - 受信データの容量超過に対応
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  //│
  //■ＭＭＰシステム
  #include "adp.h" // 通信アダプタ共通
  //┴
//┴

//━━━━━━━━━━━━━━━━━
// グローバル資源
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // コンテクスト
  //─────────────────
  extern MmpContext ctx;       // 所在：mmpCtx.h、実装：mmp.ino

  //─────────────────
  // コマンドパーサ
  //─────────────────
  extern String MMP_REQUEST(); // 所在：parser.h


//========================================================
// ネームスペース：ＴＣＰブリッジ通信アダプター
//========================================================
namespace adpTcp {
//━━━━━━━━━━━━━━━━━
// 基本情報
//━━━━━━━━━━━━━━━━━
  static constexpr int ROUTE_ID = ROUTE_ID_TCP; // 経路IDを定義
  WiFiServer*      ns_ACCEPTOR  = nullptr     ; // ユーザ受付資源を定義

//━━━━━━━━━━━━━━━━━
// ユーザ認証
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // テーブルを領域確保
  //─────────────────
  static TYPE_AUTH_SLOT AUTH_TBL[SS_SLOTS];


//━━━━━━━━━━━━━━━━━
// 接続管理
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // テーブルを宣言
  //─────────────────
  static SLOT_TCP* ssTBL = nullptr;

  //─────────────────
  // 接続管理TBLを作る
  //----------------------------------
  // 戻り値：なし
  //─────────────────
  void SS_CREATE_TBL(){
  //┬
  //○領域を確保
   ssTBL = new SLOT_TCP[SS_SLOTS]; // 標準量
  //│
  //◎┐TBL全体を初期化
  for (int id = 0; id < SS_SLOTS ; id++) INIT_SLOT_TCP(ssTBL[id]);
    //●このスロットを初期化
    //┴
  //┴
  } /* SS_CREATE_TBL() */

  //─────────────────
  // スロットを開放
  //----------------------------------
  // スロットを管理から外す
  //─────────────────
  // 戻り値：なし
  //─────────────────
  void SS_DETACH_SLOT(SLOT_TCP& argSlot){
    if (argSlot.conn) argSlot.conn .stop(); // 接続を切断
    INIT_SLOT_TCP(argSlot);
  } /* SS_DETACH_SLOT() */

  //─────────────────
  // スロットを開放(キー：認証コード)
  //----------------------------------
  // 認証コードと一致するスロットを管理から外す
  //─────────────────
  // 戻り値：なし
  //─────────────────
  void SS_DETACH_SLOT_ACD(const String& argCD){
  //┬
  //◎┐先頭から走査
  for (int id = 0 ; id < SS_SLOTS ; id++) {
    //○次データの捜査を開始
    // ＼（全スロットを走査し終えた場合）
      //▼ループ処理を中断
    //│
    //◇┐スロットを開放
    if ( ssTBL[id].authCD == argCD ) SS_DETACH_SLOT(ssTBL[id]);
      //├→（認証コードが一致する場合）
        //●この接続を管理から外す
        //┴
      //└┐
        //┴
  } /* END-for */
    //┴
  //┴
  } /* SS_DETACH_SLOT_ACD() */

  //─────────────────
  // 空きスロットを照会
  //----------------------------------
  // 該当条件：未使用
  //----------------------------------
  // 戻り値：
  // ・0,1,2...：空きスロットのID
  // ・-1：空きスロットが無い
  //─────────────────
  int SS_GET_FREE_ID() {
  //┬
  //◎┐先頭から走査
  for (int id = 0 ; id < SS_SLOTS ; id++) {
    //○次データの捜査を開始
    // ＼（全スロットを走査し終えた場合）
      //▼ループ処理を中断
    //│
    //○スロットを確認
    if ( !ssTBL[id].used ) return id;
    // ＼（未使用の場合）
      //▼当該スロットIDを返す
  } /* END-for */
    //┴
  //│
  //▼エラーコードを返す(空きスロットがない)
  return -1;
  //┴
  } /* SS_GET_FREE_ID() */

  //─────────────────
  // 古いスロットを照会
  //----------------------------------
  // 該当条件：使用中 かつ タイムアウト
  //----------------------------------
  // 戻り値：
  // ・0,1,2...：タイムアウトしたスロットID
  // ・-1：タイムアウトしたスロットが無い
  //─────────────────
  int SS_GET_OLD_ID() {
  //┬
  //◎┐先頭から走査
  for (int id = 0 ; id < SS_SLOTS ; id++) {
    //○次データの捜査を開始
    // ＼（全スロットを走査し終えた場合）
      //▼ループ処理を中断
    //│
    //○一致確認
    if ( ssTBL[id].used &&
         millis() - ssTBL[id].lastActive > SS_TIME_LIMIT) return id;
    // ＼（使用中でタイムアウトしている場合）
      //▼当該スロットIDを返す
    //┴
  } /* END-for */
  //│
  //▼エラーコードを返す(空きスロットがない)
  return -1;
  //┴
  } /* SS_GET_OLD_ID() */

  //─────────────────
  // 接続を登録
  //----------------------------------
  // 戻り値：なし
  //----------------------------------
  // 新たなTCP接続を接続管理下に置く
  // ポーリングで繰り返し実行される
  //─────────────────
  void SS_ATTACH_SLOT(){
  //┬
  //◎┐未管理のTCP接続をMMP管理対象へ登録する
  while (true) {
    //○新規のTCP接続を取得
    //  ※受付待ちキュー内のTCP接続情報を取得
    //  ※取得後、受付待ち状態から管理処理へ移行
    WiFiClient newConn = ns_ACCEPTOR->available();
    if (!newConn) break;
    // ＼（取得に失敗(待ち接続なし)の場合）
      //▼ループ処理を中断
    //│
    //●空きスロットを探す
    int id = SS_GET_FREE_ID();
    if (id < 0) {
    // ＼（空きスロットがない）
      //●古いスロットを探す
      id = SS_GET_OLD_ID();
      if (id < 0) {
      // ＼（古いスロットがない）
        //▼カレント処理をスキップ
        newConn.stop();
        continue;
      //│
      //●古いスロットを開放
      SS_DETACH_SLOT(ssTBL[id]);
      } /* END-if */
      //┴
    } /* END-if */
    //│
    //●スロットを初期化
    INIT_SLOT_TCP(ssTBL[id]);
    //│
    //○スロットに新規接続を登録
    ssTBL[id].used       = true     ; // 管理スロットを使用中へ変更
    ssTBL[id].conn       = newConn  ; // 新規のTCP接続を管理スロットへ登録
    ssTBL[id].conn .setNoDelay(true); // TCPパケット遅延制御を設定
    ssTBL[id].lastActive = millis() ; // 最終活動時刻を初期設定
    //┴
  } // while
  //┴
  } /* SS_ATTACH_SLOT() */

  //─────────────────
  // 4-2-2.接続認証を実施
  //----------------------------------
  // 戻り値：認証結果
  //・成功：false
  //・失敗：true
  //----------------------------------
  // 接続認証は失敗しない仕様とした。
  // 認証コードが不一致の場合でも、
  // 指定の認証コードを採用し救済した。
  // ※救済しない仕様へ変更する際、分岐処理で早期リターン(true)させる。
  //─────────────────
  bool SS_EXIST(
    SLOT_TCP& argSS  , // 接続管理スロット
    String    argACD   // フレームから取得した認証コード
  ){
  //┬
  //○認証コードを比較
  if (argSS.authCD != argACD) {
  // ＼（異なる場合）※再接続の条件
    //●古い(同じ認証コード)接続管理スロットを開放
    SS_DETACH_SLOT_ACD(argACD);
    //│
    //○認証コードを上書き
    argSS.authCD = argACD;
    //┴
  } /* END-if */
  //│
  //●最終更新時刻を更新
  argSS.lastActive = millis();
  //│
  //▼RETURN:合格
  return false;
  //┴
  } /* SS_EXIST() */

//━━━━━━━━━━━━━━━━━
// レスポンス
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // データ送信
  //─────────────────
  void SEND_CONN(
    SLOT_TCP&     argSS  , // 送信先
    const String& argMSG   // 送信メッセージ
  ){
  //┬
  //○メッセージをレスポンス
  argSS.conn.print(argMSG);
  //┴
  } /* SEND_CONN() */


//━━━━━━━━━━━━━━━━━
// ルーティング処理
//----------------------------------
// 実行元：mmp.ino - loop()
//----------------------------------
// ルーティング先は１つ(MMPコマンド)
// ロジックで明示的に呼び出す..handle()を参照
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // ルート０：ホスト直下
  //─────────────────
  //　➡【該当処理なし】

  //─────────────────
  // ルート１：ＭＭＰコマンド
  //----------------------------------
  // 引数：
  // (参)接続管理スロット
  //----------------------------------
  //【マルチ接続・継続型】
  //・TCP接続・１スロット(継続型)の構成
  //・通信状態は継続的に保持する
  //・再接続に対応する為、毎回ユーザー認証する
  //----------------------------------
  //【処理フロー】
  //・状態管理       ：conn.connected()
  //・フレーム分割   ：認証コードとコマンドパスに分割する
  //・ユーザ認証     ：する
  //・接続認証       ：する(再接続の救済措置あり)
  //----------------------------------
  //【処理詳細】
  // 資源            ：WiFiClient (実体)
  // 資源の実体所有  ：する
  // フレーム書式    ：{認証コード}/{コマンドパス}!
  // データ受信単位  ：1byte
  // フレーム化処理  ：する
  // 受信バッファ    ：する ※ポーリング跨ぎにも対応
  // 受信継続判定    ：available()
  // フレーム終端判定：する(データ受信単位で確認)
  //─────────────────
  void routeMMP(SLOT_TCP& argSS){
  //┬
  //○┐０．前処理
    //○┐0-1.処理継続可否を確認
      //○0-1-1.物理状態を確認
      if (!argSS.conn.connected()) return; // TCP接続状態
      // ＼（通信断の場合）
        //▼ルーティング処理を中断
      //│
      //○0-1-2.論理状態(接続管理スロット)を確認
      if (!argSS.used) return;
      // ＼（未使用スロットの場合）
        // ▼ルーティング処理を中断
      //┴
    //│
    //○0-2.準備完了フラグを用意
    bool isReady = false;
    //┴
  //│
  //◎┐１．受信待ちデータの取り込み
  while (argSS.conn.available()) {
    //○1-1.取り込みの継続を確認
    // ＼（受信待ちデータがない場合）
      //▼取り込みを終了
    //│
    //○1-2.受信データを受信バッファに加える
    char ch = (char)argSS.conn.read(); // ※バイト単位
    if (argSS.rx.length() < SS_RX_SIZE) {argSS.rx += ch;}
    else {
    // ＼（受信バッファが許容サイズを超過した場合）
      //○データ容量超過状態へ移行
      //○受信バッファの内容を破棄
      //▼ルーティング処理を中断
      //  ※残りの受信待ちデータは次回のルーティングで処理される
      argSS.isOverflow = true;
      argSS.rx         = "";
      return;
    } /*【1-2.受信データを受信バッファに加える】*/
    //│
    //◇┐1-3.フレームの完成を確認
    if (ch == '!') {
      //├→（コマンド終端を検出した場合）
        //○オーバーフローを確認
        if (argSS.isOverflow) {
        // ＼（オーバーフロー中の場合）
          //○データ容量超過状態を解除
          //○受信バッファをクリア
          //●エラーコードをレスポンス
          //▼ルーティング処理を中断
          argSS.isOverflow = false;
          argSS.rx         = ""   ;
          SEND_CONN(argSS, "#DFL!");
          return;
        } /*【1-3-1.オーバーフローを確認】*/
        //│
        //○準備完了フラグを[ON]
        //▼取り込みを終了
        isReady = true;
        break;
      //└┐
        //┴
    } /*【1-3.フレームの完成を確認】*/
    //┴
  } /*【１．受信待ちデータの取り込み】*/
  //│
  //○２．後続処理の継続を判断
  if (!isReady) return;
  // ＼（準備が未完了の場合）
    //▼ルーティング処理を中断
  //│
  //○┐３．事前準備
    //●3-1.受信バッファをURI形式に変換
    FormatURI(argSS.rx);
    //│
    //○┐3-2.事前データを用意
      //○3-2-1.認証コードを取得
      //○3-2-2.コマンドパスを取得
      String authCD  = GetToken1(argSS.rx);
      String cmdPath = GetToken2(argSS.rx);
      //┴
    //│
    //○3-3.受信バッファを破棄
    argSS.rx = "";
    //┴
  //│
  //○┐４．認証を実施
    //◇┐4-1.認証開始要求を処理
    if (authCD == "_START_!") {
      //├→（例外的に認証コードの中身が「接続開始コマンド」の文字列の場合）
        //●4-1-1.この接続を認証管理に加える
        String newAuthCD = AUTH_START(AUTH_TBL);
        if(newAuthCD == ""){
        // ＼（管理開始に失敗した場合）
          //●エラーコードをレスポンス
          //▼ルーティング処理を中断
          SEND_CONN(argSS, "#SS0!"); // 認証開始に失敗
          return;
        } /* END-if*/
        //│
        //○4-1-2.認証コードをスロットに反映
        //●4-1-3.認証コードをレスポンス
        //▼4-1-4.ルーティング処理を中断
        argSS.authCD = newAuthCD;
        SEND_CONN(argSS, newAuthCD); // 認証コード
        return;
      //└┐
        //┴
    } /*【4-1.認証開始要求を処理】*/
    //│
    //○┐4-2.認証の実施
      //●4-2-1.ユーザ認証を実施
      int authID = AUTH_GET_ID(AUTH_TBL, authCD);
      if (authID < 0) {
      // ＼（認証に失敗した場合）
        //●エラーコードをレスポンス
        //▼ルーティング処理を中断
        SEND_CONN(argSS, "#SS1!"); // セッションエラー(ユーザ認証)
        return;
      } /* 4-2-1.ユーザ認証を実施 */
      //│
      //●4-2-2.接続認証を実施
      if (SS_EXIST(argSS, authCD)) {
      // ＼（認証に失敗した場合）
        //●エラーコードをレスポンス
        //▼ルーティング処理を中断
        SEND_CONN(argSS, "#SS2!"); // セッションエラー(接続認証)
        return;
      } /* END-if */
      //┴
    //┴
  //│
  //○┐５．MMPコマンドを実行
    //●コマンド実行に必要な情報を確定
    ctx.accID   = GET_USER_ID(ROUTE_ID, authID); // ※認証情報から照会
    ctx.cmdPath = cmdPath    ; // フレームから取得した情報
    //│
    //●コマンドパーサーへ処理を移譲
    //●実行結果をレスポンス
    String mmpResp = MMP_REQUEST();
    SEND_CONN(argSS, mmpResp);
    //┴
  //┴
  } /* routeMMP() */


//========================================================
// ポーリング
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //----------------------------------
  // ロジックで明示的に呼び出す ※handle()参照
  //━━━━━━━━━━━━━━━━━
  bool start(uint16_t port){

    // 1) 二重起動防止
    if (ns_ACCEPTOR ) return true      ; // サーバの実体化有無を評価

    // 2) サーバ資源生成
    ns_ACCEPTOR = new WiFiServer(port) ; // ユーザ受付に資源をセット

    // 3) 接続管理TBLを作成
    SS_CREATE_TBL()                    ; // 領域確保
                                       ; // スロット初期化は handle() で実施

    // 4) ルーティング登録
    //　➡【該当処理なし】

    // 5) サーバ開始
    ns_ACCEPTOR->setNoDelay(true)      ; // TCPの遅延を抑制
    ns_ACCEPTOR->begin()               ; // サーバ起動

    // 6) 正常終了
    return true;
  } /* start() */

  //━━━━━━━━━━━━━━━━━
  // ハンドラ入口（ポーリング入口）
  //----------------------------------
  // 実行元：mmp.ino - loop()
  //━━━━━━━━━━━━━━━━━
  void handle(){

    // 1) 起動チェック
    if (!ns_ACCEPTOR ) return; // サーバの実体化有無を評価

    // 2) 新規接続のスロットを登録
    SS_ATTACH_SLOT();

    // 3) ルーティング処理
    for (int id = 0; id < SS_SLOTS; id++) routeMMP(ssTBL[id]);
  } /* handle() */

} /* namespace adpTcp */
