// filename : adpUART.cpp
//========================================================
// 通信アダプタ：ＵＡＲＴ
//（物理ポートを直接扱う通信）
//--------------------------------------------------------
//【目的】
// リクエストに従い、ＭＭＰコマンドを実行して、
// 結果をレスポンスする。
//--------------------------------------------------------
//【処理機能】
//・UARTポート毎に資源の参照をスロットに割り当てる。
//・ポーリング跨りでストリーム処理するためポート数だけスロットを消費する。
//--------------------------------------------------------
// Ver 1.2.0 (2026/08/25) 
// ・全体のロジックをシンプル化
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  //│
  //■ＭＭＰシステム
  #include "adp.h"  // 通信アダプタ共通へ公開
  //┴
//┴

//########################################################
//# 専用名の前空間
//########################################################
namespace adpUART {
//========================================================
// Ａ．基本情報
//========================================================
  //─────────────────
  // 固有データ
  //─────────────────
  const int  ROUTE_ID = ROUTE_ID_SERIAL; // UART
  const int  SS_SLOTS = 2              ; // 固定スロット(物理ポート毎に1個)
        bool ENABLED  = false          ; // 有効性：{有効：true|無効：false}

  //─────────────────
  // 使用するサービス
  //─────────────────
  // 標準のStream型のUARTを使用
  // ・Serial
  // ・Serial1

  //─────────────────
  // 接続スロット
  //─────────────────
  struct T_SS_SLOT{
    SS_SLOT_TYPE    Base              ; // 基本メンバ
    Stream*         conn  = nullptr   ; // アクセス資源(参照)
  };
  static T_SS_SLOT* ssTBL = nullptr   ; // 事前予約

//========================================================
// Ｂ．接続管理
//========================================================
  //─────────────────
  // 初期化
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  void SS_INI_SLOT(T_SS_SLOT& argSlot){}
  // ➡【該当処理なし】

  //─────────────────
  // 空きSID取得
  //----------------------------------
  // 戻り値：スロットID
  // ・0,1,2...：空きスロットのID
  // ・-1：空きスロットが無い
  //─────────────────
  int SS_GET_FREE_ID(){return -1;}
  // ➡【該当処理なし】

  //─────────────────
  // 動的アタッチ
  //----------------------------------
  // 戻り値 ：処理結果（論理値）
  // ・false：正常
  // ・true ：異常
  //─────────────────
  bool SS_ATTACH(){return true;}
  // ➡【該当処理なし】

//========================================================
// Ｃ．レスポンス
//========================================================
  //─────────────────
  // スロットの受付資源に送信
  //─────────────────
  void SEND_CONN(
    T_SS_SLOT&    argSS, // 送信先
    const String& argMSG // 送信メッセージ
  ){
    //┬
    //●ログ出力
    if (ctx.sysLog >= 0) F_SHOW_LOG(argMSG);
    //│
    //○メッセージをレスポンス
    argSS.conn->print(argMSG);
    //┴
  } /* SEND_CONN() */

//========================================================
// Ｄ．プロセス部品
//========================================================
  //─────────────────
  // １．フレームを取得
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //----------------------------------
  // 戻り値：フレーム作成状況（論理値）
  // ・true ：未完成
  // ・false：完成
  //─────────────────
  bool P1_MAKE_FRAME(T_SS_SLOT& argSS){
    bool res = F2_STREAM(*(argSS.conn), argSS.Base);
    if (ctx.errMSG != "") SEND_CONN(argSS, ctx.errMSG);
    return res;
  } /* P1_MAKE_FRAME */

  //─────────────────
  // ２．基本情報を取得
  //─────────────────
  void P2_MAKE_INFO(){
    //┬
    //〇フレームの内容をもとに認証CD・コマンドパスにセット
    F3_SET_ACD_CPATH();
    //┴
  } /* P2_MAKE_INFO() */

  //─────────────────
  // ３．認証を実施
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //----------------------------------
  // 戻り値：認証後の指針(論理値)
  // ・false： 処理継続が可能
  // ・true ： 処理継続が不可
  //─────────────────
  bool P3_AUTH(T_SS_SLOT& argSS){
    //┬
    //●認証処理を実施
    if (F4_CHECK_AUTH()){SEND_CONN(argSS, ctx.errMSG); return true;}
    //│＼（処理継続が不可の場合）
    //│ ●エラーをレスポンス
    //│ ▼返却：処理継続が不可
    //│
    //▼返却：処理継続が可能
    return false;
  } /* P3_AUTH() */

  //─────────────────
  // ４．MMPコマンドを実行
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  void P4_RUN_COMMAND(T_SS_SLOT& argSS){
    //┬
    //●MMPコマンドを実行
    String resMMP = F5_RUN();
    //│
    //●実行結果をレスポンス
    SEND_CONN(argSS, resMMP);
    //┴
  } /* P4_RUN_COMMAND() */

//========================================================
// Ｅ．ルーティング処理（プロセス）
//--------------------------------------------------------
// HANDLE()で明示的に呼び出す
//========================================================
  //─────────────────
  // ルート１：ＭＭＰコマンド
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  void routeMMP(T_SS_SLOT& argSS){
    //┬
    //●１．フレームを取得
    if (P1_MAKE_FRAME(argSS)) return;
    //│＼（未完成の場合）
    //│ ▼終了：早期リターン
    //│
#if defined(MMP_TYPE_MAIN) // --┨ＭＭＰ本体┠----┐
    //○２．基本情報を取得
    P2_MAKE_INFO();
    //│
    //○３．ユーザ認証を実施
    if (P3_AUTH(argSS)) return;
    //│＼（処理継続が不可の場合）
    //│ ▼終了：早期リターン
#endif // ----------------------------------------┘
    //│
    //●４．MMPコマンドを実行
    P4_RUN_COMMAND(argSS);
    //┴
  } /* routeMMP() */

  //========================================================
// Ｆ．コールバック・ルーティングの登録
//========================================================
// ➡【該当処理なし】

//========================================================
// Ｇ．公開機能
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //━━━━━━━━━━━━━━━━━
  void START() {
    //┬
    //○１．サービス資源を生成
    // ➡【該当処理なし】
    //│
    //●２．接続管理TBLを作成
    ssTBL = new T_SS_SLOT[SS_SLOTS];
    //│
    //○３．接続管理スロットを静的アタッチ
    ssTBL[0].Base.used = true     ; // 使用中
    ssTBL[0].conn      = &Serial  ; // 参照先を登録
    ssTBL[1].Base.used = true     ; // 使用中
    ssTBL[1].conn      = &Serial1 ; // 参照先を登録
    //│
    //○４．ルーティングを登録
    // ➡【該当処理なし】
    //│
    //○５．サービスを開始
    // ➡【該当処理なし】
    //│
    //○６．アダプタを有効化
    ENABLED = true; 
    //│
    //○７．起動ログ表示
    Serial.println(String("　[OK] USB/UART  -> #0,#1"));
    //┴
  } /* START() */

  //━━━━━━━━━━━━━━━━━
  // ハンドラ入口（ポーリング入口）
  //━━━━━━━━━━━━━━━━━
  void HANDLE(){
    //┬
    //○起動チェック
    if (!ENABLED) return; // 初期化済み
    //│＼（このアダプタが無効の場合）
    //│ ▼終了：早期リターン
    //│
    //◎┐ルーティングを指示
    for (int slotID = 0; slotID < SS_SLOTS; slotID++) {
      //│＼（最終スロットに達した場合）
      //│ ▽完了：ルーティングを終了
      //│
      //●対象スロットを宣言
      F0_SETUP(ROUTE_ID, slotID);
      //│
      //●MMPコマンドへルーティング
      routeMMP(ssTBL[slotID]);
      //┴
    } /* END-for */
    //┴
  } /* HANDLE() */

} /* namespace adpUART */