// filename : adpUART.cpp
//========================================================
// 通信アダプタ：ＵＡＲＴ
//（物理ポートを直接扱う通信）
//--------------------------------------------------------
//【目的】
// リクエストに従い、ＭＭＰコマンドを実行して、
// 結果をレスポンスする。
//--------------------------------------------------------
//【処理機能】
//・MMP用で扱う「全UART」を順次処理する
//・リクエストを取得する
//  - ストリームが空の時点で、次のポーリングに引き継ぐ
//  - 既定サイズ超過の時点で、次のポーリングに引き継ぐ
//  - １リクエストを取得した時点で、処理を進行する
//  - １リクエストを取得できない場合はMMPコマンドは実行されない
//・リクエストを基に共通情報(コンテクスト)を纏める
//・必要に応じてユーザ認証を実施する
//・MMPコマンドを実行する
//・MMPコマンドの実行結果をレスポンする
//・処理中にエラーなどがあれば適宜レスポンスする
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/23) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  //│
  //■ＭＭＰシステム
  #include "adp.h"  // 通信アダプタ共通へ公開
  //┴
//┴

//########################################################
//# 専用名の前空間
//########################################################
namespace adpUART {
//========================================================
// Ａ．基本情報
//========================================================
  //─────────────────
  // 公開情報
  //─────────────────
  const int  ROUTE_ID = ROUTE_ID_SERIAL; // UART
  const int  SS_SLOTS = 2              ; // 固定スロット(物理ポート毎に1個)
        bool ENABLED  = false          ; // 有効性：{有効：true|無効：false}

  //─────────────────
  // 使用するサービス
  //─────────────────
  // 標準のStream型のUARTを使用
  // ・Serial
  // ・Serial1

  //─────────────────
  // 接続スロット
  //─────────────────
  struct T_SS_SLOT{
    SS_SLOT_TYPE Base          ; // 基本メンバ
    Stream*      conn = nullptr; // アクセス資源(参照)
  };
  static T_SS_SLOT* ssTBL = nullptr; // 事前予約

//========================================================
// Ｂ．接続管理
//========================================================
  //─────────────────
  // 初期化
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  void SS_INI_SLOT(T_SS_SLOT& argSlot){}
  // ➡【該当処理なし】※固定スロット

  //─────────────────
  // 空きSID取得
  //----------------------------------
  // 戻り値：スロットID
  // ・0,1,2...：空きスロットのID
  // ・-1：空きスロットが無い
  //─────────────────
  int SS_GET_FREE_ID(){return -1;}
  // ➡【該当処理なし】※固定スロット

  //─────────────────
  // 登録
  //─────────────────
  void SS_ATTACH_SLOT(){
    //┬
    //○スロットに[USB-CDC]接続を登録
    ssTBL[0].Base.used = true     ; // 使用中
    ssTBL[0].conn      = &Serial  ; // 参照先を登録
    //│
    //○スロットに[UART1]接続を登録
    ssTBL[1].Base.used = true     ; // 使用中
    ssTBL[1].conn      = &Serial1 ; // 参照先を登録
    //┴
  } /* SS_ATTACH_SLOT() */

//========================================================
// Ｃ．レスポンス
//========================================================
  //─────────────────
  // スロットの受付資源に送信
  //─────────────────
  void SEND_CONN(
    T_SS_SLOT&    argSS, // 送信先
    const String& argMSG // 送信メッセージ
  ){
    //┬
    //●ログ出力
    if (ctx.sysLog >= 0) F_SHOW_LOG(argMSG);
    //│
    //○メッセージをレスポンス
    argSS.conn->print(argMSG);
    //┴
  } /* SEND_CONN() */

//========================================================
// Ｄ．プロセス部品
//--------------------------------------------------------
// HANDLE()で明示的に呼び出す
//========================================================
  //─────────────────
  // １．接続状態を確認
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //----------------------------------
  // 戻り値：接続状態（論理値）
  // ・false：良好
  // ・true ：不良
  //─────────────────
  bool P1_CONNECT(T_SS_SLOT& argSS){return false;}
  // ➡【該当処理なし】

  //─────────────────
  // ２．フレームを取得
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //----------------------------------
  // 戻り値：フレーム作成状況（論理値）
  // ・true ：未完成
  // ・false：完成
  //─────────────────
  bool P2_MAKE_FRAME(T_SS_SLOT& argSS){
    bool res = F2_STREAM(*(argSS.conn), argSS.Base);
    if (ctx.errMSG != "") SEND_CONN(argSS, ctx.errMSG);
    return res;
  } /* P2_MAKE_FRAME */

  //─────────────────
  // ３．基本情報を取得
  //─────────────────
  void P3_MAKE_INFO(){
    //┬
    //〇フレームの内容をもとに認証CD・コマンドパスにセット
    F3_SET_ACD_CPATH();
    //┴
  } /* P3_MAKE_INFO() */

  //─────────────────
  // ４．認証を実施
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //----------------------------------
  // 戻り値：認証後の指針(論理値)
  // ・false： 処理継続が可能
  // ・true ： 処理継続が不可
  //─────────────────
  bool P4_AUTH(T_SS_SLOT& argSS){
    //┬
    //●認証処理を実施
    if (F4_CHECK_AUTH()){SEND_CONN(argSS, ctx.errMSG); return true;}
    //│＼（処理継続が不可の場合）
    //│ ●エラーをレスポンス
    //│ ▼返却：処理継続が不可
    //│
    //▼返却：処理継続が可能
    return false;
  } /* P4_AUTH() */

  //─────────────────
  // ５．MMPコマンドを実行
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  void P5_RUN_COMMAND(T_SS_SLOT& argSS){
    //┬
    //●MMPコマンドを実行
    String resMMP = F5_RUN();
    //│
    //●実行結果をレスポンス
    SEND_CONN(argSS, resMMP);
    //┴
  } /* P5_RUN_COMMAND() */

//========================================================
// Ｅ．ルーティング処理（プロセス）
//--------------------------------------------------------
// HANDLE()で明示的に呼び出す
//========================================================
  //─────────────────
  // ルート１：ＭＭＰコマンド
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  void routeMMP(T_SS_SLOT& argSS){
    //┬
    //○１．接続状態を確認
    if (P1_CONNECT(argSS)) return;
    //│＼（不良の場合）
    //│ ▼終了：早期リターン
    //│
    //●２．フレームを取得
    if (P2_MAKE_FRAME(argSS)) return;
    //│＼（未完成の場合）
    //│ ▼終了：早期リターン
    //│
#if defined(MMP_TYPE_MAIN) // --┨ＭＭＰ本体┠----┐
    //○３．基本情報を取得
    P3_MAKE_INFO();
    //│
    //○４．ユーザ認証を実施
    if (P4_AUTH(argSS)) return;
    //│＼（処理継続が不可の場合）
    //│ ▼終了：早期リターン
#endif // ----------------------------------------┘
    //│
    //●５．MMPコマンドを実行
    P5_RUN_COMMAND(argSS);
    //┴
  } /* routeMMP() */

//========================================================
// Ｆ．初期化・ポーリング用ハンドル
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //━━━━━━━━━━━━━━━━━
  void START() {
    //┬
    //○１．前準備の完了状態を確認
    if (ssTBL) {
    //│＼（接続管理TBLが存在する場合）
        //○エラーメッセージを表示
        //○無効化
        //▼終了：早期リターン
        Serial.println("　　Serial   : UART通信の開始に失敗 ");
        ENABLED = false; // 無効
        return;
    } /* END-if */
    //│
    //○２．対象の通信経路を宣言
    ctx.routeID = ROUTE_ID; // コンテクストにルートIDをセット
    //│
    //○３．サーバ資源生成
    // ➡【該当処理なし】※セットアップ処理で事前に初期化済み
    //│
    //○４．接続管理TBLを作成
    ssTBL = new T_SS_SLOT[SS_SLOTS];
    SS_ATTACH_SLOT(); // ※固定スロットを事前登録
    //│
    //○５．ルーティング登録
    // ➡【該当処理なし】※HANDLE()で明示的にルーティング
    //│
    //○６．サーバ開始
    // ➡【該当処理なし】※ネットワーク系が対象
    //│
    //○┐７．成功終了
      //○成功メッセージ
      //○有効化
      Serial.println(String("　[OK] UART    -> #0,#1"));
      ENABLED = true; // 有効
      //┴
    //┴
  } /* START() */

  //━━━━━━━━━━━━━━━━━
  // ハンドラ入口（ポーリング入口）
  //━━━━━━━━━━━━━━━━━
  void HANDLE(){
    //┬
    //○１．起動チェック
    if (!ENABLED) return; // 初期化済み
    //│＼（このアダプタが無効の場合）
    //│ ▼終了：早期リターン
    //│
    //○２．新規接続のスロットを登録
    // ➡【該当処理なし】※固定スロット
    //│
    //◎┐３．ルーティング処理
    for (int slotID = 0; slotID < SS_SLOTS; slotID++) {
      //│＼（最終うスロットに達した場合）
      //│ ▼完了：ルーティングを終了
      //│
      //●対象スロットをセット
      F0_SETUP(ROUTE_ID, slotID);
      //│
      //●MMPコマンドへルーティング
      routeMMP(ssTBL[slotID]);
      //┴
    } /* END-for */
    //┴
  } /* HANDLE() */

} /* namespace adpUART */