// filename : adpWSOC.cpp
//========================================================
// 通信アダプタ：ＷｅｂＳｏｃｋｅｔ
//--------------------------------------------------------
//【目的】
// WebSocket通信を受け付け、
// MMPコマンドを実行して、結果をレスポンスする。
//--------------------------------------------------------
//【処理機能】
//・WebSocketサーバを起動する
//・WebSocketイベントを受信する
//・キュー内の「全リクエスト」を順次処理する
//・リクエストを取得する
//  - コールバック時にキューへ格納
//  - ポーリング時にキューからリクエストを取得
//  - キューがない場合は何も行われない
//・リクエストを基に共通情報(コンテクスト)を纏める
//・必要に応じてユーザ認証を実施する
//・MMPコマンドを実行する
//・MMPコマンドの実行結果をレスポンする
//・処理中にエラーなどがあれば適宜レスポンスする
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/23) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <WebSocketsServer.h>
  #include <Arduino.h>
  #include <queue>
  #include <mutex>
  //│
  //■ＭＭＰシステム
  #include "adp.h"
  //┴
//┴

//########################################################
//# 専用名前空間
//########################################################
namespace adpWSOC {
//========================================================
// Ａ．基本情報
//========================================================
  //─────────────────
  // 公開情報
  //─────────────────
  const int  ROUTE_ID = ROUTE_ID_WSOC; // ルートID
  const int  SS_SLOTS = 1            ; // 固定スロット(1個を使いまわし)
        bool ENABLED  = false        ; // 有効性：{有効：true|無効：false}

  //─────────────────
  // 使用するサービス
  //─────────────────
  static WebSocketsServer* ADP_SRV = nullptr; // WebSocketサーバ
  static int               SRV_PORT = 8083  ; // ポート番号

  //─────────────────
  // 接続スロット
  //─────────────────
  struct T_SS_SLOT{
    SS_SLOT_TYPE Base        ; // 基本メンバ
    uint8_t      connNum = 0 ; // 接続中のWebSocketクライアント番号
    String       connRX  = ""; // 受信バッファ
  };
  static T_SS_SLOT* ssTBL = nullptr;

  //─────────────────
  // キューイング
  //─────────────────
  struct myQueue {
    uint8_t connNum; // クライアント番号
    String  connRX ; // 受信バッファ
  };
  static std::queue<myQueue> QUEUE      ; // キューバッファ
  static std::mutex          QUEUE_MUTEX; // 別スレッドとの衝突回避用のロック

//========================================================
// Ｂ．接続管理
//========================================================
  //─────────────────
  // 初期化
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  void SS_INI_SLOT(T_SS_SLOT& argSlot){
    SS_INI_SLOT_BASE(argSlot.Base);
    argSlot.connNum = 0 ; // クライアント番号
    argSlot.connRX  = ""; // 受信バッファ
  } /* SS_INI_SLOT() */

  //─────────────────
  // 空きSID取得
  //----------------------------------
  // 戻り値：スロットID（数値）
  // ・-1   ：空き無し
  // ・0以上：空きスロットID
  //─────────────────
  int SS_GET_FREE_ID() {
    //┬
    //◎┐先頭から走査
    for (int ID = 0; ID < SS_SLOTS; ID++) {
    //│＼（全スロットを走査し終えた場合）
    //│ ▽中断：ループ処理を中断
    //│
    //○スロットを確認
    if (!ssTBL[ID].Base.used) return ID;
    //│＼（未使用の場合）
    //│ ▼返却：当該スロットIDを返す
    } /* END-for */
    //│
    //▼返却：エラーコード(空きスロットがない)
    return -1;
  } /* SS_GET_FREE_ID() */

  //─────────────────
  // 登録（自動1スロット）
  //----------------------------------
  // 戻り値：スロットID（数値）
  // ・-1   ：失敗
  // ・0以上：成功
  //─────────────────
  int SS_ATTACH_EACH(){
    //┬
    //◎┐未管理のTCP接続をMMP管理対象へ登録する
    while (true) {
      //●空きスロットを探す
      int ID = SS_GET_FREE_ID();
      if (ID < 0) return -1;
      //│＼（空きスロットがない）
      //│ ▽次へ：次を探す
      //│
      //●スロットを初期化
      SS_INI_SLOT(ssTBL[ID]);
      //│
      //○スロットに新規接続を登録
      ssTBL[ID].Base.used = true; // 使用中
      //│
      //▼返却：スロットID
      return ID;
    } //* END-while */
    //┴
  } /* SS_ATTACH_EACH() */

  //─────────────────
  // 登録（自動一括スロット）
  //----------------------------------
  // 戻り値 ：スロットID（数値）
  // ・false：成功
  // ・true ：失敗
  //─────────────────
  bool SS_ATTACH_FOREACH(){return true;}
  // ➡【該当処理なし】

  //─────────────────
  // 登録（固定スロット）
  //─────────────────
  void SS_ATTACH_STATIC(){}
  // ➡【該当処理なし】

//========================================================
// Ｃ．レスポンス
//========================================================
  //─────────────────
  // WebSocketへ送信
  //----------------------------------
  // 引数：(参)接続管理スロット
  //─────────────────
  void SEND_CONN(
    T_SS_SLOT&    argSS,
    const String& argMSG
  ){
    //┬
    //●ログ出力
    if (ctx.sysLog >= 0) F_SHOW_LOG(argMSG);
    //│
    //○メッセージをレスポンス
    if (ADP_SRV) ADP_SRV->sendTXT(argSS.connNum, argMSG);
    //┴
  } /* SEND_CONN() */

//========================================================
// Ｄ．プロセス部品
//========================================================
  //─────────────────
  // １．接続状態を確認
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  bool P1_CONNECT(T_SS_SLOT& argSS){
    //┬
    //○接続状態を確認
    if (!argSS.Base.used) {SS_INI_SLOT(argSS); return true;}
    //│＼（[未使用]の場合）
    //│ ●スロットを初期化
    //│ ▼返却：不良
    //│
    //▼返却：接続状態良好
    return false;
    //┴
  } /* P1_CONNECT() */

  //─────────────────
  // ２．フレームを作成
  //----------------------------------
  // 戻り値：フレーム作成状況（論理値）
  // ・true ：未完成
  // ・false：完成
  //----------------------------------
  //【データ受信方式】
  // ・取得単位  ：パケット
  // ・データ受信：サーバ(参照) pCharacteristic->getValue()
  //─────────────────
  bool P2_MAKE_FRAME(T_SS_SLOT& argSS){
    //┬
    //○受信データからフレームを作成
    ctx.strFrame = argSS.connRX;
    //│
    //●フレームをURI形式に変換
    F2_FORMAT_URI(ctx.strFrame);
    //│
    //▼返却：フレームの作成状況
    return (ctx.strFrame == "" ? true : false);
  } /* P2_MAKE_FRAME() */

  //─────────────────
  // ３．基本情報を取得
  //─────────────────
  void P3_MAKE_INFO(){
    //┬
    //〇フレームの内容をもとに認証CD・コマンドパスにセット
    F3_SET_ACD_CPATH();
    //┴
  } /* P3_MAKE_INFO() */

  //─────────────────
  // ４．認証を実施
  //----------------------------------
  // 戻り値：認証結果（論理値）
  // ・false： 処理継続が可能
  // ・true ： 処理継続が不可
  //─────────────────
  bool P4_AUTH(T_SS_SLOT& argSS){
    //┬
    //●認証処理を実施
    if (F4_CHECK_AUTH()){SEND_CONN(argSS, ctx.errMSG); return true;}
    //│＼（処理継続が不可の場合）
    //│ ●エラーをレスポンス
    //│ ▼返却：処理継続が不可
    //│
    //▼返却：処理継続が可能
    return false;
  } /* P4_AUTH() */

  //─────────────────
  // ５．MMPコマンドを実行
  //─────────────────
  void P5_RUN_COMMAND(T_SS_SLOT& argSS){
    //┬
    //●MMPコマンドを実行
    String resMMP = F5_RUN();
    //│
    //●実行結果をレスポンス
    SEND_CONN(argSS, resMMP);
    //┴
  } /* P5_RUN_COMMAND() */

//========================================================
// Ｅ．ルーティング処理
//========================================================
  //─────────────────
  // １．MMPコマンド
  //─────────────────
  void routeMMP(T_SS_SLOT& argSS){
    //┬
    //○１．接続状態を確認
    if (P1_CONNECT(argSS)) return;
    //│＼（不良の場合）
    //│ ▼終了：早期リターン
    //│
    //●２．フレームを取得
    if (P2_MAKE_FRAME(argSS)) return;
    //│＼（未完成の場合）
    //│ ▼終了：早期リターン
    //│
#if defined(MMP_TYPE_MAIN) // --┨ＭＭＰ本体┠----┐
    //○３．基本情報を取得
    P3_MAKE_INFO();
    //│
    //○４．ユーザ認証を実施
    if (P4_AUTH(argSS)) return;
    //│＼（処理継続が不可の場合）
    //│ ▼終了：早期リターン
#endif // ----------------------------------------┘
    //│
    //●５．MMPコマンドを実行
    P5_RUN_COMMAND(argSS);
    //┴
  } /* routeMMP() */


//========================================================
// Ｆ．初期化・ポーリング用ハンドル
//========================================================
  //─────────────────
  // ヘルパー：クライアント番号をキーにスロットIDを調べる
  //─────────────────
  int SEARCH_SID(int argKey) {
    //◎┐このスロットを初期化
    for (int ID = 0; ID < SS_SLOTS; ID++){
      //│＼（最終スロットに達した場合）
      //│ ▽完了：走査を終える
      //│
      //◇┐クライアント番号が一致するスロットを初期化
      if (ssTBL[ID].Base.used && ssTBL[ID].connNum == argKey) return ID;
        //├┐（スロットが未使用の場合)
        //│▼返却：スロットID
        //└┐
          //┴
      //┴
    } /* END-for */
    //│
    //▼終了：早期リターン
    return -1;
  } /* SEARCH_SID() */

  //━━━━━━━━━━━━━━━━━
  // WebSocketイベントコールバック
  //━━━━━━━━━━━━━━━━━
  void webSocketEvent(
    uint8_t   num,
    WStype_t  type,
    uint8_t * payload,
    size_t    length
  ){
    //┬
    //◇┐イベント駆動
    switch(type) {
      //------------------------------------------------------------------
      case WStype_CONNECTED:
      //------------------------------------------------------------------
      {
      //├┐（接続した場合）
        //●スロットを割り当て
        int newID = SS_ATTACH_EACH();
        if (newID < 0){ADP_SRV->sendTXT(num, "#SSZ!"); return;}
        //│＼（失敗した場合）
        //│ ●エラーをレスポンス
        //│ ▼終了：早期リターン
        //│
        //○クライアント番号を付与
        //▼終了：早期リターン
        ssTBL[newID].connNum = num;
        return;
      }

      //------------------------------------------------------------------
      case WStype_DISCONNECTED:
      //------------------------------------------------------------------
      {
      //├┐（切断した場合）
        //●スロットを割り当て
        int oldID = SEARCH_SID(num);
        if (oldID < 0) return;
        //│＼（失敗した場合）
        //│ ▼終了：早期リターン
        //│
        //●スロットを割り当て
        //▼終了：早期リターン
        SS_INI_SLOT(ssTBL[oldID]);
        return;
      }

      //------------------------------------------------------------------
      case WStype_TEXT:
      //------------------------------------------------------------------
      {
      //├┐（テキスト受信した場合）
        //○未取り込みデータを受信
        if (payload == nullptr || length < 1) return;
        //│＼（空の場合）
        //│ ▼終了：早期リターン
        //│
        //○受信データをキューに追加
        std::lock_guard<std::mutex> lock(QUEUE_MUTEX);
        QUEUE.push({num, String((char*)payload)});
        //▼終了：早期リターン
        return;
      }
      //------------------------------------------------------------------
      //└┐
        //┴
      //┴
    } /* END-switch */
    //┴
  } /* webSocketEvent() */

  //─────────────────
  // キューを1つ抽出
  //----------------------------------
  // 引数：
  // ・キュー受取用の変数
  //----------------------------------
  // 戻り値：キューの有無（論理値）
  // ・true ：あり
  // ・false：なし
  //─────────────────
  bool popQueue(myQueue &argData) {
    //┬
    //○別スレッドとの衝突回避用のロック
    std::lock_guard<std::mutex> lock(QUEUE_MUTEX);
    //│
    //○キューの容量を確認
    if (QUEUE.empty()) return false;
    //│＼（通信デバイスが起動していない場合）
    //│ ▼返却：なし
    //│
    //○先頭を抽出
    argData = QUEUE.front();
    //│
    //○先頭を削除
    QUEUE.pop();
    //│
    //▼返却：あり
     return true;
  } /* popQueue() */

  //─────────────────
  // 初期化処理
  //─────────────────
  void START() {
    //┬
    //○１．対象の通信経路を宣言
    ctx.routeID = ROUTE_ID;
    //│＼（通信デバイスが起動していない場合）
        //○エラーメッセージを表示
        //○無効化
        //▼終了：早期リターン
    //│
    //○２．対象の通信経路を宣言
    ctx.routeID = ROUTE_ID; // コンテクストにルートIDをセット
    //│
    //○３．サーバ資源生成
    ADP_SRV = new WebSocketsServer(SRV_PORT);
    //│
    //○４．接続管理TBLを作成
    ssTBL = new T_SS_SLOT[SS_SLOTS];
    //│
    //○５．ルーティング登録
    ADP_SRV->onEvent(webSocketEvent);
    //│
    //○６．サーバ開始
    ADP_SRV->begin();
    //│
    //○┐７．成功終了
      //○成功メッセージ
      //○有効化
      Serial.println(String("　[OK] WebSocket -> port ") + String(SRV_PORT));
      ENABLED = true;
    //┴
  } /* START() */

  //─────────────────
  // ハンドラ入口（ポーリング入口）
  //─────────────────
  void HANDLE(){
    //┬
    //○１．起動チェック
    if (!ENABLED) return; // 初期化済み
    //│＼（このアダプタが無効の場合）
    //│ ▼終了：早期リターン
    //│
    //○２．新規接続のスロットを登録
    // ➡【該当処理なし】※固定スロット

    //○２．WebSocketサーバの処理を進める
    ADP_SRV->loop();
    //│
    //◎┐３．ルーティング処理
    myQueue popDat;
    while (popQueue(popDat)) {
      //│＼（キューがある場合）
      //│ ▼BREAK：ルーティングを終了
      //│
      //●クライアント番号に該当するスロットIDを探す
      int intSID = SEARCH_SID(popDat.connNum);
      if (intSID < 0) continue;
      //│＼（失敗した場合）
      //│ ▼次へ：次のキューを走査
      //│
      //●対象スロットをセット
      F0_SETUP(ROUTE_ID, intSID);
      //│
      //○キューデータをスロット反映
      ssTBL[intSID].connNum = popDat.connNum; // クライアント番号
      ssTBL[intSID].connRX  = popDat.connRX ; // 受信バッファ
      //│
      //●MMPコマンドへルーティング
      routeMMP(ssTBL[intSID]);
      //┴
    } /* END-while */
    //┴
  } /* HANDLE() */

} /* namespace adpWSOC */