// filename : cmd.h
//========================================================
// コマンド・マネージャ：経路アダプタと機能モジュールを連携する
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#ifndef CMD_H // コンパイラ不具合対策
#define CMD_H // adapter/mode/member/main.cpp での指定が認識できない
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Arduino.h>
  //┴
//┴

//━━━━━━━━━━━━━━━━━
// グローバル資源
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // コンテクスト
  // ※_API_.h より前に宣言が必要
  //─────────────────
  extern MmpContext ctx;

//========================================================
// コマンド・マネージャ
//========================================================
namespace CommandManager {

  //─────────────────
  // クライアントからのリクエスト条件
  //─────────────────
  #define REQUEST_LENGTH 96 // リクエスト全体のバッファ長
  #define DAT_COUNT      10 // コマンド＋引数の個数
  #define DAT_LENGTH     20 // トークン最大長（未定義時のフォールバック）

  //─────────────────
  // 機能モジュール構造体
  //─────────────────
  struct T_MOD {
      const char* name; // 名前
      const char* desc; // 説明
  };

  //─────────────────
  // 公開関数宣言
  //─────────────────
  void CLEAN();
  void INIT();
  void SHOW_DESC(String argName);
  void RunCommand();

}; /* namespace CommandManager */
#endif // CMD_H