// filename : Command.h
//========================================================
// コマンド実行部門
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#ifndef CMD_H
#define CMD_H
#pragma once
//┬
//□┐インクルード
  //□Arduinoシステム
  #include <Arduino.h>
//┴┴
//┬
//□┐情報
  //□環境設定
  #include "mmpConfig.h"
  //│
  //□コンテクスト
  #include "mmpContext.h"
  extern MmpContext ctx;
//┴┴

//========================================================
// 役割
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 統括マネージャ
  //━━━━━━━━━━━━━━━━━
  #include "command/manager.cpp"
  namespace CommandManager {
    void INIT()      ; // 初期化
    void RunCommand(); // コマンド実行
  }

#endif // CMD_H