// filename : conf.h
//========================================================
// 各種設定
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/03) 
//========================================================

//─────────────────
// ターゲット・ボード(UART設定で必要)
//─────────────────
#define BOARD_ESP32_S3_TINY
//#define BOARD_M5STAMP_S3
//#define BOARD_PICO2W

//─────────────────
// MMPタイプ
//----------------------------------
//・MMP本体：コメントアウト「しない」
//・MMPサブ：コメントアウト「す る」
//─────────────────
#define MMP_TYPE_MAIN

//─────────────────
// 通信アダプタ選択
//----------------------------------
//・必要：コメントアウト「しない」
//・不要：コメントアウト「する」
//─────────────────
#define ADP_COM_UART // UART  ※本体＋サブの構成で必須
#define ADP_COM_TCP  // TcpRaw
#define ADP_COM_WAPI // WebAPI
#define ADP_COM_WSOC // WebSocket
#define ADP_COM_ESPN // ESP-NOW
#define ADP_COM_BLE  // BLE
//#define ADP_COM_I2C  // i2c ※他IICデバイスが使えなくなる(本体で使用禁止)