// filename : conf.h
//========================================================
// 各種設定
//--------------------------------------------------------
// 2026/08/21 : 新設
//========================================================

//─────────────────
// MMPタイプ
//----------------------------------
//・MMP本体：コメントアウト「しない」
//・MMPサブ：コメントアウト「す る」
//─────────────────
#define MMP_TYPE_MAIN

//─────────────────
// 通信アダプタ選択
//----------------------------------
//・必要：コメントアウト「しない」
//・不要：コメントアウト「する」
//─────────────────
#define ADP_COM_UART // Serial
#define ADP_COM_TCP    // TCPブリッジ
#define ADP_COM_HTTP   // WEB-API
#define ADP_COM_BLE    // BLE

//─────────────────
// WEBアダプタ選択
//----------------------------------
//・必要：コメントアウト「しない」
//・不要：コメントアウト「する」
//─────────────────
//#define ADP_WEB  // WEB画面