// filename : conf.h
//========================================================
// 各種設定
//--------------------------------------------------------
// Ver 1.2.0 (2026/08/25) 
// ・I2Cのプリプロセッサエントリーを追加
//========================================================

//─────────────────
// MMPタイプ
//----------------------------------
//・MMP本体：コメントアウト「しない」
//・MMPサブ：コメントアウト「す る」
//─────────────────
#define MMP_TYPE_MAIN

//─────────────────
// 通信アダプタ選択
//----------------------------------
//・必要：コメントアウト「しない」
//・不要：コメントアウト「する」
//─────────────────
#define ADP_COM_UART // UART
#define ADP_COM_TCP  // TcpRaw
#define ADP_COM_WAPI // WebAPI
#define ADP_COM_WSOC // WebSocket
//#define ADP_COM_ESPN // ESP-NOW
//#define ADP_COM_BLE  // BLE
//#define ADP_COM_I2C  // i2c

//─────────────────
// WEBアダプタ選択
//----------------------------------
//・必要：コメントアウト「しない」
//・不要：コメントアウト「する」
//─────────────────
//#define ADP_WEB  // WEB画面