// filename : conf.h
//========================================================
// 各種設定
//--------------------------------------------------------
// Ver 1.2.0 (2026/08/25) 
//========================================================

//─────────────────
// MMPタイプ
//----------------------------------
//・MMP本体：コメントアウト「しない」
//・MMPサブ：コメントアウト「す る」
//─────────────────
#define MMP_TYPE_MAIN

//─────────────────
// 通信アダプタ選択
//----------------------------------
//・必要：コメントアウト「しない」
//・不要：コメントアウト「する」
//─────────────────
#define ADP_COM_UART // UART  ※メイン・サブの構成では必須
#define ADP_COM_TCP  // TcpRaw
#define ADP_COM_WAPI // WebAPI
#define ADP_COM_WSOC // WebSocket
#define ADP_COM_ESPN // ESP-NOW
#define ADP_COM_BLE  // BLE
//#define ADP_COM_I2C  // i2c ※他IICデバイスが使えなくなる(本体で使用禁止)