// filename : conf.h
//========================================================
// 各種設定
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/23) 
//========================================================

//─────────────────
// MMPタイプ
//----------------------------------
//・MMP本体：コメントアウト「しない」
//・MMPサブ：コメントアウト「す る」
//─────────────────
#define MMP_TYPE_MAIN

//─────────────────
// 通信アダプタ選択
//----------------------------------
//・必要：コメントアウト「しない」
//・不要：コメントアウト「する」
//─────────────────
#define ADP_COM_UART // UART通信
#define ADP_COM_TCP  // TcpRaw通信
#define ADP_COM_WAPI // WebAPI通信
#define ADP_COM_WSOC // WebSoc通信
#define ADP_COM_BLE  // BLE

//─────────────────
// WEBアダプタ選択
//----------------------------------
//・必要：コメントアウト「しない」
//・不要：コメントアウト「する」
//─────────────────
//#define ADP_WEB  // WEB画面