// filename : mmpCtx.h
//========================================================
// ＭＭＰコンテクスト
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/23) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Arduino.h>
  //│
  //■ＭＭＰシステム
  //┴
//┴

//========================================================
// コンテクスト
//========================================================
struct MmpContext {
  //┬
  //■システム情報
#if defined(MMP_TYPE_MAIN) // --┨ＭＭＰ本体┠----┐
  const String sysName = "MMP本体";
#else // -----------------------┨ＭＭＰサブ┠----┤
  const String sysName = "MMPサブ";
#endif // ----------------------------------------┘
  //■システム
  const String sysVer  = "V12a!"; // バージョン
  boolean      sysLog  = true  ; // ログレベル {false:なし | true:あり}
  //│
  //■レスポンス
  String       resMSG  = "" ; // レスポンスメッセージ
  //│
  //■リクエスト情報---
  String       adpID    = ""; // アダプタID
  String       strFrame = ""; // フレーム
  String       cmdPath  = ""; // コマンドパス
  String       authCD   = ""; // 認証コード
  //│
  //■ユーザメモリ管理のアドレス情報
  int          accID    = -1; // アクセスID(MMP全体の一意な番号)
  const int    accIDS   = 30; // アクセスIDの総数(ユーザ認証スロット数)
  //┴
};