// filename : context.h
//========================================================
// ＭＭＰコンテクスト
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/23) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Arduino.h>
  //│
  //■ＭＭＰシステム
  #include "conf.h"    // プリプロセッサ
  //┴
//┴

//========================================================
// コンテクスト
//========================================================
struct MmpContext {
  //┬
  //■システム
  const String sysVer  = "V12a!"  ; // バージョン
  int          sysMode = MODE_MAIN; // 動作モード
  bool         sysLog  = true     ; // ログ表示
  //│
  //■レスポンス
  String       resMSG  = "" ; // レスポンスメッセージ
  //│
  //■リクエスト情報---
  String       adpID    = ""; // アダプタID
  String       strFrame = ""; // フレーム
  String       cmdPath  = ""; // コマンドパス
  String       authCD   = ""; // 認証コード
  //│
  //■ユーザメモリ管理のアドレス情報
  int          accID    = -1; // アクセスID(MMP全体の一意な番号)
  const int    accIDS   = 30; // アクセスIDの総数(ユーザ認証スロット数)
  //┴
};