// filename : Dep_Connect.h
//========================================================
// 接続部門
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#ifndef CONN_BASE_H
#define CONN_BASE_H
#pragma once
//┬
//□┐インクルード
  //□Arduinoシステム
  #include <Arduino.h>
//┴┴

//========================================================
// 必要な資源
//========================================================
//┬
//□┐情報
  //□環境設定
  #include "mmpConfig.h"
  //│
  //□コンテクスト
  #include "mmpContext.h"
  extern MmpContext ctx;
//┴┴

//========================================================
// 統括マネージャの役務
//========================================================
  #include "Dep_Connect/manager.cpp"
  namespace DepConnect{
    void INIT(); // 部下招集
    void WORK(); // 業務遂行（接続応答）
  }

#endif // CONN_BASE_H