// filename : Dep_Command.h
//========================================================
// コマンド部門
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#ifndef CMD_BASE_H
#define CMD_BASE_H
#pragma once
//┬
//□┐インクルード
  //□Arduinoシステム
  #include <Arduino.h>
//┴┴

//========================================================
// 必要な資源
//========================================================
//┬
//□┐情報
  //□環境設定
  #include "mmpConfig.h"
  //│
  //□コンテクスト
  #include "mmpContext.h"
  extern MmpContext ctx;
//┴┴

//========================================================
// 役務
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 統括マネージャ
  //━━━━━━━━━━━━━━━━━
  #include "Dep_Command/manager.cpp"
  namespace DepCommand {
    void INIT()      ; // 部下招集
    void RunCommand(); // 業務遂行（コマンド実行）
  }

#endif // CMD_BASE_H