// filename : dev.h
//========================================================
// 通信デバイス初期化
//--------------------------------------------------------
// MMPシステムの初期化処理を公開する
//・シリアル通信の初期化
//・ネットワーク通信の初期化
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/15) α版
//・新規
//========================================================
#pragma once//┬
//■┐インクルード
  //■Arduinoシステム
  //│
  //■ＭＭＰシステム
//┴

//━━━━━━━━━━━━━━━━━
// デバイスの公開情報
//━━━━━━━━━━━━━━━━━
  //【シリアル】
  namespace devSerial{
    extern bool ENABLED ; // 有効性
    void start()        ; // デバイス開始の指示
  }

  //【ネットワーク】
  namespace devNetwork{
    extern bool ENABLED ; // 有効性
    void start()        ; // デバイス開始の指示
  }

//━━━━━━━━━━━━━━━━━
// 通信デバイスを初期化
//━━━━━━━━━━━━━━━━━
  void InitDevice();