// filename : dev.cpp
//========================================================
// 通信デバイス初期化
//--------------------------------------------------------
// MMPシステムの通信デバイスを初期化処理する
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/15) α版
//・新規
//========================================================
//┬
//■┐インクルード
  //■Arduinoシステム
  //│
  //■ＭＭＰシステム
  #include "dev.h"
//┴

//========================================================
// 通信デバイスを初期化
//========================================================
void InitDevice() {

  // 開始表示
  // ➡【初期化順序制約】
  //    ログ出力機能が未起動のため、
  //    Serial初期化完了後にdevSerial::start()内で通知する

  // 通信デバイス
  devSerial ::start();
  devNetwork::start();
  //│
  //○終了表示
  // ➡【初期化順序制約】
  //    ログ出力機能が未起動のため、
  //    Serial初期化完了後にdevNetwork::start()内で通知する
  Serial.println("");
  //┴
} /* InitDevice() */