// filename : dev.cpp
//========================================================
// 通信デバイス初期化
//--------------------------------------------------------
//【目的】
// 通信デバイスを起動させる
//--------------------------------------------------------
//【公開資源】
//・INIT_DEVICE()：通信デバイスを起動させる
//--------------------------------------------------------
//【処理機能】
//・各通信デバイスの初期化を指示する
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/23) 
//========================================================
//┬
//■┐インクルード
  //■Arduinoシステム
  //│
  //■ＭＭＰシステム
  #include "conf.h"   // 各種設定
  #include "dev.h"
//┴

//########################################################
//# 専用の名前空間
//########################################################
void INIT_DEVICE() {
  //┬
  //○開始表示
  // ➡【初期化順序制約】
  //    ログ出力機能が未起動のため、
  //    Serial初期化完了後にdevUART::START()内で通知する
  //│
  //●通信デバイスを初期化（UART）
  devUART ::START();
  //│
// -----┨ＴＣＰ通信｜WebAPI通信｜ＷＥＢ画面┠----┐
#if defined(ADP_COM_TCP) || defined(ADP_COM_HTTP) || defined(ADP_WEB)
  //●通信デバイスを初期化（WiFi）
  devNetwork::START();
#endif // ----------------------------------------┘
  //│
#if defined(ADP_COM_BLE  ) // --┨ＢＬＥ通信┨----┐
  //●通信デバイスを初期化（BLE）
  devBLE    ::START();
#endif // ----------------------------------------┘
  //│
  //○終了表示
  // ➡【初期化順序制約】
  //    ログ出力機能が未起動のため、
  //    Serial初期化完了後にdevNetwork::start()内で通知する
  //┴
} /* INIT_DEVICE() */