// filename : Device.h
//========================================================
// 通信デバイス部門
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#ifndef DEV_H
#define DEV_H
#pragma once
//┬
//□┐インクルード
  //□Arduinoシステム
  #include <Arduino.h>
//┴┴
//┬
//□┐情報
  //□環境設定
  #include "mmpConfig.h"
//┴┴

//========================================================
// 役割
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 統括マネージャ
  //━━━━━━━━━━━━━━━━━
  #include "device/manager.cpp"
  namespace DeviceManager{
    void INIT(); // 初期化
  }

#endif // DEV_H