// filename : ini.h
//========================================================
// 初期化処理
//--------------------------------------------------------
// MMPシステムの初期化処理を公開する
//・シリアル通信の初期化
//・ネットワーク通信の初期化
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/15) α版
//・新規
//========================================================
#pragma once
#include "mmpCtx.h"

//━━━━━━━━━━━━━━━━━
// 初期化処理
//━━━━━━━━━━━━━━━━━
namespace iniSerial { void start(); }
namespace iniNet    { void start(); }