// filename : mmp.ino
//========================================================
//  MMP Firmware
//--------------------------------------------------------
// ボード情報：Waveshare ESP32-S3-tiny用
//  - ESP32S3 Dev Module
//  - USB CDC ON Boot: Enabled
//  - Flash Size: 4MB (32Mb)
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/16) α版 
//========================================================
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Wire.h>
  #include <Adafruit_NeoPixel.h>
  //│
  //■ＭＭＰシステム
  #include "mmpCtx.h" // 全体利用（実体）
  #include "cmd.h"    // 全体利用（参照）
  #include "dev.h"    // setup()
  #include "adp.h"    // setup(), loop()
  //┴
//┴

//========================================================
// グローバル資源
//========================================================
  //━━━━━━━━━━━━━━━━━
  // RGB-LED(NeoPixel)
  // 通信デバイス・コマンド管理の処理よりも先に記述
  //─────────────────
  //・所有者：スケッチ
  //・利用者：通信デバイス(シリアル)、コマンド管理
  //・利用法：externで実体を共有参照
  //・用途等：
  //  - 通信デバイス：通信速度の可視化
  //  - コマンド管理：実行機能の可視化
  //─────────────────
  // 定義元：Adafruit_NeoPixel.h
  //━━━━━━━━━━━━━━━━━
  #define NEOPIXEL_PIN 38 // Waveshare ESP32-S3-Tiny: WS2812 DIN=GPIO38
  Adafruit_NeoPixel INO_PIXEL(1, NEOPIXEL_PIN, NEO_GRB + NEO_KHZ800); // 1個

  //━━━━━━━━━━━━━━━━━
  //【コンテクスト】
  // システム全体で共有する業務情報
  //─────────────────
  //・所有者：スケッチ
  //・利用者：全体
  //・利用法：externで実体をアクセス
  //・用途等：
  //  - 通信アダプタ  ：受信データ・処理状態の共有領域
  //  - コマンド管理  ：コマンド実行情報の共有領域
  //  - 機能モジュール：レスポンス生成領域(仮想ストリーム)、ユーザメモリ管理
  //─────────────────
  // 定義元：mmpCtx.h
  //━━━━━━━━━━━━━━━━━
  const char* INO_VERSION = "V10a!";
  MmpContext ctx  = {.version = INO_VERSION};

  //━━━━━━━━━━━━━━━━━
  //【コマンド管理】
  // 通信アダプタと機能モジュールの共通I/F
  //─────────────────
  //・所有者：スケッチ
  //・利用者：通信アダプタ、管理内部の特定機能
  //・利用法：公開ポインタ経由でアクセス
  //・用途等：所有権を保持したまま依存方向を制御
  //─────────────────
  // 定義元：cmdMgr.h
  //━━━━━━━━━━━━━━━━━
  CmdManager OBJ_CMD(ctx)       ; // 本体(依存性注入)
  CmdManager* INO_CMD = &OBJ_CMD; // 外部公開ポインタ


//========================================================
// セットアップ
//--------------------------------------------------------
//・スケッチは実行の機会だけを提供
// - InitDevice() ：利用できるデバイスはこの関数以降で定義
// - InitAdapter()：対象サービスの取捨選択はこの関数以降で判断
// - INO_CMD->Init()：利用できる機能はこの関数以降で定義
//========================================================
void setup(){
  //┬
  //○通信デバイスを初期化
  InitDevice();
  //│
  //○アダプタを初期化
  InitAdapter();
  //│
  //○モジュールを初期化
  INO_CMD->Init();
  //│
  //○開始メッセージ出力
  Serial.println("---------------------------");
  Serial.print  ("Running... MMP Ver");
  Serial.println(String(ctx.version));
  Serial.println("---------------------------");
  //┴
} /* setup() */


//========================================================
// ポーリング
//--------------------------------------------------------
//・スケッチは起動の機会だけを提供
// - kickHandle()：実際のルーティング実行要否はこの関数以降で判断
//========================================================
void loop(){
  //┬
  //○サービス・アダプタのハンドルをキック
  kickHandle();
  //┴
} /* loop() */