// filename : mmp.ino
//========================================================
//  MMP Firmware
//--------------------------------------------------------
// - ボード情報      : Waveshare ESP32-S3-tiny用
// - ボート          : ESP32S3 Dev Module
// - USB CDC ON Boot : Enabled
// - Flash Size      : 4MB (32Mb)
// - Patition Scheme : Huge APP(3MB No OTA/1MB SPIFFS)
//--------------------------------------------------------
// 追加ライブラリ：
// - WebSockets by Markus Sattler
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/03) 
// ・[通信アダプタ]をオブジェクト化
// ・[通信アダプタ(UART)]をMMPサブ用に対応
// ・[機能モジュール][抽象基底クラス]を最適化
// ・全体を[ネームスペース][クラス]で安全性を確保
//========================================================
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Wire.h> // setup()
  //│
  //■ＭＭＰシステム
  #include "dev.h"  // デバイス・マネージャ
  #include "adp.h"  // アダプタ・マネージャ
  //┴
//┴

//========================================================
// セットアップ
//========================================================
void setup(){
  //┬
  //○デバイス・マネージャに初期化を依頼
  DeviceManager::INIT_DEVICE();
  //│
  //●アダプタ・マネージャに初期化を依頼
  AdapterManager::INIT_ADAPTER();
  //│
  //○開始メッセージ出力
  Serial.println("---------------------------");
  Serial.print  (String(ctx.sysName));
  Serial.println(String(" Ver.") + String(ctx.sysVer ));
  Serial.println("---------------------------");
  //┴
} /* setup() */

//========================================================
// ポーリング
//========================================================
void loop(){
  //┬
  //●アダプタ・マネージャにハンドルのキックを依頼
  AdapterManager::KICK_HANDLE();
  //┴
} /* loop() */