// filename : mmp.ino
//========================================================
//  MMP Firmware
//--------------------------------------------------------
// ボード情報：Waveshare ESP32-S3-tiny用
//  - ボート          : ESP32S3 Dev Module
//  - USB CDC ON Boot : Enabled
//  - Flash Size      : 4MB (32Mb)
//  - Patition Scheme : Huge APP(3MB No OTA/1MB SPIFFS)
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/23) 
//========================================================
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Wire.h>
  #include <Adafruit_NeoPixel.h>
  //│
  //■ＭＭＰシステム
  #include "conf.h"   // 各種設定
  #include "dev.h"    // setup()
  #include "adp.h"    // setup(), loop()
  //┴
//┴

//========================================================
// グローバル資源
//========================================================
  //━━━━━━━━━━━━━━━━━
  // RGB-LED(NeoPixel)
  // 通信デバイス・コマンド管理の処理よりも先に記述
  //─────────────────
  //・所有者：スケッチ
  //・利用者：通信デバイス(UART)、コマンド管理
  //・利用法：externで実体を共有参照
  //・用途等：
  //  - 通信デバイス：通信速度の可視化
  //  - コマンド管理：実行機能の可視化
  //─────────────────
  // 定義元：Adafruit_NeoPixel.h
  //━━━━━━━━━━━━━━━━━
  #define NEOPIXEL_PIN 38 // Waveshare ESP32-S3-Tiny: WS2812 DIN=GPIO38
  Adafruit_NeoPixel INO_PIXEL(1, NEOPIXEL_PIN, NEO_GRB + NEO_KHZ800); // 1個

//========================================================
// セットアップ
//--------------------------------------------------------
//・スケッチは実行の機会だけを提供
// - InitDevice() ：利用できるデバイスはこの関数以降で定義
// - InitAdapter()：対象サービスの取捨選択はこの関数以降で判断
// - INO_CMD->Init()：利用できる機能はこの関数以降で定義
//========================================================
void setup(){
  //┬
  //○通信デバイスを初期化
  INIT_DEVICE();
  //│
  //○アダプタを初期化
  INIT_ADAPTER();
  //│
  //○開始メッセージ出力
  Serial.println("---------------------------");
  Serial.print  (String(ctx.sysName));
  Serial.println(String(" Ver.") + String(ctx.sysVer ));
  Serial.println("---------------------------");
  //┴
} /* setup() */

//========================================================
// ポーリング
//--------------------------------------------------------
//・スケッチは起動の機会だけを提供
// - kickHandle()：実際のルーティング実行要否はこの関数以降で判断
//========================================================
void loop(){
  //┬
  //○各アダプタのハンドルをキック
  KICK_HANDLE();
  //┴
} /* loop() */