// filename : mmpContext.h
//========================================================
// ＭＭＰコンテクスト
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/23) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Arduino.h>
  //┴
//┴

//========================================================
// コンテクスト
//========================================================
struct MmpContext {
  //┬
  //■システム
  const String sysVer  = "V12a!"  ; // バージョン
  int          sysMode = MODE_BOOT; // 動作モード
  bool         sysLog  = true     ; // ログ表示
  //│
  //■レスポンス
  String       resMSG  = "" ; // レスポンスメッセージ
  //│
  //■転送先情報（ブリッジモードで利用）
  int          transID     = -1; // 転送先のアダプタID
  String       transDat1st = ""; // 転送先の個別情報１
  String       transDat2nd = ""; // 転送先の個別情報２
  String       transDat3rd = ""; // 転送先の個別情報３
  //│
  //■リクエスト情報
  int          adpID    = -1; // アダプタID
  String       strFrame = ""; // フレーム
  String       cmdPath  = ""; // コマンドパス
  String       authCD   = ""; // 認証コード
  //│
  //■ユーザメモリ管理のアドレス情報
  int          accID    = -1; // アクセスID(MMP全体の一意な番号)
  const int    accIDS   = 30; // アクセスIDの総数(ユーザ認証スロット数)
  //┴
};