// filename : mmpCtx.h
//========================================================
// ＭＭＰコンテクスト
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/23) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Arduino.h>
  //│
  //■ＭＭＰシステム
  //┴
//┴

//──────────────────────────────────────────────
// 仮想出力ストリーム
//--------------------------------------------------------------------------------------------
// 標準 Streamクラスを継承し、出力先を物理デバイスやネットワークソケットではなく、
// 内部の String変数へ差し替える。
//--------------------------------------------------------------------------------------------
//・任意の機能モジュールからの出力[write()]をバッファに一旦蓄積
//・HTTP通信(WebAPI)などのステートレスなレスポンス構築において、
//  最終的なJSONペイロード等へ一括してデータを組み込むための抽象化レイヤーとして機能
//・出力専用クラスであるため、入力やバッファ確認に関連するメソッド[read|available|peek]は
//  無効値を返し、予期せぬ誤動作を防ぎます。
//──────────────────────────────────────────────
class StringStream : public Stream {

    String out;                                         // 出力文字列の蓄積バッファ

  public:

  // ストリームをオーバーライド
    size_t  write(uint8_t c) override { out += (char)c; return 1; } // 1文字をバッファに追加
    int     available()      override { return  0;  } // 入力データなし（常に0）
    int     read()           override { return -1;  } // 読み込み未サポート...-1を返す
    int     peek()           override { return -1;  } // 先読み未サポート.....-1を返す
    void    flush()          override {             } // フラッシュ処理 ......何もしない

    // 独自メソッドを追加
    void    clear()                   { out = "";   } // バッファをクリア
    String  str()            const    { return out; } // 蓄積された文字列を取得

}; /* class StringStream */


//──────────────────────────────────────────────
// コンテクスト
//--------------------------------------------------------------------------------------------
// リクエスト処理に必要な状態や共有リソースを安全に伝搬させるための実行コンテキスト構造体。
// 処理の主体（クライアントID）や出力先（仮想ストリーム）、
// およびシステム共通リソースへの参照をひとまとめにして各機能モジュールへ渡します。
//--------------------------------------------------------------------------------------------
//・グローバル変数の乱用を抑制し、関数間の依存関係を明確化
//・処理ルーチンは本構造体を介して出力を行うため、
//  背後にある通信経路（UART/TCP/HTTP）の違いを意識する必要がない
//──────────────────────────────────────────────
struct MmpContext {
  //┬
  //■システム情報
#if defined(MMP_TYPE_MAIN) // --┨ＭＭＰ本体┠----┐
  const String sysName = "MMP本体";
#else // -----------------------┨ＭＭＰサブ┠----┤
  const String sysName = "MMPサブ";
#endif // ----------------------------------------┘
  const String sysVer  = "V120!"; // バージョン
  int          sysLog  = 0 ; // ログレベル {-1:なし | 0:レスポンス時 | n:処理プロセスn時 }
  //│
  //■機能モジュールのレスポンス
  StringStream vStream      ; // 応答データを一時蓄積する仮想ストリーム
  String       resMSG  = "" ; // レスポンスメッセージ
  //│
  //■リクエスト情報---
  String       strFrame = ""; // フレーム
  String       cmdPath  = ""; // コマンドパス
  String       authCD   = ""; // 認証コード
  //│
  //■ユーザメモリ管理の識別情報
  int          routeID  = -1; // 経路ID
  int          slotID   = -1; // スロットID
  //│
  //■ユーザメモリ管理のアドレス情報
  int          accID    = -1; // アクセスID(MMP全体の一意な番号)
  const int    accIDS   = 30; // アクセスIDの総数(ユーザ認証スロット数)
  //┴
};

//━━━━━━━━━━━━━━━━━
// グローバル資源
//━━━━━━━━━━━━━━━━━
  //─────────────────
  // コンテクスト
  //─────────────────
  extern MmpContext ctx; // ※実体の所有者はスケッチ（共有参照のみ公開）
