// filename : mmpCtx.h
//========================================================
// ＭＭＰコンテクスト
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/11) 新規 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  //│
  //■ＭＭＰシステム
  //┴
//┴

//──────────────────────────────────────────────
// 仮想出力ストリーム
//--------------------------------------------------------------------------------------------
// 標準 Streamクラスを継承し、出力先を物理デバイスやネットワークソケットではなく、
// 内部の String変数へ差し替える。
//--------------------------------------------------------------------------------------------
//・任意の機能モジュールからの出力[write()]をバッファに一旦蓄積
//・HTTP通信(WebAPI)などのステートレスなレスポンス構築において、
//  最終的なJSONペイロード等へ一括してデータを組み込むための抽象化レイヤーとして機能
//・出力専用クラスであるため、入力やバッファ確認に関連するメソッド[read|available|peek]は
//  無効値を返し、予期せぬ誤動作を防ぎます。
//──────────────────────────────────────────────
class StringStream : public Stream {

    String out;                                         // 出力文字列の蓄積バッファ

  public:

  // ストリームをオーバーライド
    size_t  write(uint8_t c) override { out += (char)c; return 1; } // 1文字をバッファに追加
    int     available()      override { return  0;  } // 入力データなし（常に0）
    int     read()           override { return -1;  } // 読み込み未サポート...-1を返す
    int     peek()           override { return -1;  } // 先読み未サポート.....-1を返す
    void    flush()          override {             } // フラッシュ処理 ......何もしない

    // 独自メソッドを追加
    void    clear()                   { out = "";   } // バッファをクリア
    String  str()            const    { return out; } // 蓄積された文字列を取得

}; /* class StringStream */

//──────────────────────────────────────────────
// コンテクスト
//--------------------------------------------------------------------------------------------
// リクエスト処理に必要な状態や共有リソースを安全に伝搬させるための実行コンテキスト構造体。
// 処理の主体（クライアントID）や出力先（仮想ストリーム）、
// およびシステム共通リソースへの参照をひとまとめにして各機能モジュールへ渡します。
//--------------------------------------------------------------------------------------------
//・グローバル変数の乱用を抑制し、関数間の依存関係を明確化
//・処理ルーチンは本構造体を介して出力を行うため、
//  背後にある通信経路（シリアル/TCP/HTTP）の違いを意識する必要がない
//──────────────────────────────────────────────
struct MmpContext {
  const char*  version  = ""; // システム共通のバージョン情報

  StringStream vStream      ; // 応答データを一時蓄積する仮想ストリーム

  String       strFrame = ""; // フレーム
  String       cmdPath  = ""; // コマンドパス

  int          routeID  = -1; // 経路ID
  int          slotID   = -1; // スロットID
  int          authID   = -1; // 認証ID（0：常時接続）
  int          accID    = -1; // アクセスID

  int          accIDS   = -1; // アクセスIDの総数
};