// filename : modINF.h
//========================================================
// 機能モジュール：システム情報
//--------------------------------------------------------
// Ver 1.0.0 (2025/11/14) α版
//========================================================
#pragma once
#include "mod.h"      // 機能モジュール：抽象基底クラス

//━━━━━━━━━━━━━━━━━
// メイン処理
//━━━━━━━━━━━━━━━━━
class ModuleInfo : public ModuleBase {
public:
  //━━━━━━━━━━━━━━━━━
  // モジュール(抽象基底クラス)
  //━━━━━━━━━━━━━━━━━
  using ModuleBase::ModuleBase;

  //━━━━━━━━━━━━━━━━━
  // コマンド在籍確認(実装)
  //━━━━━━━━━━━━━━━━━
  bool owns(const char* cmd) const override {
      return cmd && strncmp(cmd, "INFO", 4) == 0;
  }

  //━━━━━━━━━━━━━━━━━
  // コマンド・パーサー(実装)
  //━━━━━━━━━━━━━━━━━
  void handle(char dat[][ DAT_LENGTH ], int dat_cnt) override {

    //━━━━━━━━━━━━━━━━━
    // 前処理
    //━━━━━━━━━━━━━━━━━
    Stream&     sp = ctx.vStream;         // 仮想ストリーム
    LedScope    scopeLed(ctx, led);       // モジュール別LED色で発光
    const char* Cmd = _Remove1st(dat[0]); // コマンド名を補正

    // ───────────────────────────────
    // VER  : バージョン
    // 引数 : なし
    // 戻り : ・正常 [NNNN!]：メジャー1桁 マイナー1桁 リビジョン2桁
    //        ・異常 [VER!!]
    // ───────────────────────────────
    if (strcmp(Cmd,"VERSION") == 0){

      // １．前処理：
        // 1.1.書式チェック
      if (dat_cnt != 1){_ResChkErr(sp); return; }

      // ２．バージョン(文字列)を返す
      sp.print(ctx.version);

      // ３．後処理：
      return;
    }

  //━━━━━━━━━━━━━━━━━
  // コマンド名エラー
  //━━━━━━━━━━━━━━━━━
  _ResNotCmd(sp);
  return;
  }

//━━━━━━━━━━━━━━━━━
// 内部ヘルパー
//━━━━━━━━━━━━━━━━━
// なし
};
