// filename : modINF.h
//========================================================
// コマンド・モジュール：システム情報
//--------------------------------------------------------
// Ver 1.1.0 (2026/08/11) α版 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■Arduinoシステム
  //│
  //■ＭＭＰシステム
  //┴
//┴

//========================================================
// メイン処理
//========================================================
class ModuleInfo : public ModuleBase {
public:
  //━━━━━━━━━━━━━━━━━
  // モジュール(抽象基底クラス)
  //━━━━━━━━━━━━━━━━━
  using ModuleBase::ModuleBase;

  //========================================================
  // コマンド・パーサー(実装)
  //========================================================
  void handle(char dat[][ DAT_LENGTH ], int dat_cnt) override {

    //━━━━━━━━━━━━━━━━━
    // 前処理
    //━━━━━━━━━━━━━━━━━
    Stream&     sp = ctx.vStream;         // 仮想ストリーム
    const char* Cmd = _Remove1st(dat[0]); // コマンド名を補正

    // ───────────────────────────────
    // VER  : バージョン
    // 引数 : なし
    // 戻り :
    //  ・正常 [NNNN!]：メジャー1桁 マイナー1桁 リビジョン2桁
    //  ・異常 [VER!!]
    // ───────────────────────────────
    if (strcmp(Cmd,"VERSION") == 0){

      // １．前処理：
        // 1.1.書式チェック
      if (dat_cnt != 1){_ResChkErr(sp); return; }

      // ２．バージョン(文字列)を返す
      sp.print(ctx.version);

      // ３．後処理：
      return;
    }

    // ───────────────────────────────
    // SET_LOG : ログ出力レベル設定
    // 引数 : ① 出力レベル {-1:なし | 0:レスポンス時 | n:処理プロセスn時 }
    // 戻り : _ResOK
    // ───────────────────────────────
    if (strcmp(Cmd,"SET_LOG") == 0){

      // １．前処理：
        // 1.1.書式チェック
        if (dat_cnt != 2){_ResChkErr(sp); return; }

        // 1.2.単項目チェック
        int intLv;
        if (!_Str2Int(dat[1], intLv, -1, 5)){_ResChkErr(sp); return;}

      // ２．出力レベルをセット
      ctx.logLevel = intLv;

      // ３．後処理：
      _ResOK(sp);
      return;
    }

  //━━━━━━━━━━━━━━━━━
  // コマンド名エラー
  //━━━━━━━━━━━━━━━━━
  _ResNotCmd(sp);
  return;
  }

//━━━━━━━━━━━━━━━━━
// 内部ヘルパー
//━━━━━━━━━━━━━━━━━
// なし
};
