#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：タイトル画面(描画機能)
#┠─────────────────────────────────────
#┃描画コントローラが描画プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 描画クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #〇画面を描画する
        pyxel.blt(0,0, 2, 0,0, 159,119, 0)  # メインタイトル

        描画文字 = "Please select the number"
        縦 = 92
        pyxel.text(35, 縦  , 描画文字, 5)
        pyxel.text(34, 縦-1, 描画文字, 7)

        描画文字 = " of targets per team"
        縦 = 100
        pyxel.text(40, 縦  , 描画文字, 5)
        pyxel.text(39, 縦-1, 描画文字, 7)

        描画文字 = "press key:[1][2][3][4]"
        縦 = 110
        pyxel.text(39, 縦, 描画文字, 8)
        pyxel.text(38, 縦, 描画文字, 7)
