#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：タイトル画面(移動機能)
#┠─────────────────────────────────────
#┃更新コントローラが移動プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
import time
import main.GAME共通                                         as 共通処理
from   main.データセット                 import データセット as DS
from   main.オブジェクト.キャラ.カモロボ import カモロボ生成
from   ..DB                              import シーンID

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:

    #□標的数選択一覧：標的数選択におけるキーと標的数の対応表
    標的数選択一覧  = {
            pyxel.KEY_1: 1, # 1羽同志の対戦プレイ(合計2羽)
            pyxel.KEY_2: 2, # 2羽同士の対戦プレイ(合計4羽)
            pyxel.KEY_3: 3, # 3羽同士の対戦プレイ(合計6羽)
            pyxel.KEY_4: 4  # 4羽同士の対戦プレイ(合計8羽)
            }

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 移動クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #W〇個体オブジェクトのリファレンスを用意する
        self.仕様  = 仕様クラス()
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬ 
        #●標的数を選択する
        self.Fn標的数選択()
        if DS.情報.標的数 == 0: return
        #│＼（未選択の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #●各種オブジェクトを生成する
        self.Fnオブジェクト生成()
        #│
        #●画面遷移をセットする
        self.Fn画面遷移()
        #┴
	#────────────────────────────────────
    def Fn標的数選択(self):
        #┬ 
        #○標的数の一覧を用意する
        標的数一覧 = self.仕様.標的数選択一覧.keys()
        #│
        #◎└┐対戦標的数を設定する
        for 標的数 in 標的数一覧:
            #◇┐有効な標的数で設定する
            if pyxel.btnr(標的数) and 標的数 in self.仕様.標的数選択一覧:
            #　├┐（標的数とキーが一致する場合）
                #↓
                #○対戦標的数を設定する
                DS.情報.標的数 = self.仕様.標的数選択一覧[標的数]
            #　└┐（その他）
        #┴　┴　┴
	#─────────────────────────────────────
    def Fnオブジェクト生成(self):
        #┬ 
        #○各チームのポート一覧(MMPポート番号)を設定する
        チーム2 = list(range(DS.情報.標的数, (DS.情報.標的数 + DS.情報.標的数)))
        チーム1 = list(range(DS.情報.標的数))
        #│
        #●各チームのカモロボをオブジェクト化する
        カモロボ生成(2,チーム2)
        カモロボ生成(1,チーム1)
        #┴
	#────────────────────────────────────
    def Fn画面遷移(self):
        #┬ 
        #●カムロボを起動する
        共通処理.カモロボ.電飾制御(True)  
        #│
        #○ゲーム情報をリセットする
        DS.情報.プレイ時間 = DS.仕様.プレイ時間
        #│
        #○シーンを『プレイ画面』に進行する
        DS.情報.シーン     = シーンID.プレイ画面
        #│
        #●BGMを切替える
        共通処理.BGM_DFP.自動選択() # ＢＧＭ
        time.sleep(2)
        #┴