#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：更新：出現プロセス
#┠─────────────────────────────────────
#┃各オブジェクトのアクション・メソッドを実行する
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット                  import データセット as DS
from main.オブジェクト.管理.特殊効果    import アイテムID
from .P敵機 import *
from .Pボス import *
from .P機雷 import *
from .P補給 import *
from .P特殊 import *

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    #┬
    #□レベル内で出現する間隔
    間隔        = DS.仕様.難易度間隔
    機雷        = int(間隔 / 1.4)
    弾          = int(間隔 / 2.2)
    シールド    = int(間隔 / 0.7)
    アイテム    = int(間隔 / 1.7) # 推奨値＝1.7
    #┴

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセス実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #○シーンを確認する
        if DS.情報.シーン != DS.仕様.シーンID.プレイ画面: return
        if DS.情報.プレイ時間 < 60              : return
        #│＼（対象外の場合）
        #│ ↓
        #│ ▼繰処理を中断する
        #│
        #●└┐機能を実行する
            #●敵機(通常)を出現する
            #●機雷を出現する
            #●補給(弾)を出現する
            #●補給(シールド)を出現する
            #●アイテムを出現する
            #●敵(ボス)を出現する
        Pアクション_敵機()
        Pアクション_機雷( 仕様.機雷                             )
        Pアクション_補給( 仕様.弾       , アイテムID.弾薬       )
        Pアクション_補給( 仕様.シールド , アイテムID.シールド   )
        Pアクション_特殊( 仕様.アイテム                         )
        Pアクション_ボス()
        #┴　┴