#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：更新：出現プロセス：アクション（アイテム：補給物資）
#┠─────────────────────────────────────
#┃アイテム・オブジェクトのアクション・メソッドで補給物資を出現させる
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import  pyxel
from    main.データセット               import データセット as DS
from    main.オブジェクト.管理.特殊効果 import アイテムDB
from    main.オブジェクト.キャラ.敵機   import 敵機生成

#┌───────────────────────────────────
#│アクション・メソッド実行
#└───────────────────────────────────
def Pアクション_補給(
        引数_間隔       ,
        引数_アイテムID ):
    #┬
    #○出現タイミングを確認する
    タイミング判定  = (DS.情報.プレイ時間 % 引数_間隔 == 0)
    if not タイミング判定: return
    #│＼（出現時間が未到来の場合）
    #│ ↓
    #│ ▼処理を中断する
    #│
    #○難易度を確認する
    DB難易度    = アイテムDB[ 引数_アイテムID ][1][0]
    難易度判定  = (DB難易度 <= DS.情報.難易度)
    if not 難易度判定: return
    #│＼（難易度不足の場合）
    #│ ↓
    #│ ▼処理を中断する
    #│
    #≫アクション・メソッドでアイテム(給物資)を生成する
    画面幅   = DS.仕様.基本.画面幅
    キャラ幅 = DS.仕様.キャラ幅.通常
    X座標    = pyxel.rndi(0, 画面幅 - キャラ幅)
    敵機生成(X座標, -8, 引数_アイテムID, True)
    #┴