#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ：運搬機(移動プロセス)
#┠─────────────────────────────────────
#┃更新コントローラが移動プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import main.GAME共通 as 共通処理

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 移動クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self   ,
            引数_個体   ):  #① 個体オブジェクト
        #┬
        #〇個体オブジェクトのリファレンスを用意する
        self._個体  = 引数_個体
        self._仕様  = 引数_個体.仕様
        self._情報  = 引数_個体.情報
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #〇出力電力を求める
        最低出力 = self._仕様.最低出力
        最高出力 = self._仕様.最高出力
        変換効率 = self._仕様.変換効率
        出力     = min((最低出力 + self._情報.入力 * 変換効率), 最高出力)
         #│
        #〇出力電力を確定する
        self._情報.出力 = 出力
        if 出力 == 最低出力: 出力 = -1
        #　 ＼（最低出力の場合）
            #↓
            #○出力電力を停止レベルで確定する
            #┴
        #│
        #●動力(モータ)に出力電力(PWM値)を供給する
        共通処理.入出力.MMP.PWM_VALUE(self._仕様.動力No, 出力)
        #┴