// filename : Dep_Contact/mode/main.cpp
//========================================================
// 接客部門／窓口手順書（モード別処理）：メイン
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/27)
//========================================================

 namespace modeMain{
//========================================================
//§公開機能
//========================================================
  //━━━━━━━━━━━━━━━━━
  // メインモード実行
  //━━━━━━━━━━━━━━━━━
  void RUN(){
    //┬
    //●ユーザ認証を実施
    if (adpFnAuth::CHECK()) return;
    //│＼（処理継続が不可の場合）
    //│ ▼終了：早期リターン
    //│
    //●機能提供部門に後続処理を移譲
    DepFunction::RunCommand();
    //┴
  } /* RUN() */

} /* namespace modeMain */