#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃オブジェクト：運搬機
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import データセット as DS
from .FN動作           import 本体         as 動作機能の生成
from .FN救出           import 本体         as 救出機能の生成
from .FN表現           import 本体         as 表現機能の生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:

    #□電力情報
    最高出力 = 4095  # 上限値(単位:PWM値)
    最低出力 = 1300  # 下限値(単位:PWM値)
    変換効率 = 65    # 入力電力が出力電力に変換される効率(単位:％) 

    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self       ,
            引数_ポートNo   ,   #① MMPポート番号
            引数_送電No     ):  #② (モータ[PWMポート番号], 電飾[PWポート番号])

        #□ ポート情報リスト
        self.ポートNo   = 引数_ポートNo  # MMPポート番号
        self.動力No     = 引数_送電No[0] # モータのPWMポート番号
        self.電飾No     = 引数_送電No[1] # 電飾のPWMポート番号

        print("--------------------")
        print("[運搬機]")
        print(" MMP  :",self.ポートNo)
        print(" MOTOR:",self.動力No)
        print(" LED  :",self.電飾No)


#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):

        #□ 救出した恐竜の数
        self.救出数   = 0

        #□ ポート情報リスト
        self.入力電力 = 0 # 発電機から送電された電力
        self.出力電力 = 0 # 動力に供給する電力（画面表示用）

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self       ,
            引数_ポートNo   ,   #① MMPポート番号
            引数_送電No     ):  #② (動力[PWMポート番号] , 電飾[PWポート番号])
        #┬
        #≫データセットを用意する
        self.仕様 = 仕様(引数_ポートNo,引数_送電No)
        self.情報 = 情報()
        #│
        #≫プロセス機能を用意する
        self.FN動作 = 動作機能の生成(self)
        self.FN救出 = 救出機能の生成(self)
        self.FN表現 = 表現機能の生成(self)
        #│
        #≫このオブジェクトをコンテナに生成する
        DS.obj.運搬機.insert(0,self)
        #┴