// filename : Dep_Connect/adapter/_API0_.h
//========================================================
// 接続部門／業務課：担当課長（基本型）
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#ifndef CONN_ADP_API0_H
#define CONN_ADP_API0_H
#pragma once

//========================================================
// 経路アダプタの抽象基底クラス
//========================================================
class AdapterBase {
protected:
  //┬
  //□┐メンバ
    //□コンテクスト(参照)
    MmpContext& ctx; // コンテクスト(参照)
    //┴

public:
  //┬
  //○コンストラクタ
  AdapterBase(MmpContext& argCtx): ctx(argCtx){}
  //┴
  //┬
  //○デストラクタ
  virtual ~AdapterBase(){}
  //┴
  
  //┬
  //□┐共通インタフェイス
    //│
    //□実行ハンドル
    virtual void handle() = 0;
  //┴
//┴
};

#endif