// filename : Dep_Connect/adapter/HTTP.cpp
//========================================================
// 接続部門／担当：HTTP（ブリッジ）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/27)
//========================================================
//┬
//□┐インクルード
  //□Arduinoシステム
  #include <HTTPClient.h>
//┴┴

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス【基本型】
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class  AD_HTTP :
public AD_API
{
private:
//========================================================
//§基本情報
//========================================================
  int        MY_PORT = 8080   ; // ポート番号
  HTTPClient MY_NET           ; // HTTPクライアント(実体)

//========================================================
//§転送処理
//========================================================
  //───────────────────────────
  // リクエストを転送する
  //───────────────────────────
  void TRANS() override final {
  //┬
  //○┐【前処理】
    //○実行パラメータを用意
    String ip     = ctx.trans.Dat1;
    String port   = ctx.trans.Dat2;
    String cmd    = ctx.base.Frame;
    String strURL = String("http://") + ip + ":" + port + "/" + cmd;
    //┴
  //│
  //○┐【主処理】
    //○クライアント起動＋リクエスト転送
    MY_NET.begin(strURL);
    if (MY_NET.GET() <= 0) {ctx.base.Msg = RCD::Trn1Err; return;}
    //│＼（実行に失敗した場合）
    //│ ○コンテクストにエラーCDをセット
    //│ ▼終了：早期リターンする
    //│
    //○レスポンスを取得
    String retFrame = MY_NET.getString();
    //│
    //○クライアントを切断
    MY_NET.end();
    //│
    //○レスポンスをコンテクストに反映
    ctx.base.Frame = (retFrame == "" ? RCD::Trn2Err : retFrame);
    ctx.base.Msg   = ctx.base.Frame;
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* TRANS() */

//========================================================
//§ハンドルの事前処理と進行判定
//========================================================
  //───────────────────────────
  // 一般用
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  bool SETUP_NORMAL() override final {
    //●WiFiの接続状況を確認する
    return !devWiFi::ENABLED_CONN(true);
  } /* SETUP_NORMAL() */

  //───────────────────────────
  // ブリッジ用：スレーブ
  //※マスタの通信アダプタは更に実装する
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  bool SETUP_BRIDGE() override {
  //┬
  //○┐【前処理】
    //○(処理なし)
    //┴
  //│
  //○┐【主処理】
    //●前処理(スレーブ)を実施...進行判定を得る
    bool retGo = modeBridge::SLAVE(
      MY_AID,            // 通信アダプタID
      [this](){TRANS();} // 転送処理(関数をラムダ式で包む)
    );
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了(進行判定)
    return retGo;
  //┴
  } /* SETUP_BRIDGE() */

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // コンストラクタ【基本型】
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  AD_HTTP(MmpContext& argCtx) :
  AD_API(argCtx, AID::HTTP) 
  {
  //┬
  //○┐【前処理】
    //●前処理（一般用）を実行する...進行判定を得る
    if (this->SETUP_NORMAL()) return;
    //│＼（異常の場合）
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //┴
  //│
  //○┐【後処理】
    //○メッセージ表示
    Log::prtln(" [OK] HTTP");
  //┴┴
  } /* constractor AD_HTTP() */

  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // ポーリング用ハンドラ
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  void handle() override {
  //┬
  //○┐【前処理】
    //●WiFiの接続状況を確認する
    if (!devWiFi::ENABLED_CONN(true)) return;
    //│＼（異常の場合）
    //│ ▼終了：早期リターン
    //│
    //●ブリッジ用
    if (SETUP_BRIDGE()) return;
    //│＼（異常の場合）
    //│ ▼終了：早期リターン
    //┴
  //│
  //○┐【主処理】
    //●スタートアップ(スレーブ用)を実施
    bool retGo = modeBridge::SLAVE(MY_AID, [this](){this->TRANS();});
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* handle() */

}; /* class AD_HTTP */
