// filename : Dep_Connect/adapter/TCP.cpp
//========================================================
// 接続部門／業務課／担当(標準型)：TCP(RAW) 担当
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/22)
//========================================================
//┬
//□┐インクルード
  //□Arduinoシステム
  #include <WiFi.h> // ユーザ受付資源
  #include <queue>
  #include <mutex>
//┴┴

//========================================================
// 組織図
//========================================================
//┬
//□┐接続部門
  //□┐業務課
    //□担当
    #include "__index.h"
//┴┴┴

//########################################################
//# 処理詳細
//########################################################
class AdapterTCP : public AdapterQueueBase<WiFiClient> {
public:
  using AdapterQueueBase::AdapterQueueBase;

private:
//========================================================
//§基本情報
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 一般情報
  //━━━━━━━━━━━━━━━━━
    const int  ADP_ID = ADP_ID_TCP;
    int getAID() const override {return ADP_ID;} // 基底クラスに連携

  //━━━━━━━━━━━━━━━━━
  // サービス関連情報
  //━━━━━━━━━━━━━━━━━
    TaskHandle_t MY_TASK = NULL   ; // タスク識別(並列処理)
    int          MY_PORT = 8081   ; // ポート番号
//--------------------------
//➡ブリッジ：クライアント
#if (MODE == MODE_BRIDGE)
    WiFiClient   MY_NET           ; // クライアント(実体)
//➡ブリッジ以外：サーバ
#else
    WiFiServer*  MY_NET  = nullptr; // サーバ(ポインタ)
#endif /* ➡ブリッジ ➡ブリッジ以外 */
//--------------------------

//========================================================
//§各種ヘルパ
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 有効性確認
  //━━━━━━━━━━━━━━━━━
  bool ENA_CLIENT(WiFiClient argConn, bool argLog){
    bool ret = argConn.connected();
    if (ret == false && argLog) Log::prtln("[ERROR] TCPクライアントが切断されました。");
    return ret;
  } /* ENA_CLIENT() */

//========================================================
//§接続管理
//========================================================
  //─────────────────
  // 基本情報
  //─────────────────
  int SLOTs = 0; // コンストラクタで決定
  struct T_SLOT{
    bool       used = false;
    WiFiClient CONN         ; // TCP接続(実体)
  };
  T_SLOT* TBL = nullptr;

  //─────────────────
  // 初期化
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  void SLOT_INI(T_SLOT& argSlot){
    argSlot.used = false;
    if (argSlot.CONN) argSlot.CONN.stop();
  } /* SLOT_INI() */
    
  //─────────────────
  // 空きスロットIDを取得
  //----------------------------------
  // 戻り値：スロットID
  // ・0,1,2...：空きスロットのID
  // ・-1：空きスロットが無い
  //─────────────────
  int SLOT_GET_FREE() {
    //┬
    //○┐【前処理】
      //┴
    //│
    //○┐【主処理】
      //◎┐先頭から走査
      for (int ID = 0; ID < SLOTs; ID++) {
        //│＼（全スロットを走査し終えた場合）
        //│ ▽中断：ループ処理を中断
        //│
        //○スロットを確認
        if (!TBL[ID].used) return ID;
        //│＼（未使用の場合）
        //│ ▼返却：当該スロットIDを返す
        } /* for */
        //┴
      //┴
    //│
    //○┐【後処理】
      //▼返却：エラーCD(空きスロットがない)
      return -1;
      //┴
    //┴
  } /* SLOT_GET_FREE() */

  //─────────────────
  // 動的アタッチ
  //----------------------------------
  // 戻り値 ：処理結果（論理値）
  // ・false：正常
  // ・true ：異常
  //─────────────────
  bool SLOT_ATTACH(){
//--------------------------
//➡ブリッジ：単一スロット
#if (MODE == MODE_BRIDGE)
    //┬
    //○┐【前処理】
      //┴
    //│
    //○┐【主処理】
      //○0番スロットに直接割当
      if (!TBL[0].used) {
        SLOT_INI(TBL[0]);
        TBL[0].used = true;
        TBL[0].CONN = MY_NET; // クライアント接続をスロット0にセット
        TBL[0].CONN.setNoDelay(true);
      }
    //│
    //○┐【後処理】
      //▼返却：正常終了
      return false;
    //┴┴
//➡ブリッジ以外：動的スロット
#else
    //┬
    //○┐【前処理】
      //┴
    //│
    //○┐【主処理】
      //◎┐未管理のTCP接続をMMP管理対象へ登録
      while (true) {
        //│
        //○新規のTCP接続を取得
        WiFiClient newConn = MY_NET->available();
        if (!newConn) return false;
        //│＼（あらたな接続がない場合）
        //│ ▼返却：正常
        //│
        //●空きスロットを探す
        int ID = SLOT_GET_FREE();
        if (ID < 0) return true;
        //│＼（空きスロットがない）
        //│ ▼返却：異常
        //│
        //●スロットを初期化
        SLOT_INI(TBL[ID]);
        //│
        //○スロットに新規接続を登録
        TBL[ID].used = true   ; // 使用中
        TBL[ID].CONN = newConn; // TCP接続(実体)を登録
        TBL[ID].CONN.setNoDelay(true); // TCPパケット遅延制御
        //┴
      } //* while */
    //│
    //○┐【後処理】
    //┴┴
#endif /* ➡ブリッジ｜➡ブリッジ以外 */
//--------------------------
  } /* SLOT_ATTACH() */

//========================================================
//§返信処理
//========================================================
  //━━━━━━━━━━━━━━━━━
  // クライアントにレスポンス
  //━━━━━━━━━━━━━━━━━
  void SEND_CONN(WiFiClient argConn) override {
//--------------------------
//➡ブリッジ以外
#if (MODE != MODE_BRIDGE)
    //┬
    //○┐【前処理】
      //●TCP接続状況を確認
      if (!ENA_CLIENT(argConn, true)) return;
      //┴
    //│
    //○┐【主処理】
      //○クライアントにレスポンス
      argConn.print(ctx.resMSG);
      //┴
    //│
    //○┐【後処理】
      //●ログ出力
      adpFnBase::SHOW_LOG();
    //┴┴
#endif /* ➡ブリッジ以外 */
//--------------------------
  } /* SEND_CONN() */

//========================================================
//§受信処理
//========================================================
  //━━━━━━━━━━━━━━━━━
  // コールバック：クライアント用
  //━━━━━━━━━━━━━━━━━
  void ON_RECIVE(){
    //┬
    //○┐【前処理】
      //●接続管理スロットを動的アタッチ
      bool Result = SLOT_ATTACH();
      //┴
    //│
    //○┐【主処理】
      //◎┐スロットを走査
      for (int qSID = 0; qSID < SLOTs; qSID++) {
        //│＼（最後のスロットに達した場合）
        //│ ▼完了：走査を終了
        //│
        //○┐【前処理（走査内）】
          //○使用状況を確認
          if (!TBL[qSID].used) continue;
          //│＼（[未使用]の場合）
          //│ ▽次へ：次のスロットを走査
          //│
          //●TCP接続状況を確認
          if (!ENA_CLIENT(TBL[qSID].CONN, false)) {
          //│＼（[切断]の場合）
              //○スロットを初期化する
              //▽次へ：次のスロットを走査
              SLOT_INI(TBL[qSID]);
              continue;
          } /* if */
          //┴
        //│
        //○┐キュー情報を取得
          //●フレームを取得（ストリーム型）
          String qFrame = adpFnStream::GET_FRAME(TBL[qSID].CONN);
          if (qFrame == "") continue;
          //│＼（受信データがない場合）
          //│ ▽次へ：次のスロットを走査
          //┴
        //│
        //●キューを登録
        pushQueue(TBL[qSID].CONN, qFrame, qSID);
        //┴
      } /* for */
      //┴
    //│
    //○┐【後処理】
    //┴┴
  } /* ON_RECIVE() */

  //━━━━━━━━━━━━━━━━━
  // スレッド処理の定義
  //━━━━━━━━━━━━━━━━━
  static void StreamQueue(void *pvParameters) {
    AdapterTCP* self = static_cast<AdapterTCP*>(pvParameters);
    for (;;) {
      if (self) self->ON_RECIVE();        // 疑似コールバック関数
      vTaskDelay(1 / portTICK_PERIOD_MS); // 短いウェイト
    } /* for */
  } /* StreamQueue() */

  //━━━━━━━━━━━━━━━━━
  // 並列処理の開始
  //━━━━━━━━━━━━━━━━━
  void RUN_TASK() {
    //○受信タスクをFreeRTOSの別スレッドとして起動（自動コア割当）
    xTaskCreate(
      StreamQueue           , // 実行するタスク関数
      String(ADP_ID).c_str(), // タスク名（デバッグ用）
      4096                  , // スタックサイズ（バイト単位）
      this                  , // パラメータ
      2                     , // 優先度
      &MY_TASK                // タスク識別を取得
    );
  } /* RUN_TASK() */

//========================================================
//§ハンドル前処理
//========================================================

//========================================================
//§転送処理
//========================================================
//############################
//➡ブリッジ
#if (MODE == MODE_BRIDGE)
  //━━━━━━━━━━━━━━━━━
  // 転送実施
  //━━━━━━━━━━━━━━━━━
  void trans() override final {
    //┬
    //○┐【前処理】
      //○宛先情報を取得
      String transIP = ctx.bridge.Dat1;
      //┴
    //│
    //○┐【主処理】
      //◇┐クライアントを起動
      if (!ENA_CLIENT(MY_NET, false)) {
        //├┐（未接続の場合）
          //│
          //○クライアントを起動（成功するまでの待ち時間を指定）
          MY_NET.setTimeout(LIMIT::TIME_CONNECT);
          if (!MY_NET.connect(transIP.c_str(), MY_PORT)) {ctx.bridge.MSG = RCD::Trn1Err; return;}
          //│＼（接続に失敗した場合）
          //│ ○完了MSGにエラーCDをセット
          //│ ▼終了：早期リターン
          //│
          //○スロットを初期化
          SLOT_INI(TBL[0]);
          //│
          //●受信タスクを登録
          RUN_TASK(); // 並列処理で登録
          //┴
        //└┐（その他）
          //┴
      } /* if */
      //│
      //○退避したフレームでリクエスト(非同期でデータ受信)
      MY_NET.print(ctx.bridge.Frame);
      //┴
    //│
    //○┐【後処理】
    //┴┴
  } /* trans() */
#endif /* ➡ブリッジ */
//############################

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━
  // コンストラクタ
  //━━━━━━━━━━━━━━━━━
  AdapterTCP(MmpContext& argCtx) : AdapterQueueBase(argCtx) {
    //┬
    //○┐【前処理】
      //●WiFi接続状況を確認
      if (!devWiFi::ENABLED(true)) return;
      //┴
    //│
//--------------------------
//➡ブリッジ：[スロット]が単一，[サーバ][受信タスク]が不要
#if (MODE == MODE_BRIDGE)
    //○┐【主処理】
      //○接続管理TBLを作成
      SLOTs = 1;
      TBL   = new T_SLOT[SLOTs];
      //┴
    //│
    //○┐【後処理】
      //○メッセージ表示
      Log::prtln(" [OK] TCP");
      //┴
    //┴
//➡ブリッジ以外：[スロット]が複数，[サーバ][受信タスク]が必要
#else
    //○┐【主処理】
      //○接続管理TBLを作成
      SLOTs = 10;
      TBL   = new T_SLOT[SLOTs];
      //│
      //○サーバを起動
      MY_NET = new WiFiServer(MY_PORT);
      MY_NET->begin();
      //│
      //●受信タスク（並列処理）を登録
      RUN_TASK();
      //┴
    //│
    //○┐【後処理】
      //○メッセージ表示
      char msg[128];
      snprintf(msg, sizeof(msg), " [OK] TCP RAW    (PORT %d)", MY_PORT);
      Log::prtln(String(msg));
      //┴
    //┴
#endif /* ➡ブリッジ｜➡ブリッジ以外 */
//--------------------------
  } /* constractor AdapterTCP() */

}; /* class AdapterTCP */