// filename : Dep_Connect/adapter/TCP.cpp
//========================================================
// 接続部門／業務課／担当(標準型)：TCP(RAW) 担当
//--------------------------------------------------------
// Ver 1.3.2 (2026/09/21)
//========================================================
//┬
//□┐インクルード
  //□Arduinoシステム
  #include <WiFi.h> // ユーザ受付資源
  #include <queue>
  #include <mutex>
//┴┴

//========================================================
// 組織図
//========================================================
//┬
//□┐接続部門
  //□┐業務課
    //□担当
    #include "__index.h"
//┴┴┴

//########################################################
//# 処理詳細
//########################################################
class AdapterTCP : public AdapterQueueBase<WiFiClient> {
public:
  using AdapterQueueBase::AdapterQueueBase;

private:
//========================================================
//§基本情報
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 一般情報
  //━━━━━━━━━━━━━━━━━
    const int  ADP_ID = ADP_ID_TCP;
    int getAID() const override {return ADP_ID;} // 基底クラスに連携

  //━━━━━━━━━━━━━━━━━
  // サービス関連情報
  //━━━━━━━━━━━━━━━━━
//--------------------------
// ブリッジはWiFiクライアント
//--------------------------
#if (MODE == MODE_BRIDGE)
    WiFiClient  MY_NET           ; // WiFiクライアント(実体)
//--------------------------
// ブリッジ以外はWiFiサーバ
//--------------------------
#else
    WiFiServer* MY_NET  = nullptr; // WiFiサーバ(ポインタ)
    int         MY_PORT = 8081   ; // ポート番号
#endif
//--------------------------

//========================================================
//§接続管理
//========================================================
  //─────────────────
  // 基本情報
  //─────────────────
  int SLOTs = 0; // コンストラクタで決定
  struct T_SLOT{
    bool       used = false;
    WiFiClient CONN; // TCP接続の実体
  };
  T_SLOT* TBL = nullptr;

  //─────────────────
  // 初期化
  //----------------------------------
  // 引数：(参照)接続管理スロット
  //─────────────────
  void SLOT_INI(T_SLOT& argSlot){
    argSlot.used = false;
    if (argSlot.CONN) argSlot.CONN.stop();
  } /* SLOT_INI() */
    
  //─────────────────
  // 空きSID取得
  //----------------------------------
  // 戻り値：スロットID
  // ・0,1,2...：空きスロットのID
  // ・-1：空きスロットが無い
  //─────────────────
  int SLOT_GET_FREE() {
    //┬
    //◎┐先頭から走査
    for (int ID = 0; ID < SLOTs; ID++) {
    //│＼（全スロットを走査し終えた場合）
    //│ ▽中断：ループ処理を中断
    //│
    //○スロットを確認
    if (!TBL[ID].used) return ID;
    //│＼（未使用の場合）
    //│ ▼返却：当該スロットIDを返す
    } /* for */
    //│
    //▼返却：エラーCD(空きスロットがない)
    return -1;
    //┴
  } /* SLOT_GET_FREE() */

  //─────────────────
  // 動的アタッチ
  //----------------------------------
  // 戻り値 ：処理結果（論理値）
  // ・false：正常
  // ・true ：異常
  //─────────────────
  bool SLOT_ATTACH(){
//--------------------------
//【ブリッジ】単一スロット
//--------------------------
#if (MODE == MODE_BRIDGE)
    //【ブリッジ（クライアント）モードの場合】
    // MY_NET 自身がアクティブであれば 0番スロットに直接割り当てる
    if (!MY_NET.connected()) return false;

    if (!TBL[0].used) {
      SLOT_INI(TBL[0]);
      TBL[0].used = true;
      TBL[0].CONN = MY_NET; // クライアント接続をスロット0にセット
      TBL[0].CONN.setNoDelay(true);
    }
    return false;
//--------------------------
//【ブリッジ以外】動的スロット
//--------------------------
#else
    //┬
    //◎┐未管理のTCP接続をMMP管理対象へ登録する
    while (true) {
    //│
    //○新規のTCP接続を取得
    WiFiClient newConn = MY_NET->available(); // WiFiサーバ(ポインタ)
    if (!newConn) return false;
    //│＼（あらたな接続がない場合）
    //│ ▼返却：正常
    //│
    //●空きスロットを探す
    int ID = SLOT_GET_FREE();
    if (ID < 0) return true;
    //│＼（空きスロットがない）
    //│ ▼返却：異常
    //│
    //●スロットを初期化
    SLOT_INI(TBL[ID]);
    //│
    //○スロットに新規接続を登録
    TBL[ID].used = true   ; // 使用中
    TBL[ID].CONN = newConn; // TCP接続(実体)を登録
    TBL[ID].CONN.setNoDelay(true); // TCPパケット遅延制御
    //┴
    } //* while */
#endif
//--------------------------
  } /* SLOT_ATTACH() */

//========================================================
//§返信処理
//========================================================
  //━━━━━━━━━━━━━━━━━
  // クライアントにレスポンス
  //━━━━━━━━━━━━━━━━━
  void SEND_CONN(WiFiClient argConn) override {
//############################
//# ブリッジは[trans()]で処理
//############################
#if (MODE != MODE_BRIDGE)
    //┬
    //○クライアントにレスポンス
    if (argConn.connected()) argConn.print(ctx.resMSG);
    //│
    //●ログ出力
    adpFnBase::SHOW_LOG();
    //┴
#endif
//############################
  } /* SEND_CONN() */

//========================================================
//§受信処理
//========================================================
  //━━━━━━━━━━━━━━━━━
  // コールバック：クライアント用
  //━━━━━━━━━━━━━━━━━
  void ON_RECIVE(){
    //┬
    //○接続管理スロットを動的アタッチ
    bool Result = SLOT_ATTACH();
    //│
    //◎┐スロットを走査
    for (int ID = 0; ID < SLOTs; ID++) {
      //│＼（最後のスロットに達した場合）
      //│ ▼完了：走査を終了
      //│
      //○┐スロットの状態を確認
        //│
        //○接続状況を確認
        if (!TBL[ID].CONN.connected()) {
        //│＼（切断の場合）
            //○スロットを初期化する
            //▽次へ：次のスロットを走査
            SLOT_INI(TBL[ID]);
            continue;
        } /* if */
        //│
        //○使用状況を確認
        if (!TBL[ID].used) continue;
        //│＼（未使用のスロットの場合）
        //│ ▽次へ：次のスロットを走査
        //┴
      //│
      //●ストリームを受信
      String retFrame = adpFnStream::GET_FRAME(TBL[ID].CONN);
      if (retFrame == "") continue;
      //│＼（受信データがない場合）
      //│ ▽次へ：次のスロットを走査
      //│
      //○キューに登録（基底クラスの pushQueue を呼出し）
      pushQueue(TBL[ID].CONN, retFrame, ID);
      //┴
    } /* for */
    //┴
  } /* ON_RECIVE() */

  //━━━━━━━━━━━━━━━━━
  // スレッド処理の定義
  //━━━━━━━━━━━━━━━━━
  static void StreamQueue(void *pvParameters) {
    AdapterTCP* self = static_cast<AdapterTCP*>(pvParameters);
    for (;;) {
      if (self) self->ON_RECIVE();        // 疑似コールバック関数
      vTaskDelay(1 / portTICK_PERIOD_MS); // 短いウェイト
    }
  } /* StreamQueue() */

  //━━━━━━━━━━━━━━━━━
  // 並列処理の開始
  //━━━━━━━━━━━━━━━━━
  TaskHandle_t TaskHandle = NULL; // タスク・ハンドル
  void RUN_TASK() {
    //○受信タスクをFreeRTOSの別スレッドとして起動（自動コア割当）
    xTaskCreate(
      StreamQueue           , // 実行するタスク関数
      String(ADP_ID).c_str(), // タスク名（デバッグ用）
      4096                  , // スタックサイズ（バイト単位）
      this                  , // パラメータ
      2                     , // 優先度
      &TaskHandle             // タスクハンドル
    );
  } /* RUN_TASK() */

//========================================================
//§ハンドル前処理
//========================================================

//############################
//# 転送機能はブリッジのみ
//############################
#if (MODE == MODE_BRIDGE)
//========================================================
//§転送処理
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 転送実施
  //━━━━━━━━━━━━━━━━━
  void trans() override final {
    //┬
    //◇┐クライアントを起動
    if (!MY_NET.connected()) {
      //├┐（未接続の場合）
        //│
        //○TCPクライアントを起動
        String   ip   = ctx.bridge.Dat1;
        uint16_t port = (uint16_t)ctx.bridge.Dat2.toInt();
        MY_NET.setTimeout(LIMIT::TIMEOUT_CONNECT);
        if (!MY_NET.connect(ip.c_str(), port)) {ctx.bridge.MSG = RCD::Trn1Err; return;}
        //│＼（接続に失敗した場合）
        //│ ○完了MSGにエラーCDをセット
        //│ ▼終了：早期リターン
        //│
        //○0番スロットをリセットして自身を登録準備
        SLOT_INI(TBL[0]);
        //│
        //●受信タスクを起動
        RUN_TASK();
        //┴
      //└┐（その他）
        //┴
    } /* if */
    //│
    //○退避したフレームでリクエスト(非同期でデータ受信)
    MY_NET.print(ctx.bridge.Frame);
    //┴
  };
#endif
//############################

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━
  // コンストラクタ
  //━━━━━━━━━━━━━━━━━
  AdapterTCP(MmpContext& argCtx) : AdapterQueueBase(argCtx) {
//--------------------------
// ブリッジは単一スロット
//--------------------------
#if (MODE == MODE_BRIDGE)
    //┬
    //○┐【前処理】
      //○（処理なし）
      //┴
    //│
    //○┐【主処理】
      //○接続管理TBLを作成
      SLOTs = 1;
      TBL   = new T_SLOT[SLOTs];
      //┴
    //│
    //○┐【後処理】
      //○メッセージ表示
      Log::prtln(" [OK] TCP");
      //┴
    //┴
//--------------------------
// ブリッジ以外は複数スロット
//--------------------------
#else
    //┬
    //○┐【前処理】
      //○（処理なし）
      //┴
    //│
    //○┐【主処理】
      //○接続管理TBLを作成
      SLOTs = 10;
      TBL   = new T_SLOT[SLOTs];
      //│
      //○サービス資源を生成
      MY_NET = new WiFiServer(MY_PORT);
      MY_NET->begin();
      //│
      //●受信タスクを別スレッドとして起動
      RUN_TASK();
      //┴
    //│
    //○┐【後処理】
      //○メッセージ表示
      char msg[128];
      snprintf(msg, sizeof(msg), " [OK] TCP / PORT.%d", MY_PORT);
      Log::prtln(String(msg));
      //┴
    //┴
#endif
//--------------------------
  } /* constractor AdapterTCP() */

}; /* class AdapterTCP */