// filename : Dep_Connect/adapter/UART.cpp
//========================================================
// 接続部門／担当：UART(非同期キュー＋スロット型)
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/24)
//========================================================
//┬
//□┐インクルード
//┴┴
//┬
//□┐接続部門
  //□担当：通信アダプタ
  #include "__index.h"
//┴┴

//########################################################
// クラス：多重継承＋仮想継承
//########################################################
class AdapterUART :
  public AdapterQueueBase<Stream*>,
  public AdapterSlotBase<Stream*>
{
private:
//========================================================
//§基本情報
//========================================================
  //─────────────────
  // 一般情報
  //─────────────────
    const int ADP_ID = ADP_ID_UART;
    int getAID() const override { return ADP_ID; } // 基底クラスに連携

//========================================================
//§各種ヘルパ
//========================================================

//========================================================
//§接続管理
//========================================================

//========================================================
//§返信処理
//========================================================
  //─────────────────
  // クライアントにレスポンス
  //─────────────────
  void SEND_CONN(Stream* argConn) override final {
    //┬
    //○クライアントにレスポンス
    //●ログ出力
    argConn->print(ctx.resMSG);
    adpFnBase::SHOW_LOG();
    //┴
  } /* SEND_CONN() */

//========================================================
//§受信処理
//========================================================
  //─────────────────
  // タスク関数
  //─────────────────
  void ON_RECIVE() override final {
    //┬
    //◎┐スロットを走査
    for (int ID = 0; ID < SLOTs; ID++) {
      //│＼（最後のスロットに達した場合）
      //│ ▼完了：走査を終了
      //│
      //●データを受信（ストリーム）
      String retFrame = adpFnStream::GET_FRAME(*(TBL[ID].CONN));
      //│
      //●キューを登録
      if (retFrame != "") pushQueue(TBL[ID].CONN, retFrame, ID);
      //┴
    } /* for */
    //┴
  } /* ON_RECIVE() */

//========================================================
//§転送処理
//========================================================

//========================================================
//§ハンドル前処理
//========================================================
//############################
//➡ブリッジ
#if (MODE == MODE_BRIDGE)
  //─────────────────
  // 前処理(ブリッジ／マスタ)
  //─────────────────
  bool handle_SetupBridge() override final {
    //┬
    //○┐【前処理】
      //○(処理なし)
      //┴
    //│
    //○┐【主処理】
      //●スタートアップ(マスタ用)を実施
      bool retGo = modeBridge::MASTER(
        TBL[ctx.bridge.slotID].CONN,           // 退避済スロット
        [this](Stream* conn){SEND_CONN(conn);} // ラムダ式で包む
      );
      //┴
    //│
    //○┐【後処理】
      //▼返却：正常終了(進行判定)
      return retGo;
    //┴
  } /* handle_SetupBridge() */
#endif /* ➡ブリッジ */
//############################

//========================================================
//§公開機能
//========================================================
public:
  //─────────────────
  // コンストラクタ：多重継承＋仮想継承
  //─────────────────
  AdapterUART(MmpContext& argCtx): 
    AdapterBase(argCtx), 
    AdapterQueueBase<Stream*>(argCtx), 
    AdapterSlotBase<Stream*>(argCtx) 
  {
    //┬
    //○┐【前処理】
      //○（処理なし）
      //┴
    //│
    //○┐【主処理】
      //●接続管理TBLを作成
//--------------------------
//➡サブ
#if (MODE == MODE_SUB)
      SLOTs = 2;
      TBL = new T_SLOT[SLOTs];
      SLOT_SET(0, &Serial);
      SLOT_SET(1, &Serial2);
      String msg = " [OK] UART USB(CDC)+Serial#2";
//--------------------------
// ➡サブ以外
#else
      SLOTs = 3;
      TBL = new T_SLOT[SLOTs];
      SLOT_SET(0, &Serial);
      SLOT_SET(1, &Serial1);
      SLOT_SET(2, &Serial2);
      String msg = " [OK] UART / USB(CDC) + Serial#1,2";
#endif /* サブ,サブ以外 */
//--------------------------
      //│
      //●受信タスクを起動
      RUN_TASK(ADP_ID);
      //┴
    //│
    //○┐【後処理】
      //○メッセージ表示
      Log::prtln(msg);
    //┴┴
  } /* constractor AdapterUART() */

}; /* class AdapterUART */