// filename : Dep_Connect/adapter/UART.cpp
//========================================================
// 接続部門／担当：UART
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/24)
//========================================================

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス：非同期キュー型＋スロット型
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class  AdapterUART :
public AdapterQueueBase<Stream*>, // 接続識別子：Stream*
public AdapterSlotBase<Stream*>   // 接続識別子：Stream*
{
private:
//========================================================
//§基本情報
//========================================================
  //───────────────────────────
  // 通信アダプタID
  //───────────────────────────
  const int ADP_ID = ADP_ID_UART;              // 内部用
  int getAID() const override {return ADP_ID;} // 基底クラス用

//========================================================
//§返信処理
//========================================================
  //───────────────────────────
  // 接続元にMSGをレスポンスする
  //───────────────────────────
  void SEND_CONN(Stream* argConn) override final {
    //┬
    //○接続元宛にメッセージを送信する
    //●ログを出力する
    argConn->print(ctx.resMSG);
    adpFnBase::SHOW_LOG();
    //┴
  } /* SEND_CONN() */

//========================================================
//§受信処理
//========================================================
  //───────────────────────────
  // 並列処理の内容を定義
  //───────────────────────────
  void ON_RECIVE() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //◎┐受信データのあるスロットは全てキュー登録する
    for (int qSID = 0; qSID < SLOTs; qSID++) {
      //│＼（全スロットを走査し終えた場合）
      //│ ▼完了：走査を終える
      //│
      //○┐キュー登録に必要な情報を用意する
        //●フレーム求める
        String qFrame = adpFnStream::GET_FRAME(*(TBL[qSID].CONN));
        if (qFrame != "") continue;
        //│＼（受信データがない場合）
        //│ ▽次へ：次のスロットの走査へ進む
        //┴
      //│
      //●キューを登録する
       pushQueue(TBL[qSID].CONN, qFrame, qSID);
      //┴
    } /* for */
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* ON_RECIVE() */

//========================================================
//§ハンドル実行の前処理
//========================================================
  //───────────────────────────
  // ブリッジ用：マスタ
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
//-----------------------------------------
//➡ブリッジ
#if (MODE == MODE_BRIDGE)
  bool SETUP_BRIDGE() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //●前処理(マスタ)を実施→進行判定を取得
    bool retGo = modeBridge::MASTER(
      TBL[ctx.bridge.slotID].CONN,           // 接続識別子
      [this](Stream* conn){SEND_CONN(conn);} // 返信処理(関数をラムダ式で包む)
    );
    //┴
  //│
  //○┐【後処理】
    //▼返却：進行判定
    return retGo;
  //┴
  } /* SETUP_BRIDGE() */
#endif /* ➡ブリッジ */
//-----------------------------------------

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // コンストラクタ：非同期キュー型＋スロット型
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  AdapterUART(MmpContext& argCtx): 
  AdapterBase<Stream*>(argCtx),      // 接続識別子：Stream*
  AdapterQueueBase<Stream*>(argCtx), // 接続識別子：Stream*
  AdapterSlotBase<Stream*>(argCtx)   // 接続識別子：Stream*
  {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
//--------------------------
//➡サブ
#if (MODE == MODE_SUB)
    //○接続管理TBLを作成する
    SLOTs = 2;
    TBL = new T_SLOT[SLOTs];
    //│
    //●接続スロットを作成する
    SLOT_SET(0, &Serial);
    SLOT_SET(1, &Serial2);
    //│
    //○起動ログ表示のMSGを用意する
    String msg = " [OK] UART USB(CDC)+Serial#2";
//--------------------------
// ➡サブ以外
#else
    //○接続管理TBLを作成する
    SLOTs = 3;
    TBL = new T_SLOT[SLOTs];
    //│
    //●接続スロットを作成する
    SLOT_SET(0, &Serial);
    SLOT_SET(1, &Serial1);
    SLOT_SET(2, &Serial2);
    //│
    //○起動ログ表示のMSGを用意する
    String msg = " [OK] UART / USB(CDC) + Serial#1,2";
#endif /* サブ,サブ以外 */
//--------------------------
    //│
    //●データ受信のタスクを開始する
    RUN_TASK(ADP_ID);
    //┴
  //│
  //○┐【後処理】
    //○起動ログを表示する
    Log::prtln(msg);
  //┴┴
  } /* constractor AdapterUART() */

}; /* class AdapterUART */