// filename : Dep_Connect/adapter/WEB_Socket.cpp
//========================================================
// 接続部門／担当：WEB Socket
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/24)
//========================================================
//┬
//□┐インクルード
  //□追加ライブラリ：WebSockets by Markus Sattler
  #include <WebSocketsServer.h> // メインモード，サブモード
  #include <WebSocketsClient.h> // ブリッジモード
//┴┴

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス：非同期キュー型
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class  AD_WEBS:
public AdapterQueueBase<uint8_t> // 接続識別子：uint8_t
{
private:
//========================================================
//§基本情報
//========================================================
  //───────────────────────────
  // 通信アダプタID
  //───────────────────────────
  const int ADP_ID = ADP_ID_WSOC;              // 内部用
  int getAID() const override {return ADP_ID;} // 基底クラス用

  //───────────────────────────
  // サービス関連情報
  //───────────────────────────
  static AD_WEBS*   MY_TASK          ; // インスタンス識別
  int               MY_PORT = 8082   ; // ポート番号
//──────────────────
//➡ブリッジ
//・クライアントを利用
#if (MODE == MODE_BRIDGE)
//------------------------------------
  WebSocketsClient  MY_NET           ; // クライアント(実体)
//──────────────────
//➡ブリッジ以外
//・サーバを利用
#else
//------------------------------------
  WebSocketsServer* MY_NET  = nullptr; // サーバ(ポインタ)
//------------------------------------
#endif //➡ブリッジ｜➡ブリッジ以外
//──────────────────

//========================================================
//§接続管理
//========================================================
  //───────────────────────────
  // 接続元の接続状況を確認
  //------------------------------------------------------
  //【戻り値】接続状況
  // true ：接続中
  // false：未接続
  //───────────────────────────
  bool ENABLED_CONN(bool argLog){
//──────────────────
//➡ブリッジ
//・クライアントの接続状態で判定
#if (MODE == MODE_BRIDGE)
//------------------------------------
    bool ret = webSocket.isConnected();
    if (!ret && argLog) Log::prtln("[ERROR] WEB Socketが未接続です。");
    return ret;
//──────────────────
//➡ブリッジ以外
//・WiFiの稼働状態で判定
#else
//------------------------------------
    bool ret = devWiFi::ENABLED_CONN(false);
    if (!ret && argLog) Log::prtln("[ERROR] WEB Socketが停止しています。");
    return ret;
//------------------------------------
#endif //➡ブリッジ｜➡ブリッジ以外
//──────────────────
  } /* ENABLED_CONN() */

//========================================================
//§返信処理
//========================================================
  //───────────────────────────
  // 接続元にMSGをレスポンスする
  //───────────────────────────
  void SEND_CONN(uint8_t argConn) override final {
//──────────────────
//➡ブリッジ以外
//・ブリッジはレスポンスではなく転送
#if (MODE != MODE_BRIDGE)
//------------------------------------
  //┬
  //○┐【前処理】
    //●接続元の接続状況を確認する
    if (!ENABLED_CONN(true)) return;
    //│＼（サービスが機能していない場合）
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //○接続元にMSGをレスポンスする
    MY_NET->sendTXT(argConn, ctx.resMSG.c_str());
    //┴
  //│
  //○┐【後処理】
    //●ログを出力する
    adpFnBase::SHOW_LOG();
  //┴┴
//------------------------------------
#endif //➡ブリッジ以外
//──────────────────
  } /* SEND_CONN() */

//========================================================
//§受信処理
//========================================================
  //───────────────────────────
  // 並列処理の内容を定義
  //───────────────────────────
  static void ON_RECIVE(
//──────────────────
//➡ブリッジ以外
//・引数シグネチャに接続番号がある
#if (MODE != MODE_BRIDGE)
//------------------------------------
    uint8_t   argNUM , // 接続番号
//------------------------------------
#endif //➡ブリッジ以外
//──────────────────
    WStype_t  argTYPE, // イベント種別
    uint8_t * argDATA, // 受信データ
    size_t    argLEN   // 受信データ長
  ){
  //┬
  //○┐【前処理】
    //○インスタンスを確認する
    if (!MY_TASK                        ) return;
    //│＼（当該インスタンスではない場合）
    //│ ▼終了：早期リターンする
    //│
    //○イベントの種類を確認する
    if (argTYPE != WStype_TEXT          ) return;
    //│＼（テキスト以外の場合）
    //│ ▼終了：早期リターンする
    //│
    //○受信データを確認する
    if (argDATA == nullptr || argLEN < 1) return;
    //│＼（空の場合）
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //○┐キュー情報を用意する
//──────────────────
//➡ブリッジ
//・引数シグネチャに接続番号がない
#if (MODE == MODE_BRIDGE)
//------------------------------------
      //○接続識別子を求める（ダミー値）
      uint8_t qConn  = 0;
//──────────────────
//➡ブリッジ以外
//・引数シグネチャに接続番号がある
#else
//------------------------------------
      //○接続識別子を求める（接続番号）
      uint8_t qConn  = argNUM;
//------------------------------------
#endif //➡ブリッジ｜➡ブリッジ以外
//──────────────────
      //┴
    //│
    //●キューを登録する
    MY_TASK->pushQueue(qConn, String((char*)argDATA), 0);
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* ON_RECIVE() */

//========================================================
//§転送処理
//========================================================
//──────────────────
//➡ブリッジ
//・転送処理はブリッジ固有の機能
#if (MODE == MODE_BRIDGE)
//------------------------------------
  //───────────────────────────
  // リクエストを転送する
  //───────────────────────────
  void TRANS() override final {
  //┬
  //○┐【前処理】
    //○宛先情報を用意する
    String transIP = ctx.bridge.Dat1;
    //┴
  //│
  //○┐【主処理】
    //◇┐サービスを開始する
    if (!MY_NET.isConnected()) {
      //├┐（未接続の場合）
        //○並列処理を開始する
        MY_TASK  = this;
        MY_NET.onEvent(ON_RECIVE); 
        //│
        //◎┐クライアントサービスの起動を試みる
        MY_NET.begin(transIP.c_str(), MY_PORT, "/");
        unsigned long startTime = millis();
        while(!MY_NET.isConnected() && ((millis() - startTime) < LIMIT::TIME_CONNECT))
        {MY_NET.loop(); delay(200);}
          //│＼（[接続OK]または[タイムアウト]の場合）
          //│ ▽完了：リトライを終了する
          //┴
        //│
        //○サービス状態を確認する
        if (!MY_NET.isConnected()) {ctx.bridge.MSG = RCD::Trn1Err; return;}
        //│＼（接続に失敗した場合）
        //│ ○完了MSGにエラーCDをセット
        //│ ▼終了：早期リターンする
        //┴
      //└┐（その他）
        //┴
    } //～if 
    //│
    //○リクエストを転送する
    MY_NET.sendTXT(ctx.bridge.Frame);
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* TRANS() */
//------------------------------------
#endif //➡ブリッジ
//──────────────────

//========================================================
//§ハンドル実行の前処理
//========================================================
  //───────────────────────────
  // 一般用
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  bool SETUP_NORMAL() override final {
  //┬
  //○┐【前処理】
    //●接続元の接続状況を確認する
    if (!ENABLED_CONN(true)) return true;
    //│＼（機能していない場合）
    //│ ▼終了：早期リターンする（進行NG）
    //┴
  //│
  //○┐【主処理】
    //○WebSocketの処理を進める（イベント発火）
    //※クライアントは未接続でも loop() を回し続けて接続状態の変化を検知
    //※接続の有無に関わらず、後続へ進める（false）
    MY_NET->loop();
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了（進行OK）
    return false;
  //┴
  } /* SETUP_NORMAL() */

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // コンストラクタ：非同期キュー型
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  AD_WEBS(MmpContext& argCtx):
  AdapterBase<uint8_t>(argCtx),     // 接続識別子：uint8_t
  AdapterQueueBase<uint8_t>(argCtx) // 接続識別子：uint8_t
  {
  //┬
  //○┐【前処理】
    //●WiFiの接続状況を確認する
    if (!devWiFi::ENABLED_CONN(true)) return;
    //┴
  //│
//──────────────────
//➡ブリッジ
//・サーバが不要
//・受信タスクが不要
#if (MODE == MODE_BRIDGE)
//------------------------------------
  //○┐【主処理】
    //┴
  //│
  //○┐【後処理】
    //○メッセージ表示
    Log::prtln(" [OK] WEB Socket");
  //┴┴
//──────────────────
//➡ブリッジ以外
//・サーバが必要
//・受信タスクが必要
#else
//------------------------------------
  //○┐主処理
    //○サーバを生成
    MY_NET = new WebSocketsServer(MY_PORT); // サーバ生成
    //│
    //●受信タスクを登録
    MY_TASK = this            ; // タスク識別を取得
    MY_NET->onEvent(ON_RECIVE); // コールバック関数で登録
    //│
    //○サーバを起動
    MY_NET->begin()           ; // サーバ起動
    //┴
  //│
  //○┐【後処理】
    //○メッセージ表示
    char msg[128];
    snprintf(msg, sizeof(msg), " [OK] WEB Socket (PORT %d)", MY_PORT);
    Log::prtln(String(msg));
  //┴┴
//------------------------------------
#endif //➡ブリッジ｜➡ブリッジ以外
//──────────────────
  } /* constractor AD_WEBS() */

}; /* class AD_WEBS */

//========================================================
//§インスタンス識別
//========================================================
AD_WEBS* AD_WEBS::MY_TASK = nullptr;