#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能→遷移プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import データセット as DS
from ...汎用部品       import 音声
from ...               import 共通部品

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass
    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●ゲーム情報を初期化する
        #●オブジェクトを初期化する
        #●立体物を初期化する
        self.Fnゲーム情報を初期化()
        self.Fnオブジェクトを初期化()
        self.Fn立体物を初期化()
        #┴
	#─────────────────────────────────────
    def Fnゲーム情報を初期化(self):
        #┬ 
        #○シーンを『タイトル画面』に遷移する
        #○BGMの再生時間を初期化する
        DS.情報.シーン = DS.仕様.シーン.タイトル画面
        音声.情報.再生時間 = 0
        #│
        #○標的数を初期化する
        DS.情報.標的数   = 0
        #┴
	#─────────────────────────────────────
    def Fnオブジェクトを初期化(self):
        #┬
        #○各種情報を初期化する
        DS.obj.カモロボ = [] # コンテナを空
        #┴
	#────────────────────────────────────
    def Fn立体物を初期化(self):
        #┬ 
        #●発電機(モータと電飾)を停止する
        共通部品.電飾制御(False)  
        #┴
