#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ：発電機(移動プロセス)
#┠─────────────────────────────────────
#┃更新コントローラが移動プロセスで実行するアクション・メソッド
#┃・下位にデータセット･クラス(仕様)を持つ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import main.GAME共通 as 共通処理

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 移動クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self   ,
            引数_個体   ):   #① 個体オブジェクト
        #┬
        #〇個体オブジェクトのリファレンスを用意する
        self._仕様  = 引数_個体.仕様
        self._情報  = 引数_個体.情報
        #│
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●前進(下方に移動)する
        漕ぐ力 = self.Fn漕ぐ()
        #│
        #●発電する
        self.Fn発電(*漕ぐ力)
        #┴
	#────────────────────────────────────
    def Fn漕ぐ(self):
        #┬
        右 = 0
        左 = 0
        #│
        #◎└┐
        for 各ポート in self._仕様.ポート:
            #│＼（全ペダルを走査した場合）
            #│ ↓
            #│ ▼処理を中断する
            #│
            #●操作概要を確認する
            結果 = 共通処理.入出力.入力走査(各ポート)
#            if 結果[0][1] == 0: return True
            #│＼（押されたものが『ない』場合）
            #│ ↓
            #│ ▼処理を中断する
            #│
            #◇┐漕ぐを求める
            if 結果[1][0] and not 結果[1][1]:右 += 1
            #　├┐（右足がON・左脚がOFFの場合）
                #↓
                #○右足の力を加える
                #┴
            elif not 結果[1][0] and 結果[1][1]:左 += 1
            #　├┐（右足がOFF・左脚がONの場合）
                #↓
                #○左足の力を加える
                #┴
            #　└┐（その他）
            #┴　┴
        #│
        return (右,左)
        #┴
	#────────────────────────────────────
    def Fn発電(self     ,
             引数_右    ,
             引数_左    ):
        #┬
        右足の力 = 引数_右 - 引数_左

        右足判定 = 共通処理.発電機.右足判定(self._情報.角度)
        if 右足判定:
            if 右足の力 > 0:
                self._情報.発電容量 += 右足の力
        else:
            if 右足の力 < 0:
                self._情報.発電容量 += abs(右足の力)

        self._情報.角度 += 7
        if self._情報.角度 > 360: self._情報.角度 = 0