#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ：発電機
#┠─────────────────────────────────────
#┃自機オブジェクト用クラス
#┃・下位にデータセット･クラス(仕様｜情報)を持つ
#┃・下位に機能クラス(移動｜衝突｜発射｜描画)をもつ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット  import データセット as DS
from .FN移動            import 移動クラス

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報クラス:
    def __init__(self):

        #□ 救出数
        self.救出数     = 0

        #□ 電気極性　-1:－極／0:極性なし／1:＋極
        self.電気極性   = 0

        #□ 救出数
        self.発電容量   = 0

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    def __init__(self, 引数_ポート): #① ペダルのポート・リスト
        #┬
        #≫データセットを用意する
        self.情報   = 情報クラス()
        #│
        #≫処理セットを用意する
        self.FN移動 = 移動クラス(self,引数_ポート)
        #│
        #○用意済みのインスタンスに生成する
        DS.obj.発電機.insert(0,self)
        #┴