// filename : Dep_Connect/adapter/HTTP/HTTP_Bridge.cpp
//========================================================
// 接続部門／担当：HTTP（ベース：ブリッジモード）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/28)
//========================================================
//┬
//□┐インクルード
  //□Arduinoシステム
  #include <HTTPClient.h>
//┴┴

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス【基本型】
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class  AD_HTTP : // 接続識別子：なし
public AD_API    // 基本型
{
private:
//========================================================
//§基本情報
//========================================================
  HTTPClient MY_NET; // HTTPクライアント(実体)

//========================================================
//§最終処理
//========================================================
  //───────────────────────────
  // 転送依頼を処理する
  //───────────────────────────
  void TRANS() override final {
  //┬
  //○┐【前処理】
    //●WiFiの接続状況を確認する
    if (!devWiFi::ENABLED_CONN(true))
    {ctx.trans.Msg = RCD::Trn1Err; return;}
    //│＼（状態が[未接続]の場合）
    //│ ○完了MSGにエラーCDをセット
    //│ ▼終了：早期リターンする
    //│
    //○宛先情報を用意する
    String toIP    = ctx.trans.Dat1; // IPアドレス
    String toPort  = ctx.trans.Dat2; // ポート番号
    String cmdPath = ctx.base.Frame; // コマンドパス
    String toURL   = String("http://") + toIP + ":" + toPort + "/" + cmdPath;
    //┴
  //│
  //○┐【主処理】
    //○クライアントを起動し、この通信アダプタにリクエストを送信する
    MY_NET.begin(toURL);
    if (MY_NET.GET() <= 0) {ctx.trans.Msg = RCD::Trn2Err; return;}
    //│＼（実行に失敗した場合）
    //│ ○レスポンスMSGにエラーCDをセット
    //│ ▼終了：早期リターンする
    //│
    //○転送先からの受信データ(フレーム)を取得する
    String retFrame = MY_NET.getString();
    //│
    //○クライアントを切断する
    MY_NET.end();
    //│
    //○処理結果をコンテクストに反映 ← 受信データ(フレーム)
    ctx.base.Frame = (retFrame == "") ? RCD::Trn3Err : retFrame;
    ctx.base.Msg   = ctx.base.Frame;
    //┴
  //│
  //○┐【後処理】
    //●ログ出力
    adpFnBase::SHOW_LOG();
  //┴┴
  } /* TRANS() */

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // コンストラクタ【基本型】
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  AD_HTTP(MmpContext& argCtx) : // 接続識別子：なし
  AD_API(             argCtx, AID::HTTP) // 基本型
  {
  //┬
  //○┐【前処理】
    //●初期化の健全性を確認する
    if (SETUP_NORMAL()) return;
    //│＼（問題がある場合）
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //┴
  //│
  //○┐【後処理】
    //○メッセージ表示
    Log::prtln(" [OK] HTTP");
  //┴┴
  } /* constractor AD_HTTP() */

  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // ポーリング用ハンドラ
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  void handle() override {
  //┬
  //○┐【前処理】
    //●WiFiの接続状況を確認する
    if (!devWiFi::ENABLED_CONN(true)) return;
    //│＼（異常の場合）
    //│ ▼終了：早期リターン
    //│
    //●ブリッジ用
    if (SETUP_BRIDGE()) return;
    //│＼（異常の場合）
    //│ ▼終了：早期リターン
    //┴
  //│
  //○┐【主処理】
    //●スタートアップ(スレーブ用)を実施
    bool retGo = modeBridge::SLAVE(MY_AID, [this](){this->TRANS();});
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* handle() */

}; /* class AD_HTTP */