#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：描画：線にプロセス
#┠─────────────────────────────────────
#┃各シーンの画面遷移を実行する
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセス実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #○シーン遷移要否を確認する
        if not DS.情報.遷移要否: return
        #│＼（シーンの遷移が不要の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #●描画アクションを実行する
        DS.obj.シーン[DS.情報.シーン].FN遷移.実行()
        #│
        #●シーン遷移要否をリセット(不要)する
        DS.情報.遷移要否 = False
        #┴