#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能(表現プロセス)のアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [システム共通]
import pyxel

# [ゲーム共通]
from main.データセット import DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self, 引数_上位): #① 上位のコンポジットクラス
        #┬
        #○データセット(コンポジット)のリファレンスを用意する
        self._仕様 = 引数_上位.仕様
        self._情報 = 引数_上位.情報
        #│
        #≫データセットを用意する
        self.仕様  = 仕様()
        self.情報  = 情報()
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        self.Fn開始可能()
        self.Fn開始可能()
        #┬
        #●タイトル画像を表示する
        #●時間選択を表示する
        #●人数選択を表示る
        #●開始可能ガイダンスを表示する
        self.Fnタイトル画像()
        self.Fn人数選択()
        self.Fn操作法選択()
        self.Fn開始可能()
        #┴
	#────────────────────────────────────
    def Fnタイトル画像(self):
        #┬
        #○タイトル画像を表示する
        pyxel.blt(1,5, 2, 0,0, 15*8-1,11*8-1, 15)
        #┴
	#────────────────────────────────────
    def Fn人数選択(self):

        左1  = 28
        左2  = 31
        縦   = 94
        改行 = 7

        文字 = "<<   Player   >>"
        pyxel.text(左1  , 縦  , 文字, 5)
        pyxel.text(左1-1, 縦-1, 文字, 7)

        if DS.情報.人数 == 0: 文字 = " 0:Not Ready "
        if DS.情報.人数 == 1: 文字 = "1:Key/Joy/MMP"
        if DS.情報.人数 == 2: 文字 = "  2:Joy/MMP  "
        if DS.情報.人数 == 3: 文字 = "    3:MMP    "
        縦 += 改行
        if DS.情報.人数 > 0:pyxel.text(左2+4, 縦, 文字, 8)
        pyxel.text(左2+3, 縦, 文字, 7)
        #┴
	#────────────────────────────────────
    def Fn操作法選択(self):

        左1  = 28
        左2  = 31
        縦   = 100
        改行 = 7

        文字 = "<< Controller >>"
        縦 += 14
        pyxel.text(左1  , 縦  , 文字, 5)
        pyxel.text(左1-1, 縦-1, 文字, 7)

        文字 = "[K]:Keyboard"
        縦 += 改行
        if DS.情報.操作手段 == 0:pyxel.text(左2, 縦, 文字, 8)
        pyxel.text(左2-1, 縦, 文字, 7)

        文字 = "[J]:JoyPad"
        縦 += 改行
        if DS.情報.操作手段 == 1:pyxel.text(左2, 縦, 文字, 8)
        pyxel.text(左2-1, 縦, 文字, 7)

        文字 = "[M]:MMP"
        縦 += 改行
        if DS.情報.操作手段 == 2:pyxel.text(左2, 縦, 文字, 8)
        pyxel.text(左2-1, 縦, 文字, 7)

        文字 = (f"{DS.情報.MMP中央値}({DS.情報.MMP反応率}%)")
        if DS.情報.操作手段 == 2:pyxel.text(左2 + 32, 縦, 文字, 2)
        pyxel.text(左2 + 31, 縦, 文字, 15)
        #┴
	#────────────────────────────────────
    def Fn開始可能(self):
        #┬
        #○選択内容を調べる
        if DS.情報.人数 == 0                                : return #人数選択
        if DS.情報.操作手段 is None                         : return #操作選択
        if (DS.情報.人数 >= 2) and (DS.情報.操作手段 == 0)  : return #キーボード条件
        if (DS.情報.人数 >= 3) and (DS.情報.操作手段 != 2)  : return #MMPパッド条件
        #│＼（プレイ時間かチーム人数が未選択の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #○開始可能ガイダンスを表示する
        高 = DS.仕様.リソース.画面.高 - 10
        文字 = "HIT SPACE KEY TO START"
        pyxel.text(18, 高   , 文字, 5)
        pyxel.text(17, 高 -1, 文字, pyxel.frame_count % 16)
        #┴

