#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能(遷移プロセス)のアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from   ...                           import 共通部品
from   ...データセット               import データセット as DS
from   ...オブジェクト.管理.特殊効果 import 特殊効果生成
from   ...オブジェクト.キャラ.自機   import 自機生成,自機共通生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self, 引数_上位): #① 上位のコンポジットクラス
        #┬
        #○データセット(コンポジット)のリファレンスを用意する
        self._仕様 = 引数_上位.仕様
        self._情報 = 引数_上位.情報
        #│
        #≫データセットを用意する
        self.仕様  = 仕様()
        self.情報  = 情報()
        #┴

    #┌───────────────────────────────────
    #│プロセス機能を実行
    #└───────────────────────────────────
    def 実行(self):
        #┬ 
        #●ゲーム情報を初期化する
        #●オブジェクトを初期化する
        #●音声を再生する
        self.Fnゲーム情報を初期化()
        self.Fnオブジェクトを初期化()
        self.Fn音声を再生()
        #┴
	#─────────────────────────────────────
    def Fnゲーム情報を初期化(self):
        #┬ 
        #○シーンを『プレイ画面』に遷移する
        DS.情報.シーン = DS.仕様.シーンID.プレイ画面
        #│
        #○得点を初期化する
        DS.情報.得点        = 0
        #│
        #○プレイ時間を初期化する
        DS.情報.プレイ時間  = 1
        DS.情報.難易度      = 1
        #┴
	#─────────────────────────────────────
    def Fnオブジェクトを初期化(self):
        #┬
        #●自機共通の情報オブジェクトを生成する
        #●特殊効果オブジェクトを生成する ※自機共通を参照するの為この順序で
        DS.obj.自機共通 = 自機共通生成()
        DS.obj.特殊効果 = 特殊効果生成()        
        #│
        #◎└┐人数分の自機を登場する
        位置間隔 = int(DS.仕様.画面幅 / (DS.情報.人数 + 1))
        for tmpNo in range(DS.情報.人数):
            #│＼（すべての処理を終えた場合）
            #│ ↓
            #│ ▼繰り返し処理を抜ける
            #│
            #○画面横位置を等間隔に登場する
            自機生成( tmpNo, 位置間隔 * (tmpNo + 1), 140)
            #┴
        #┴
	#────────────────────────────────────
    def Fn音声を再生(self):
        #┬ 
        #●BGMを鳴らす
        共通部品.BGM_DFP.指定曲ザコ()
        #┴        