#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：タイトル画面
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import データセット as DS
from .FN動作           import 本体         as 動作機能の生成
from .FN表現           import 本体         as 表現機能の生成
from .FN遷移           import 本体         as 遷移機能の生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:

    #□砂時計のサーボ
    砂時計 = 5   #サーボ番号(ジオラマの砂時計)
    最小   = 136 #下限：110～
    最大   = 616 #上限：～660

    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):

        #□プレイ時間の選択肢
        self.時間一覧  = {
            0: ("-----", 0                     ), # 未選択
            1: ("30sec", DS.仕様.プレイ時間 * 1), # 30秒
            2: ("1min ", DS.仕様.プレイ時間 * 2), # 1分：30秒 x 2
            3: ("2min ", DS.仕様.プレイ時間 * 4), # 2分：30秒 x 4
            4: ("3min ", DS.仕様.プレイ時間 * 6)  # 3分：30秒 x 6
            }

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:

    #□砂時計の上下向き
    砂時計向き = True # 砂時計の向き(True:上向き, False:下向き)

    #□プレイ時間選択肢の番号
    時間番号   = 0

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫データセットを用意する
        self.仕様  = 仕様()
        self.情報  = 情報()
        #│
        #≫プロセス機能を用意する
        self.FN動作 = 動作機能の生成(self)
        self.FN表現 = 表現機能の生成(self)
        self.FN遷移 = 遷移機能の生成(self)
        #┴