#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能→遷移プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import main.GAME共通                         as 共通処理
from   main.データセット import データセット as DS
from   ..DB              import シーンID

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass
    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●ゲーム情報を初期化する
        #●立体物を初期化する
        #●音声を再生する
        self.Fnゲーム情報を初期化()
        self.Fn立体物を初期化()
        self.Fn音声を再生()
        #┴
	#─────────────────────────────────────
    def Fnゲーム情報を初期化(self):
        #┬ 
        #○シーンを『終了画面』に遷移する
        DS.情報.シーン = シーンID.終了画面
        #┴
	#────────────────────────────────────
    def Fn立体物を初期化(self):
        #┬ 
        #●発電機(モータと電飾)を停止する
        共通処理.カモロボ.電飾制御(False)  
        #┴
	#────────────────────────────────────
    def Fn音声を再生(self):
        #┬ 
        #○BGMを切り替える
        共通処理.BGM_DFP.自動選択()
        #┴