#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃変更機能→移動プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [ゲーム共通]
from main.データセット import DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self, 引数_上位): #① 上位のコンポジットクラス
        #┬
        #○データセット(コンポジット)のリファレンスを用意する
        self._仕様 = 引数_上位.仕様
        self._情報 = 引数_上位.情報
        #│
        #≫データセットを用意する
        self.仕様  = 仕様()
        self.情報  = 情報()
        #┴

    #┌───────────────────────────────────
    #│プロセスを実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●キャラクタの動作を変更する
        self.Fnオブジェクトの動作()
        #│
        #●シーンの状態を変更する
        DS.obj.シーン[DS.情報.シーン].FN動作.実行()
        #┴ 

    #┌───────────────────────────────────
    #│オブジェクトのプロセスを実行
    #└───────────────────────────────────
    def Fnオブジェクトの動作(self):
        #┬
        #○シーンを確認する
        if DS.情報.シーン != DS.仕様.シーンID.プレイ画面: return
        #│＼（シーンがプレイ画面以外の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #●選手を動作する
        DS.obj.選手.FN動作.実行()
        #┴ 
