#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃変更機能→移動プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセス実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●キャラクタの動作を変更する
        self.Fnオブジェクトの動作()
        #│
        #●シーンの状態を変更する
        DS.obj.シーン[DS.情報.シーン].FN動作.実行()
        #┴ 
#┌───────────────────────────────────
#│アクション・メソッド実行
#└──────────────────────────う─────────
    def Fnオブジェクトの動作(self):
        #┬
        #○シーンを確認する
        if DS.情報.シーン != DS.仕様.シーンID.プレイ画面: return
        #│＼（シーンがプレイ画面以外の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #●選手を動作する
        DS.obj.選手.FN動作.実行()
        #┴ 
