#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃変更機能→移動プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット        import データセット as DS
from main.オブジェクト.シーン import DB

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセス実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●キャラクタを移動する
        self.Fnキャラクタ移動()
        #│
        #●シーンを移動する
        DS.obj.シーン[DS.情報.シーン].FN移動.実行()
        #┴ 
#┌───────────────────────────────────
#│アクション・メソッド実行
#└──────────────────────────う─────────
    def Fnキャラクタ移動(self):
        #┬
        #○シーンを確認する
        if DS.情報.シーン != DB.シーンID.プレイ画面: return
        #│＼（プレイ画面以外の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #●キャラクタを移動する
        DS.obj.選手.FN移動.実行()
        #┴ 
