// filename : Dep_Connect/adapter/WEBS/WEBS.cpp
//========================================================
// 接続部門／担当：WEB Socket（ベース）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/29)
//========================================================
//┬
//□┐インクルード
  //□追加ライブラリ：WebSockets by Markus Sattler
  #include <WebSocketsServer.h> // メインモード，サブモード
  #include <WebSocketsClient.h> // ブリッジモード
//┴┴

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス【非同期キュー型】
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class  AD_WEBS : // 接続識別子：uint8_t
public AD_API_Queue<uint8_t> // 非同期キュー型
{
private:
//========================================================
//§基本情報
//========================================================
  static AD_WEBS*   MY_TASK          ; // インスタンス識別
  int               MY_PORT = 8082   ; // ポート番号
//──────────────────
//➡ブリッジ
//・クライアントを利用
#if MODE == MODE_BRIDGE
//------------------------------------
  WebSocketsClient  MY_NET           ; // クライアント(実体)
//──────────────────
//➡ブリッジ以外
//・サーバを利用
#else
//------------------------------------
  WebSocketsServer* MY_NET  = nullptr; // サーバ(ポインタ)
//------------------------------------
#endif //➡ブリッジ｜➡ブリッジ以外
//──────────────────

//========================================================
//§受信処理
//========================================================
  //───────────────────────────
  // 並列処理の内容を定義
  //───────────────────────────
  static void ON_RECIVE(
//──────────────────
//➡ブリッジ以外
//・引数に接続番号がある
#if MODE != MODE_BRIDGE
//------------------------------------
    uint8_t   argNUM , // 接続番号(接続識別子)
//------------------------------------
#endif //➡ブリッジ以外
//──────────────────
    WStype_t  argTYPE, // イベント種別
    uint8_t * argDATA, // 受信データ
    size_t    argLEN   // 受信データ長
  ){
  //┬
  //○┐【前処理】
    //○受信内容を確認する
    if (
      !MY_TASK               ||
      argTYPE != WStype_TEXT ||
      argDATA == nullptr     || argLEN < 1
    ) return;
    //│＼（[タスク違い][テキスト以外][空データ]いずれかの場合）
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //●キューを登録する
//──────────────────
//➡ブリッジ
//・引数に接続番号(接続識別子)がない
#if MODE == MODE_BRIDGE
//------------------------------------
    MY_TASK->pushQueue(0, String((char*)argDATA), 0);
//──────────────────
//➡ブリッジ以外
//・引数に接続番号(接続識別子)がある
#else
//------------------------------------
    MY_TASK->pushQueue(argNUM, String((char*)argDATA), 0);
//------------------------------------
#endif //➡ブリッジ｜➡ブリッジ以外
//──────────────────
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* ON_RECIVE() */

//========================================================
//§モード別実装のインクルード
//========================================================
#if MODE == MODE_BRIDGE
  #include "WEBS_Bridge.cpp"
#else
  #include "WEBS_MainSub.cpp"
#endif

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // コンストラクタ【非同期キュー型】
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  AD_WEBS(MmpContext&   argCtx) : // 接続識別子：uint8_t
  AD_API<      uint8_t>(argCtx, AID::WSOC), // 基本型
  AD_API_Queue<uint8_t>(argCtx, AID::WSOC)  // 非同期キュー型
  {
  //┬
  //○┐【前処理】
    //●初期化の健全性を確認する
    if (SETUP()) return;
    //│＼（問題がある場合）
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //●モード別コンストラクタを実施する
    String retMsg = CONSTRACT();
  //│
  //○┐【後処理】
    //●起動ログMSGを表示する
    Log::prtln(retMsg);
  //┴┴
  } /* constractor AD_WEBS() */

}; /* class AD_WEBS */

//========================================================
//§インスタンス識別
//========================================================
AD_WEBS* AD_WEBS::MY_TASK = nullptr;