// filename : Dep_Connect/adapter/WEBS/WEBS_MainSub.cpp
//========================================================
// 接続部門／担当：WEB Socket（メインモード・サブモード）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/28)
//========================================================

//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 開始処理：コンストラクタ
  //───────────────────────────
  String CONSTRACT() {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //○サーバを生成
    MY_NET = new WebSocketsServer(MY_PORT); // サーバ生成
    //│
    //●受信タスクを登録
    MY_TASK = this            ; // タスク識別を取得
    MY_NET->onEvent(ON_RECIVE); // コールバック関数で登録
    //│
    //○サーバを起動
    MY_NET->begin()           ; // サーバ起動
    //┴
  //│
  //○┐【後処理】
    //▼：返却：起動ログ表示のMSG
    char msg[100];
    snprintf(msg, sizeof(msg), " [OK] WEB Socket (PORT %d)", MY_PORT);
    return String(msg);
  //┴
  } /* CONSTRACT() */

  //───────────────────────────
  // 終了処理：接続元にMSGをレスポンスする
  //───────────────────────────
  void SEND_CONN(uint8_t argConn) override final {
  //┬
  //○┐【前処理】
    //●初期化の健全性を確認する
    if (SETUP_NORMAL()) return;
    //│＼（問題がある場合）
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //○接続元にレスポンスMSGを送信する
    MY_NET->sendTXT(argConn, ctx.base.Msg.c_str());
    //┴
  //│
  //○┐【後処理】
    //●ログを出力する
    adpFnBase::SHOW_LOG();
  //┴┴
  } /* SEND_CONN() */

//========================================================
//§ハンドルの事前処理と進行判定
//========================================================
  //───────────────────────────
  // 一般用：追加事項
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  bool SETUP_OPTION() override final {
    //┬
    //○WebSocketの処理を進める
    //▼返却：正常終了（進行OK）
    MY_NET->loop();
    return false;
    //┴
  } /* SETUP_OPTION() */
