# filename : Data.py
# =========================================
# Ｄ層(データ層)
# 様々な共通データを提供する。
# -----------------------------------------
#  Phase 2.8 : 
# =========================================

# ------------------------
# Wifi・WebAPIのネット情報
# ・N層がWifi接続後に更新
# ------------------------
ネット  = {
    "SSID"    : "",     # JSONファイルより
    "IP"      : "",     # Wifiルータより
    "GATEWAY" : "",     # Wifiルータより
    "SUBNET"  : "",     # Wifiルータより
    "DNS"     : "",     # Wifiルータより
    "PORT"    : 8080,   # 固定値
    }

# ------------------------
# プレイヤーの基本情報
# ・N層がJSON読込後に更新[名前]
# ・F層(/info)が参照[名前]
# ・F層(/assign)が更新[背番号]
# ------------------------
基本  = {
    "名前"      : "",   # JSONファイルの内容
    "背番号"    : -1,   # 主催者が採番
    }

# ------------------------
# 問題の内容や条件
# ・F層(/begin)が更新[全部]
# ------------------------
出題  = {
    "問題"      : [],   # 例： [0,1,2,3,...]
    "制限時間"  : 0 ,   # 単位：ms
    "ミス上限数": 0 ,   # 0:一発アウト / 1以上:許容回数
    "ペナルティ": 0 ,   # 単位：ms
    }


# ------------------------
# プレイ中の情報
# ・F層(/begin)が初期化
# ・P層(プレイ画面)が更新[開始時刻 以外]
# ・F層が更新[状態]
# ・F層(/status)が参照[開始時刻 以外]
# ------------------------
状況  = {
    "状態"      : "idle", # idle / standby / playing / finish / ending
    "ステップ数": -1    , # 回答済みシーケンス数
    "ミス回数"  : -1    , # これまでミスした回数  
    "開始時刻"  : -1    , # 単位：ms
    "所要時間"  : -1    , # 単位：ms
    }

# ------------------------
# ゲームの結果
# ・F層(/result)が更新
# ------------------------
結果  = {   
    "順位"      : -1,   # 
    "参加数"    : -1,   #
    }

# ------------------------
# IPアドレス欄の表示情報
# ・P層(開始待ち画面)が更新
# ------------------------
画面  = {
    "IP"        : "",   # IPアドレス欄の表示文字列
    "現在位置"  : 0 ,   # 表示開始位置
    "最端位置"  : 0 ,   # 右端の位置
    }
