# -*- coding: utf-8 -*-
# filename : mmp_core_INF.py
#============================================================
# ＭＭＰコマンド：システム情報
# バージョン：0.5
#------------------------------------------------------------
# [インストール方法]
# ・ＰＣ：[PYTHONPASTH] ※環境変数をセットしておく
# ・マイコン：[LIB]
# ・プロジェクトと同一ディレクトリ
#============================================================
class _Info:
#━━━━━━━━━━━━━━━
# コンストラクタ
#━━━━━━━━━━━━━━━
    def __init__(self, p:'MmpClient', argTimeOut):
        self._p      = p
        self.TimeOut = argTimeOut

#━━━━━━━━━━━━━━━
# コマンド
#━━━━━━━━━━━━━━━
    #─────────────
    # バージョン
    #─────────────
    def VERSION(self) -> str:
        return self._p._send_command("INFO/VERSION!", self.TimeOut)