// filename : Dep_Command/module/_index_.h
//========================================================
// コマンド部門／担当：在籍一覧
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#pragma once

//========================================================
// 必要な資源
//========================================================
//┬
//□┐接続部門
  //│
  //□担当課長
  #include "_api_.h"   // 担当課長
  //│
  //□担当：機能モジュール
  #include "system.h"  // システム管理
  #include "analog.h"  // アナログ入力
  #include "digital.h" // デジタル入出力
  #include "pwm.h"     // PWM出力
  #include "IIC.h"     // IIC通信
  #include "mp3.h"     // MP3プレイヤー
//┴┴