#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ：弾(衝突機能)
#┠─────────────────────────────────────
#┃更新コントローラが衝突プロセスで実行するアクション・メソッド
#┃※弾オブジェクトはシールドを持たず、強制的に削除
#┃※爆発オブジェクトを生成する直接のトリガとなる
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット              import データセット as DS
from main.オブジェクト.演出.爆発    import 爆発生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self, 引数_上位): #① 上位のコンポジットクラス
        #┬
        #○データセット(コンポジット)のリファレンスを用意する
        self._上位 = 引数_上位
        self._仕様 = 引数_上位.仕様
        self._情報 = 引数_上位.情報
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #├───────────────────────────────────
    #│※小爆発の為、爆発音は無し
    #└───────────────────────────────────
    def 実行(self               ,
            引数_ダメージ = 0   ):  #① 強制破壊用
        #┬
        #≫爆発を生成する
        d = DS.仕様.キャラ幅.通常 // 2
        x = self._情報.X + d
        y = self._情報.Y + d
        r = 4
        爆発生成(x, y, r)
        #│
        #◇┐消滅する
        if not self._仕様.貫通弾区分:
        #│├┐（通常弾の場合）
            #↓
            #○格納先から削除する
            if self._上位 in self._仕様.格納先: self._仕様.格納先.remove(self._上位)
            #┴
        #│└┐（その他）
        #┴　┴