#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：タイトル画面(描画機能)
#┠─────────────────────────────────────
#┃描画コントローラが描画プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
from   main.データセット               import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 描画クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #〇画面を描画する
        pyxel.blt(0,10, 2, 0,0, 119,79, 0)  # メインタイトル
        pyxel.blt( 8,77, 0, 0,0,  50,49, 7) # 恐竜(左側)
        pyxel.blt(62,77, 0, 0,64, 50,99, 7) # 恐竜(右側)

        描画文字 = "<<TIME>>"
        縦 = 124
        pyxel.text(44, 縦  , 描画文字, 5)
        pyxel.text(44, 縦-1, 描画文字, 7)

        縦 = 132
        描画文字 = "30sec <-"
        背景色 = (8) if DS.情報.プレイ時間 == DS.仕様.プレイ時間 * 1 else (3)
        pyxel.text(28, 縦  , 描画文字, 背景色)
        pyxel.text(27, 縦-1, 描画文字, 7)

        描画文字 = "-> 1min"
        背景色 = (8) if DS.情報.プレイ時間 == DS.仕様.プレイ時間 * 2 else (3)
        pyxel.text(61, 縦  , 描画文字, 背景色)
        pyxel.text(60, 縦-1, 描画文字, 7)

        描画文字 = "<<MEMBER>>"
        縦 = 142
        pyxel.text(41, 縦, 描画文字, 5)
        pyxel.text(40, 縦, 描画文字, 7)

        縦 = 150
        for i in range(1,5):
            d = i * 15
            背景色 = (8) if i == DS.情報.人数 else (3)
            pyxel.text(17 + d, 縦, f"[%d]" % i, 背景色)
            pyxel.text(16 + d, 縦, f"[%d]" % i, 7)
