#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃変更機能→移動プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
import main.GAME共通                         as 共通処理
from   main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:

    #□人数一覧：人数選択における数字キーと人数の対応表
    人数一覧  = {
        pyxel.KEY_1: 1, # 1人同士の対戦プレイ(合計2名)
        pyxel.KEY_2: 2, # 2人同士の対戦プレイ(合計4名)
        pyxel.KEY_3: 3, # 3人同士の対戦プレイ(合計6名)
        pyxel.KEY_4: 4  # 4人同士の対戦プレイ(合計8名)
        }

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 移動クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self   ,
            引数_個体   ):  #① 個体オブジェクト
        #┬
        #○個体オブジェクトのリファレンスを用意する
        self._仕様  = 引数_個体.仕様
        self._情報  = 引数_個体.情報
        #│
        #≫データセットを用意する
        self.仕様  = 仕様クラス()
        #┴
    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬ 
        #●砂時計の向きを選択する
        self.Fn選択_砂時計の向き()
        #│
        #●選択内容をクリアする
        self.Fn選択_クリア()
        #│
        #●プレイ時間を選択する
        self.Fn選択_プレイ時間()
        #│
        #●チーム人数を選択する
        self.Fn選択_チーム人数()
        #│
        #○選択内容を調べる
        if not pyxel.btnr(pyxel.KEY_SPACE)  : return
        if self._情報.時間番号 == 0         : return
        if DS.情報.人数 == 0                : return
        #│＼（プレイ時間かチーム人数が未選択の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #○シーンの遷移を指示する
        DS.情報.遷移要否 = True
        self.Fn選択音()
        #┴
	#────────────────────────────────────
    def Fn選択_砂時計の向き(self):
        #┬ 
        #◇┐発電した電気を運搬機に供給する
        if pyxel.btnr(pyxel.KEY_UP):
        #　├┐（フレーム処理タイミングの場合）
            #↓
            #●赤を上にする
            self._情報.砂時計向き = True
            共通処理.入出力.MMP.PWM_VALUE(self._仕様.砂時計,self._仕様.最小)
            self.Fn選択音()
            #┴
        elif pyxel.btnr(pyxel.KEY_DOWN):
        #　└┐（その他）
            #↓
            #●赤を下にする
            self._情報.砂時計向き = False
            共通処理.入出力.MMP.PWM_VALUE(self._仕様.砂時計,self._仕様.最大)
            self.Fn選択音()
        #┴　┴
	#────────────────────────────────────
    def Fn選択_クリア(self):
        #┬ 
        if not pyxel.btnr(pyxel.KEY_0): return
        self._情報.時間番号 = 0
        DS.情報.プレイ時間  = 0
        DS.情報.人数        = 0
        self.Fn選択音()
        #┴
	#────────────────────────────────────
    def Fn選択_プレイ時間(self):
        #┬ 
        #◇┐発電した電気を運搬機に供給する
        if pyxel.btnr(pyxel.KEY_LEFT ):
        #　├┐（フレーム処理タイミングの場合）
            #↓
            #○時間を減らす
            増減 = (1) if self._情報.時間番号 > 0 else (0)
            self._情報.時間番号 -= 増減
            self.Fn選択音()
            #┴
        if pyxel.btnr(pyxel.KEY_RIGHT):
        #　└┐（その他）
            #↓
            #○時間を増やす
            上限 = len(self._仕様.時間一覧) - 1
            増減 = (1) if self._情報.時間番号 < 上限 else (0)
            self._情報.時間番号 += 増減
            self.Fn選択音()
        #┴　┴
	#────────────────────────────────────
    def Fn選択_チーム人数(self):
        #┬ 
        #○人数の一覧を用意する
        人数一覧 = self.仕様.人数一覧.keys()
        #│
        #◎└┐対戦人数を設定する
        for 人数 in 人数一覧:
            #│＼（一覧を走査し終えた場合）
            #│ ↓
            #│ ▼繰り返し処理を抜ける
            #│
            #◇┐有効な対戦人数で設定する
            if pyxel.btnr(人数) and 人数 in self.仕様.人数一覧:
            #　├┐（人数とキーが一致する場合）
                #↓
                #○対戦人数を設定する
                DS.情報.人数 = self.仕様.人数一覧[人数]
                self.Fn選択音()
            #　└┐（その他）
        #┴　┴　┴
	#─────────────────────────────────────
    def Fn選択音(self):
        pyxel.play( 0, 63, resume = True ) 