#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：タイトル画面(移動機能)
#┠─────────────────────────────────────
#┃更新コントローラが移動プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import  pyxel
import  time
import  main.GAME共通                   as 共通処理
from    main.データセット               import データセット as DS
from    main.オブジェクト.キャラ.発電機 import 発電機生成
from    main.オブジェクト.キャラ.運搬機 import 運搬機生成
from    ..DB                            import シーンID

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:
    #--------------------------------------------------------------------
    # カウンタ
    #--------------------------------------------------------------------
    #□持続時間  ：終了画面を持続する長さ（単位：fps）
    持続時間    = 310
    人数選択一覧  = {
        pyxel.KEY_1: 1,
        pyxel.KEY_2: 2,
        pyxel.KEY_3: 3,
        pyxel.KEY_4: 4
        }

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報クラス:
    #--------------------------------------------------------------------
    # カウンタ
    #--------------------------------------------------------------------
    #□開始時間  ：終了画面を持続するカウンタ
    開始時間            = 0
    フィールドリスト    = (0,1)
    ペダルリスト        = (None,None,None,None,None,None,None,None)

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 移動クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #W〇個体オブジェクトのリファレンスを用意する
        self.仕様  = 仕様クラス()
        self.情報  = 情報クラス()
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬ 
        if DS.情報.人数 == 0:
            人数一覧 = self.仕様.人数選択一覧.keys()
            for 人数 in 人数一覧:
                self.Fn人数選択(人数)
        #│
        if DS.情報.人数 == 0: return
        #│
        #●各種オブジェクトを生成する
        self.Fnオブジェクト生成()
        #│
        #●画面遷移をセットする
        self.Fn画面遷移()
        #┴
	#────────────────────────────────────
    def Fn人数選択(self,引数_人数):
         if pyxel.btnr(引数_人数) and 引数_人数 in self.仕様.人数選択一覧:
            DS.情報.人数 = self.仕様.人数選択一覧[引数_人数]
	#────────────────────────────────────
    def Fnオブジェクト生成(self):
        #┬ 
        #●運搬機オブジェクトを生成する
        運搬機生成(9,(2,3))
        運搬機生成(8,(0,1))
        #│
        #●発電機オブジェクトを生成する
        チーム1 = [] 
        チーム2 = [] 
        for i in range(DS.情報.人数):
            チーム1.append(i)
            チーム2.append(i + DS.情報.人数)
        発電機生成(チーム2)
        発電機生成(チーム1)
        #┴
	#────────────────────────────────────
    def Fn画面遷移(self):
        #┬ 
        #●BGMを鳴らす
#        pyxel.stop()
#        for PWMポートNo in range(2):
#            共通処理.入出力.MMP.PWM_VALUE(DS.obj.運搬機[PWMポートNo].仕様.電飾No, 4095)
#        time.sleep(7)
        #│
        #○ゲーム情報をリセットする
        DS.情報.プレイ時間  = DS.仕様.ゲーム.プレイ時間
        #│
        #○シーンを『プレイ画面』に進行する
        DS.情報.シーン = シーンID.プレイ画面
        共通処理.BGM_DFP.指定曲(1)
        time.sleep(2)
        共通処理.BGM_DFP.自動選択()
        time.sleep(3)
        #┴
