#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：タイトル画面
#┠─────────────────────────────────────
#┃常時存在するシーン(タイトル画面)オブジェクト用クラス
#┃・下位に機能クラス(移動｜描画)をもつ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from .FN移動 import 移動クラス
from .FN描画 import 描画クラス

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:

  砂時計  = 8   #サーボ番号(ジオラマの砂時計)
  最小    = 136 #下限：110～
  最大    = 616 #上限：～660

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
      #┬
      #○個体オブジェクトのリファレンスを用意する
      self.仕様  = 仕様クラス()
      #│
      #≫機能を用意する
      self.FN移動 = 移動クラス(self)
      self.FN描画 = 描画クラス()
      #┴