#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：タイトル画面
#┠─────────────────────────────────────
#┃常時存在するシーン(タイトル画面)オブジェクト用クラス
#┃・下位に機能クラス(移動｜描画)をもつ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import データセット as DS
from .FN移動           import 移動クラス
from .FN表現           import 表現クラス
from .FN遷移           import 遷移クラス

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:

    砂時計  = 5   #サーボ番号(ジオラマの砂時計)
    最小    = 136 #下限：110～
    最大    = 616 #上限：～660

    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #□時間一覧
        self.時間一覧  = {
            0: ("-----", 0                     ), # 未選択
            1: ("30sec", DS.仕様.プレイ時間 * 1), # 30秒
            2: ("1min ", DS.仕様.プレイ時間 * 2), # 1分：30秒 x 2
            3: ("2min ", DS.仕様.プレイ時間 * 4), # 2分：30秒 x 4
            4: ("3min ", DS.仕様.プレイ時間 * 6)  # 3分：30秒 x 6
            }

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報クラス:

    砂時計向き = True # 砂時計の向き(True:上向き, False:下向き)
    時間番号   = 0

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #○個体オブジェクトのリファレンスを用意する
        self.仕様  = 仕様クラス()
        self.情報  = 情報クラス()
        #│
        #≫機能を用意する
        self.FN移動 = 移動クラス(self)
        self.FN表現 = 表現クラス(self)
        self.FN遷移 = 遷移クラス(self)
        #┴