#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能→遷移プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import データセット as DS
from ..DB              import シーンID
from main.共通部品     import カモロボ

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass
    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        self.Fnゲーム情報を初期化()
        self.Fnオブジェクトを初期化()
        self.Fn立体物を初期化()
        #┴
	#─────────────────────────────────────
    def Fnゲーム情報を初期化(self):
        #┬ 
        #○シーンを『終了画面』に遷移する
        #○BGMの再生時間を初期化する
        DS.情報.シーン = シーンID.終了画面
        DS.情報.再生時間 = 0
        #┴
	#─────────────────────────────────────
    def Fnオブジェクトを初期化(self):
        pass
	#────────────────────────────────────
    def Fn立体物を初期化(self):
        #┬ 
        #●発電機(モータと電飾)を停止する
        カモロボ.電飾制御(False)  
        #┴
