#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン(プレイ画面)
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [要素クラス]
from .FN動作 import 本体 as 動作機能の生成
from .FN表現 import 本体 as 表現機能の生成
from .FN遷移 import 本体 as 遷移機能の生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫データセットを用意する
        self.仕様  = 仕様()
        self.情報  = 情報()
        #│
        #≫プロセス機能を用意する
        self.FN動作 = 動作機能の生成(self)
        self.FN表現 = 表現機能の生成(self)
        self.FN遷移 = 遷移機能の生成(self)
        #┴