// filename : adp.h
//========================================================
// アダプタ共通
//--------------------------------------------------------
// Ver 2.0.a (2026/09/01) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■rduinoシステム
  #include <Arduino.h>
  #include <queue>
  #include <mutex>
  //│
  //■ＭＭＰシステム
  #include "../common/stream.h"
  //┴
//┴

//========================================================
// アダプタ
//========================================================
  //【通信アダプタ：ＵＡＲＴ】
  namespace adpUART{
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //【通信アダプタ：Ｉ２Ｃ】
  namespace adpI2C{
    void START()  ; // サービス開始の指示
    void HANDLE() ; // ポーリングのハンドル
  }

  //========================================================
// アダプタのトリガ
//========================================================
  void INIT_ADAPTER(); // 初期化
  void KICK_HANDLE() ; // ハンドルをキック