// filename : adp.cpp
//========================================================
// アダプタ共通：アダプタ全体のライフサイクルを統括する
//--------------------------------------------------------
// Ver 2.0.a (2026/09/01) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■ＭＭＰシステム
  #include "adp.h"  // 通信アダプタ共通へ公開
  //┴
//┴

//========================================================
// アダプタの初期化
//========================================================
  void INIT_ADAPTER() {
    //┬
    //○開始表示
    Serial.println("<<アダプタの初期化>>");
    //│
    //●通信アダプタを初期化
    adpUART::START();
    adpI2C::START();
    //│
    //○終了表示
    Serial.println("");
    //┴
  } /* INIT_ADAPTER() */



//========================================================
// アダプタ起動のポーリング用ハンドル
//========================================================
  void KICK_HANDLE(){
    //┬
    //●ハンドルをキック
    adpUART::HANDLE();
    adpI2C ::HANDLE();
    //┴
  } /* KICK_HANDLE() */