// filename : dev.cpp
//========================================================
// デバイスの初期化
//--------------------------------------------------------
// Ver 2.0.a (2026/09/01) 
// ・EPS-NOWのプリプロセッサ条件を追加
//========================================================
//┬
//■┐インクルード
  //■Arduinoシステム
  //│
  //■ＭＭＰシステム
  #include "dev.h"
//┴

//########################################################
//# 専用の名前空間
//########################################################
void INIT_DEVICE() {
  //┬
  //○開始表示
  // ➡【初期化順序制約】
  //    ログ出力機能が未起動のため、
  //    Serial初期化完了後にdevUART::START()内で通知する
  //│
  //●通信デバイスを初期化（UART）
  devUART ::START();
  //│
  //○終了表示
  // ➡【初期化順序制約】
  //    ログ出力機能が未起動のため、
  //    Serial初期化完了後にdevNetwork::start()内で通知する
  //┴
} /* INIT_DEVICE() */