// filename : devUART.cpp
//========================================================
// 通信デバイス初期化：ＵＡＲＴ
//--------------------------------------------------------
// Ver 2.0.a (2026/09/01) 
//========================================================
#pragma once
#include <Arduino.h>

//########################################################
//# 専用名の前空間
//########################################################
namespace devUART {
//========================================================
// 基本情報
//========================================================
  bool ENABLED = false; // 有効判定：有効：true、無効：false

//========================================================
// メイン処理
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //----------------------------------
  // 戻り値：処理結果（論理値）
  // ・true ：失敗
  // ・false：成功
  //━━━━━━━━━━━━━━━━━
  void START(){
    
    // UARTポートを起動
    Serial.begin(115200);                      // USB(CDC)
    Serial.setDebugOutput(false);              // SDKデバッグ出力を抑止

    Serial1.begin(921600, SERIAL_8N1, 44, 43); // サブ１用
//    Serial2.begin(921600, SERIAL_8N1, 46, 45); // サブ２用
//    Serial3.begin(921600, SERIAL_8N1, 48, 47); // サブ３用
//    Serial4.begin(921600, SERIAL_8N1, 50, 49); // サブ４用
    
    // 起動メッセージを表示
    delay(3000); // 安定するまで待つ
    Serial.println("<<通信デバイスの初期化>>");
    Serial.println(" [Serial device]"  );
    Serial.println("　 [OK] USB (CDC)");
    Serial.println("　 [OK] UART(#01)");
    Serial.println("　 [OK] UART(#02)");
    Serial.println("　 [OK] UART(#03)");
    Serial.println("　 [OK] UART(#04)");

    //○有効性セット
    ENABLED = true;
  } /* START() */
} /* namespace devUART */