// filename : SUB4.ino
//========================================================
//  MMP Firmware
//--------------------------------------------------------
// - ボード情報      : Waveshare ESP32-S3-tiny用
// - ボート          : ESP32S3 Dev Module
// - USB CDC ON Boot : Enabled
// - Flash Size      : 4MB (32Mb)
// - Patition Scheme : Huge APP(3MB No OTA/1MB SPIFFS)
//--------------------------------------------------------
// Ver 2.0.a (2026/09/01) 
//========================================================
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Wire.h> // setup()
  //│
  //■ＭＭＰシステム
  #include "dev.h"  // setup()
  #include "adp.h"  // setup(), loop()
  //┴
//┴

//========================================================
// セットアップ
//========================================================
void setup(){
  //┬
  //○通信デバイスを初期化
  INIT_DEVICE();
  //│
  //○アダプタを初期化
  INIT_ADAPTER();
  //│
  //○開始メッセージ出力
  Serial.println("---------------------------");
  Serial.println(" Ver.2.0.a"                 );
  Serial.println("---------------------------");
  //┴
} /* setup() */

//========================================================
// ポーリング
//========================================================
void loop(){
  //┬
  //○各アダプタのハンドルをキック
  KICK_HANDLE();
  //┴
} /* loop() */