#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃変更機能→動作プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import main.GAME共通                         as 共通処理
from   main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self   ,
            引数_個体   ):   #① 個体オブジェクト
        #┬
        #○個体オブジェクトのリファレンスを用意する
        self._仕様  = 引数_個体.仕様
        self._情報  = 引数_個体.情報
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #○姿勢を『通常』に仮設定する
        self._情報.姿勢 = self._仕様.通常
        #│
        #●屈伸の態勢かを調べる
        self.Fn屈伸態勢の判定()
        #│
        #●着地の態勢かを調べる
        self.Fn着地態勢の判定()
        #┴
	#────────────────────────────────────    
    def Fn屈伸態勢の判定(self):
        #┬
        #○屈伸するかを調べる
        閾値 = DS.ハード.スイッチ閾値
        屈伸 = (共通処理.入出力.MMP.mmpAnaVal[0][0]  < 閾値) # 脚あげ(SW=OFF)
        左手 = (共通処理.入出力.MMP.mmpAnaVal[0][1]  > 閾値) # 握る(SW=ON)
        右手 = (共通処理.入出力.MMP.mmpAnaVal[0][2]  > 閾値) # 握る(SW=ON)
        判定   = 屈伸 and 左手 and 右手  # 脚を上げて両手を握る
        #│
        #●姿勢を『屈伸』にする
        if  判定: self._情報.姿勢 = self._仕様.屈伸
        #┴
	#────────────────────────────────────    
    def Fn着地態勢の判定(self):
        #┬
        #○着地するかを調べる
        閾値 = DS.ハード.スイッチ閾値
        左手 = (共通処理.入出力.MMP.mmpAnaVal[0][1]  < 閾値) # 離す(SW=OFF)
        右手 = (共通処理.入出力.MMP.mmpAnaVal[0][2]  < 閾値) # 離す(SW=OFF)
        判定   = 左手 and 右手 # 両手を離す
        #│
        #●姿勢を『着地』にする
        if  判定: self._情報.姿勢 = self._仕様.着地
        #┴
