#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ：選手(屈伸プロセス)
#┠─────────────────────────────────────
#┃更新コントローラが衝突プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import main.GAME共通 as 共通処理

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 移動クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass

    #┌───────────────────────────────────
    #│機能実行
    #├───────────────────────────────────
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●足を運動する(SW-ON:足仕上げ／OFF:足まっすぐ)
        ポートNo = 0
        結果     = 共通処理.入出力.入力走査(ポートNo)
        PWM値    = (4095) if 結果[0] else (-1)
        共通処理.入出力.MMP.PWM_VALUE(ポートNo, PWM値)
        #│
        #●手を運動する
        ポートNo = 1
        結果 = 共通処理.入出力.入力走査(ポートNo)
        PWM値    = (-1) if 結果[0] else (4095)
        共通処理.入出力.MMP.PWM_VALUE(ポートNo, PWM値)
