#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ：選手(屈伸プロセス)
#┠─────────────────────────────────────
#┃更新コントローラが衝突プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import main.GAME共通                         as 共通処理
from   main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
        PWM_Ch_脚屈伸 = 0
        PWM_Ch_手放し = 1

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 移動クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self   ,
            引数_個体   ):   #① 個体オブジェクト
        #┬
        #〇個体オブジェクトのリファレンスを用意する
        self._情報  = 引数_個体.情報
        #│
        #≫データセットを用意する
        self.仕様   = 仕様クラス()
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●選手の脚を運動する(SW-OFF:脚仕上げ／ON:脚まっすぐ)
        入力値 = 共通処理.入出力.MMP.mmpAnaVal[0][0]  # Port:0/Ch:0
        判定   = (入力値 > DS.仕様.スイッチ閾値)
        self._情報.姿勢 = (0) if 判定 else (1)
        PWM値  = (DS.仕様.モータ最小) if 判定 else (DS.仕様.モータ最大)
        PWM_No = self.仕様.PWM_Ch_脚屈伸
        共通処理.入出力.MMP.PWM_VALUE(PWM_No, PWM値)
        #│
        #●選手の手を運動する(SW-ON:鉄棒を掴む／OFF:鉄棒を離す)
        入力値 = 共通処理.入出力.MMP.mmpAnaVal[0][1]  # Port:0/Ch:1
        判定   = (入力値 < DS.仕様.スイッチ閾値)
        PWM値  = (DS.仕様.サーボ最小) if 判定 else (DS.仕様.サーボ最大)
        PWM_No = self.仕様.PWM_Ch_手放し
        共通処理.入出力.MMP.PWM_VALUE(PWM_No, PWM値)
        #┴
