#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ：選手
#┠─────────────────────────────────────
#┃選手 オブジェクト用クラス
#┃・下位にデータセット･クラス(仕様｜情報)を持つ
#┃・下位に機能クラス(移動｜衝突｜発射｜描画)をもつ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from .FN移動 import 移動クラス
from .FN描画 import 描画クラス

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫機能を用意する
        self.FN移動 = 移動クラス()
        self.FN描画 = 描画クラス()
        #┴