#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ：選手
#┠─────────────────────────────────────
#┃選手 オブジェクト用クラス
#┃・下位にデータセット･クラス(仕様｜情報)を持つ
#┃・下位に機能クラス(移動｜衝突｜発射｜描画)をもつ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from .FN移動 import 移動クラス
from .FN描画 import 描画クラス

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報クラス:

    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #□姿勢(0:まっすく／1:屈伸)
        self.姿勢 = 0

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫データセットを用意する
        self.情報   = 情報クラス()
        #│
        #≫機能を用意する
        self.FN移動 = 移動クラス(self)
        self.FN描画 = 描画クラス(self)
        #┴