#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能(遷移プロセス)のアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [システム共通]
import time
import pyxel

# [アプリ共通]
import sys; sys.path.append('..'); import 共通.音声

# [ゲーム共通]
import main.共通部品 as 共通部品
from main.データセット import DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報:
    pass

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self, 引数_上位): #① 上位のコンポジットクラス
        #┬
        #○データセット(コンポジット)のリファレンスを用意する
        self._仕様 = 引数_上位.仕様
        self._情報 = 引数_上位.情報
        #│
        #≫データセットを用意する
        self.仕様  = 仕様()
        self.情報  = 情報()
        #┴

    #┌───────────────────────────────────
    #│プロセス機能を実行
    #└───────────────────────────────────
    def 実行(self):
        #┬ 
        #●ゲーム情報を初期化する
        #●オブジェクトを初期化する
        #●物理体を初期化する
        #●音声を再生する
        self.Fnゲーム情報を初期化()
        self.Fnオブジェクトを初期化()
        self.Fn物理体を初期化()
        self.Fn音声を再生()
        #┴
	#─────────────────────────────────────
    def Fnゲーム情報を初期化(self):
        #┬ 
        #○シーンを『タイトル画面』に遷移する
        DS.情報.シーン = DS.仕様.シーンID.タイトル画面
        #│
        #○プレイ時間を初期化する
        DS.情報.プレイ時間 = 0
        #│
        #○画面モードを『ドット絵』にする。
        pyxel.screen_mode(0)
        #┴ 
	#─────────────────────────────────────
    def Fnオブジェクトを初期化(self):
        #┬ 
        #●選手をパージする
        DS.obj.選手 = None
        #┴
	#────────────────────────────────────
    def Fn物理体を初期化(self):
        #┬ 
        #●すべて停止する
        共通部品.停止()
        #┴
	#────────────────────────────────────
    def Fn音声を再生(self):
        #┬
        #●BGMを切替える
        共通.音声.自動再生(DS.情報.シーン, DS.情報.シーン, 引数_停止 = True)
        time.sleep(0.5)
        #┴