// filename : adapter/_member_.h
//========================================================
// コマンド部門／メンバー：機能モジュール
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#pragma once
//┬
//■┐インクルード
  //■在籍一覧
  #include "_api_.h"   // <<抽象基底クラス>>
  #include "system.h"  // システム管理
  #include "analog.h"  // アナログ入力
  #include "digital.h" // デジタル入出力
  #include "pwm.h"     // PWM出力
  #include "IIC.h"     // IIC通信
  #include "mp3.h"     // MP3プレイヤー
  //┴
//┴