#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ：運搬機(救出プロセス)
#┠─────────────────────────────────────
#┃更新コントローラが移動プロセスで実行するアクション・メソッド
#┃・下位にデータセット･クラス(仕様)を持つ
#┃※画面外に移動した際、オブジェクトを削除する
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import データセット as DS
import  main.GAME共通                   as 共通処理

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:
    def __init__(self):
        #┬
        self.ピンNo   = (0,1)   # HC4069のANA-INチャンネルNo
        self.待ち時間 = 20      # 単位：フレーム
        self.通過閾値 = 200     # 単位：センサー値
        #┴

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報クラス:
    def __init__(self):
        #┬
        self.待ち時間 = [0,0]
        #┴

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 救出クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self, 引数_個体): #① 個体の仕様
        #┬
        #〇個体オブジェクトのリファレンスを用意する
        self._個体  = 引数_個体
        self._仕様  = 引数_個体.仕様
        self._情報  = 引数_個体.情報
        #│
        #≫データセットを用意する
        self.仕様   = 仕様クラス()
        self.情報   = 情報クラス()
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        MMP = 共通処理.入出力.MMP

        #●スキャンする
        ポート番号 = self._仕様.ポート番号
        共通処理.入出力.MMP.analog_IN_Each(ポート番号)
        #│
        #●スキャンする
        for 各装置No in range(2):
            #│
            #●スキャン可否を確認する
            if self.Fn可否確認(各装置No): continue
            #│＼（『発射不可』の場合）
            #│ ↓
            #│ ▼次のChを走査する
            #│
            #○センサ値を確認する
            センサ値 = 共通処理.入出力.MMP.mmpAnaVal[ポート番号][各装置No]
            if センサ値 < self.仕様.通過閾値: continue
            #│＼（『通過なし』の場合）
            #│ ↓
            #│ ▼次のChを走査する
            #│
            #●救出数を増やす
            #●待ちタイマーセット
            self._情報.救出数 += 1
            self.情報.待ち時間[各装置No] = self.仕様.待ち時間
            #┴

    #┌───────────────────────────────────
    #│スキャン可否確認
    #└───────────────────────────────────
    def Fn可否確認(self,引数_Ch): #【戻り値】 True:不許可／False：許可
        #┬
        #◇┐仕様可否を判定する
        if self.情報.待ち時間[引数_Ch] > 0:
        #　├┐（待ち時間がある場合）
            #↓
            #○経過時間をカウントする
            #▼『不可能』を返す
            self.情報.待ち時間[引数_Ch] -= 1
            return True

        else:
        #　└┐（その他）
            #↓
            #▼『可能』を返す
            return False