#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクター：運搬機
#┠─────────────────────────────────────
#┃敵機・アイテムで利用する機体オブジェクト用クラス
#┃・下位にデータセット･クラス(仕様｜情報)を持つ
#┃・下位に機能クラス(移動｜衝突｜発射｜描画)をもつ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット  import データセット as DS
from .FN移動            import 移動クラス
from .FN救出            import 救出クラス

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:
    def __init__(self,引数_ポートNo):

        self.ポートNo   = 引数_ポートNo

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報クラス:
    def __init__(self):

        self.稼働中 = False
        self.出力   = 0
        self.救出数 = 0

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    def __init__(self,引数_ポートNo):
        #┬
        #≫データセットを用意する
        self.仕様 = 仕様クラス(引数_ポートNo)
        self.情報 = 情報クラス()
        #│
        #≫処理セットを用意する
        self.FN移動 = 移動クラス(self)
        self.FN救出 = 救出クラス(self)
        #│
        #○用意済みのインスタンスに生成する
        DS.obj.運搬機.insert(0,self)
        #┴