// filename : Dep_Connect/adapter/base/UART_TURBO.cpp
//========================================================
// 接続部門／業務課／担当(標準型)：UART(高速版) 担当
//--------------------------------------------------------
// Ver 1.3.2 (2026/09/14)
// ・新規
//========================================================

//========================================================
// 組織図
//========================================================
//┬
//□┐接続部門
  //□┐業務課
    //□担当
    #include "_index_.h"
//┴┴┴

//########################################################
//# 処理詳細
//########################################################
class AdapterUART : public AdapterBase {
public:
  //━━━━━━━━━━━━━━━━━
  // 抽象基底クラスからコンテクストを継承
  //━━━━━━━━━━━━━━━━━
  using AdapterBase::AdapterBase;

private:
//========================================================
// アダプタの基本
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 一般情報
  //━━━━━━━━━━━━━━━━━
    const int ADP_ID = ADP_ID_UART;

//========================================================
// レスポンス
//========================================================
  //━━━━━━━━━━━━━━━━━
  // クライアントにレスポンス
  //━━━━━━━━━━━━━━━━━
  void SEND_CONN() {
    //┬
    //○クライアントにレスポンス
    Serial1.print(ctx.resMSG);
    //│
    //●ログ出力
    adpFnBase::SHOW_LOG();
    //┴
  } /* SEND_CONN() */

//========================================================
// 担務（公開機能）
//========================================================
public:
  //━━━━━━━━━━━━━━━━━
  // コンストラクタ
  //━━━━━━━━━━━━━━━━━
  AdapterUART(MmpContext& argCtx) : AdapterBase(argCtx) {
    //┬
    //○メッセージ表示
    Serial.println(" [OK] UART Hi-Speed (PORT=[1])");
    //┴
  } /* constractor AdapterUART() */


//############################
//# ステータス制御はブリッジのみ
//############################
#if (MODE == MODE_BRIDGE)
  //━━━━━━━━━━━━━━━━━
  // ポーリングの前処理
  //━━━━━━━━━━━━━━━━━
  bool handle_Begin() override {
    //┬
    //◇ブリッジマスタとして進行を制御
    switch (ctx.bridge.Stat) {
      case BSTAT::IDLE: return false; // 待機中：進行OK
      case BSTAT::REQ : return true ; // 依頼中：進行NG
      case BSTAT::BUSY: return true ; // 処理中：進行NG
      case BSTAT::DONE:               // 処理済：進行OK
        //○コンテクストにレスポンス内容をセット
        //●ブリッジ元にレスポンス
        //○進行状況を［待機中］にセット
        //▼終了：早期リターン（進行OK）
        ctx.resMSG = ctx.strFrame;
        SEND_CONN();
        ctx.bridge.Stat = BSTAT::IDLE;
        return false;
    } /* END-switch */
    return true; // 想定外：進行NG
  } /* handle_Begin() */
#endif
//############################


  //━━━━━━━━━━━━━━━━━
  // ポーリング用ハンドラ
  //━━━━━━━━━━━━━━━━━
  void handle() override {
    //┬
    //●前処理
    if (handle_Begin()) return;
    //│＼（進行NGの場合）
    //│ ▼終了：早期リターン
    //│
    //○受信の有無を確認
    if (!Serial1.available()) return;
    //│＼（受信がない場合）
    //│ ▼終了：早期リターン
    //│
    //◎┐受信データを取込
    String strRX = "";
    while (!strRX.endsWith("!")) {
      //│＼（終端に達した場合）
      //│ ▽完了：走査終了
      //│
      //○受信データを受信バッファに加える
      if (Serial1.available()) strRX += (char)Serial1.read();
      //┴
    } /* END-while */
    //│
    //●コンテキストを初期化
    adpFnBase::SETUP_CTX(ADP_ID, strRX);
    //│
    //●コマンドを実行
//--------------------------
//【メイン】主処理を実行
//--------------------------
#if   (MODE == MODE_MAIN)
    modeMain::RUN();
//--------------------------
//【サブ】主処理を実行
//--------------------------
#elif (MODE == MODE_SUB)
    modeSub::RUN();
//--------------------------
//【ブリッジ】対象外
//--------------------------
#endif
    //│
    //●実行結果をレスポンス
    SEND_CONN();
    //┴
} /* handle() */

}; /* class AdapterUART */