#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：変更
#┠─────────────────────────────────────
#┃移動プロセス➡救出プロセスの順に実行する
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import main.GAME共通      as 共通処理
from   .P動作 import 本体 as 動作プロセスの生成
from   .P救出 import 本体 as 救出プロセスの生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫プロセスを用意する
        self.P移動 = 動作プロセスの生成()
        self.P救出 = 救出プロセスの生成()
        #┴
	#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
	#┃機能をコントロール
	#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
    def 実行(self):
        #┬
        #●アナログ値を読み取る
        共通処理.入出力.MMP.アナログ読取()
        #│
        #●ＢＧＭを繰返し再生する
        共通処理.BGM_DFP.繰返し再生()
        #│
        #●プロセスを実行する
        self.P移動.実行()
        self.P救出.実行()
        #┴
