#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃変更機能→移動プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット        import データセット as DS
from main.オブジェクト.シーン import DB

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセス実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●キャラクタを移動する
        self.Fnキャラクタ移動()
        #│
        #●シーンを移動する
        DS.obj.シーン[DS.情報.シーン].FN移動.実行()
        #┴ 
#┌───────────────────────────────────
#│アクション・メソッド実行
#└──────────────────────────う─────────
    def Fnキャラクタ移動(self):
        #┬
        #○シーンを確認する
        if DS.情報.シーン != DB.シーンID.プレイ画面: return
        #│＼（プレイ画面以外の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #◎└┐すべてのチームを移動する
        for チームNo in range(2):
            #│＼（すべてのチームを走査した場合）
            #│ ↓
            #│ ▼繰り返し処理を抜ける
            #│
            #○オブジェクトをリファレンス化する
            発電機 = DS.obj.発電機[チームNo]
            運搬機 = DS.obj.運搬機[チームNo]
            #│
            #≫アクション・メソッドでオブジェクト(発電機)を状態移動する
            発電機.FN移動.実行()
            #│
            #◇┐運搬機を動かす
            if DS.情報.プレイ時間 % 4 == 0: 運搬機.FN移動.実行()
            #　├┐（フレーム処理タイミングの場合）
                #↓
                #≫アクション・メソッドでオブジェクト(運搬機)を状態移動する
                #┴
            #　└┐（その他）
                #┴
            #│
            #◇┐発電した電気を運搬機に供給する
            if DS.情報.プレイ時間 % 30 == 0:
            #　├┐（フレーム処理タイミングの場合）
                #↓
                #○運搬機に電力を送電する
                電力 = 発電機.情報.蓄電量
                電力 = int(電力 / DS.情報.人数)
                発電機.情報.蓄電量    = 0
                運搬機.情報.入力電力 += 電力
                #│
                #≫アクション・メソッドでオブジェクト(運搬機)を移動する
                運搬機.FN移動.実行()
                #┴
            #　└┐（その他）
        #┴　┴　┴