#======================================================
# Mech01_Bullets.py
#======================================================
from 共通ユーティリティ import (
    通信接続,
    通信切断,
    アナログ入力測定,
    MP3_再生
    )

#======================================================
def テスト実行():

    print("#####################")
    print("#                   #")
    print("#  01:MECH BULLETS  #")
    print("#                   #")
    print("#####################")

    try:
        通信接続()

        print("--------------")
        print("JoyPad(ANA-IN)")
        print("--------------")
        アナログ入力測定(
            スイッチ数  = 4     , # JoyPadの縦,横,ボタンx2の計4個
            参加人数    = 1     , # 1～3人
            丸め        = 100   , # アナログ値の丸め
            繰返回数    = 100   , # アドレス切替回数
            待時間      = 0.05  , # ウェイト(秒)
        )

        print("--------")
        print("BGM(MP3)")
        print("--------")
        MP3_再生(
            arg再生一覧 = [
                (1,  1),  # メインBGM：タイトル画面
                (1,101),  # メインBGM：プレイ画面：ザコキャラ
                (1,217),  # メインBGM：プレイ画面：ボスキャラ
                (1,  3)   # メインBGM：終了画面
                ]
            )

    finally:
        通信切断()
        
