#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃変更機能→動作プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
from   ...データセット import データセット as DS
from   ...汎用部品     import 音声

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:

    #□標的数選択一覧：標的数選択におけるキーと標的数の対応表
    標的数選択一覧  = {
            pyxel.KEY_1: 1, # 1羽同志の対戦プレイ(合計2羽)
            pyxel.KEY_2: 2, # 2羽同士の対戦プレイ(合計4羽)
            pyxel.KEY_3: 3, # 3羽同士の対戦プレイ(合計6羽)
            pyxel.KEY_4: 4  # 4羽同士の対戦プレイ(合計8羽)
            }

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #W〇個体オブジェクトのリファレンスを用意する
        self.仕様  = 仕様クラス()
        #┴

    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬ 
        #●標的数を選択する
        self.Fn選択_標的数()
        #│
        #○選択内容を調べる
        if DS.情報.標的数 == 0: return
        #│＼（標的数が未選択の場合）
        #│ ↓
        #│ ▼処理を中断する
        #│
        #○シーンの遷移を指示する
        DS.情報.遷移要否 = True
        #│
        #○選択音を鳴らす
        音声.クリック音()
        #┴
	#────────────────────────────────────
    def Fn選択_標的数(self):
        #┬ 
        #○標的数の一覧を用意する
        標的数一覧 = self.仕様.標的数選択一覧.keys()
        #│
        #◎└┐対戦標的数を設定する
        for 標的数 in 標的数一覧:
            #◇┐有効な標的数で設定する
            if pyxel.btnr(標的数) and 標的数 in self.仕様.標的数選択一覧:
            #　├┐（標的数とキーが一致する場合）
                #↓
                #○対戦標的数を設定する
                DS.情報.標的数 = self.仕様.標的数選択一覧[標的数]
            #　└┐（その他）
        #┴　┴　┴
