#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能→遷移プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import time
import sys; sys.path.append('..'); import 共通.音声
from   ...データセット          import データセット as DS
from   ...                      import 共通部品
from   ...オブジェクト.カモロボ import カモロボの生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass
    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬ 
        #●ゲーム情報を初期化する
        #●オブジェクトを初期化する
        #●立体物を初期化する
        #●音声を再生する
        self.Fnゲーム情報を初期化()
        self.Fnオブジェクトを初期化()
        self.Fn立体物を初期化()
        self.Fn音声を再生()
        #┴
	#─────────────────────────────────────
    def Fnゲーム情報を初期化(self):
        #┬ 
        #○シーンを『プレイ画面』に遷移する
        DS.情報.シーン = DS.仕様.シーンID.プレイ画面
        #│
        #○プレイ時間を初期化する
        #○得点を初期化する
        DS.情報.プレイ時間 = DS.仕様.プレイ時間
        DS.情報.得点=[0,0]
        #┴
	#─────────────────────────────────────
    def Fnオブジェクトを初期化(self):
        #┬ 
        #○各チームのポート一覧(MMPポート番号)を設定する
        チーム1 = list(range(DS.情報.標的数, (DS.情報.標的数 + DS.情報.標的数)))
        チーム0 = list(range(DS.情報.標的数))
        #│
        #●各チームのカモロボをオブジェクト化する
        カモロボの生成(1,チーム1)
        カモロボの生成(0,チーム0)
        #┴
	#────────────────────────────────────
    def Fn立体物を初期化(self):
        #┬ 
        #●カムロボの電源をOFFにする
        共通部品.電飾制御(False)
        time.sleep(1)
        #│
        #●カムロボの電源をONにする
        共通部品.電飾制御(True)  
        #┴
	#────────────────────────────────────
    def Fn音声を再生(self):
        #┬
        #●BGMを切替える
        共通.音声.自動再生(DS.情報.シーン, DS.仕様.BGM一覧)
        time.sleep(2)
        #┴