#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：タイトル画面
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from .FN動作 import 本体 as 動作機能の生成
from .FN表現 import 本体 as 表現機能の生成
from .FN遷移 import 本体 as 遷移機能の生成

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        #┬
        #≫機能を用意する
        self.FN動作 = 動作機能の生成()
        self.FN表現 = 表現機能の生成()
        self.FN遷移 = 遷移機能の生成()
        #┴