// filename : Dep_Connect/adapter/BLE/BLE.cpp
//========================================================
// 接続部門／担当：BLE（ベース）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/29)
//========================================================

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス【非同期キュー型】
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class  AD_BLE : // 接続識別子：uint8_t
public AD_API_Queue<uint8_t> // 非同期キュー型
{
private:
//========================================================
//§基本情報
//========================================================
  static AD_BLE* MY_TASK; // タスク識別(インスタンス)

//========================================================
//§モード別実装のインクルード
//========================================================
#if (MODE == MODE_BRIDGE)
  #include "BLE_Bridge.cpp"
#else
  #include "BLE_MainSub.cpp"
#endif

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // コンストラクタ【非同期キュー型】
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  AD_BLE(   MmpContext& argCtx) : // 接続識別子：uint8_t
  AD_API<      uint8_t>(argCtx, AID::BLE), // 基本型
  AD_API_Queue<uint8_t>(argCtx, AID::BLE)  // 非同期キュー型
  {
    //┬
    //●モード別コンストラクタを実施する
    //●起動ログMSGを表示する
    String retMsg = CONSTRACT();
    Log::prtln(retMsg);
    //┴
  } /* constractor AD_BLE() */

}; /* class AD_BLE */

//========================================================
//§インスタンス管理
//========================================================
AD_BLE* AD_BLE::MY_TASK = nullptr;