// filename : Dep_Connect/adapter/UART/UART_Bridge_Base.cpp
//========================================================
// 接続部門／担当：UART 高速型（ブリッジモード：基本）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/30)
//========================================================

//========================================================
//§ハンドルの事前処理と進行判定
//========================================================
  //───────────────────────────
  // ブリッジ用：マスタ
  // ※既定クラスはスレーブ用なのでマスタ用に再実装する
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  bool SETUP_BRIDGE() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //●マスタの前処理を実施する...進行判定を得る
    bool retGo = modeBridge::MASTER(
  //──────────────────
  //➡ハイスピード型
  #if TURBO
  //------------------------------------
      CONN,                     // 単一スロット
  //──────────────────
  //➡標準型
  #else
  //------------------------------------
      TBL[ctx.trans.SID].CONN,  // 複数スロット
  //------------------------------------
  #endif //➡ハイスピード型｜➡標準型
  //──────────────────
      [this](Stream* conn){SEND_RESULT(conn);} // 返信処理(関数をラムダ式で包む)
  
    );
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了(進行判定)
    return retGo;
  //┴
  } /* SETUP_BRIDGE() */

  //───────────────────────────
  // ブリッジ用(詳細)：マスタ
  //───────────────────────────
  void BRIDGE_PROCESS() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //●ブリッジ処理を実行→ctx.trans.*に退避される
      modeBridge::RUN();
    //│
    //◇┐[処理結果]に応じて処理を分岐する    
      if (ctx.base.Result == "") {
      //├┐（処理結果が[後続処理あり]の場合）
        //●進行状況を[依頼中]に進捗する
        modeBridge::MOVE_BSTAT(BSTAT::REQ, "");
        //┴
      } else {
      //└┐（その他）※即時応答の場合
        //●接続元に処理結果を送信する
    //──────────────────
    //➡ハイスピード型
    #if TURBO
    //------------------------------------
        this->SEND_RESULT(CONN);                    // 単一スロット
    //──────────────────
    //➡標準型
    #else
    //------------------------------------
        this->SEND_RESULT(TBL[ctx.base.SID].CONN); // 複数スロット
    //------------------------------------
    #endif //➡ハイスピード型
    //──────────────────
        //┴
      } //～if
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* BRIDGE_PROCESS() */