// filename : Dep_Connect/adapter/UART/UART_MainSub.cpp
//========================================================
// 接続部門／担当：UART（メインモード・サブモード）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/28)
//========================================================

//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 開始処理：コンストラクタ
  //───────────────────────────
  String CONSTRACT() {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //○接続管理TBLを作成する
    SLOTs = 3;
    TBL = new T_SLOT[SLOTs];
    //│
    //●接続スロットを作成する
    SLOT_SET(0, &Serial ); // クライアント用(USB CDC)
    SLOT_SET(1, &Serial1); // メイン：サブ連携用｜ブリッジ：クライアント用(GPIO)
    SLOT_SET(2, &Serial2); // クライアント用(GPIO)
    //┴
  //│
  //○┐【後処理】
    //▼：返却：起動ログ表示のMSG
    return String(" [OK] UART / USB(CDC) + Serial#1,2");
  //┴
  } /* CONSTRACT() */

