// filename : Dep_Connect/adapter/UART/UART.cpp
//========================================================
// 接続部門／担当：UART（ベース）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/28)
//========================================================

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス【非同期キュー型＋スロット型】
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class  AD_UART: // 接続識別子：Stream*
public AD_API_Queue<Stream*>, // 非同期キュー型
public AD_API_Slot< Stream*>  // 接続スロット型
{
private:
//========================================================
//§最終処理
//========================================================
  //───────────────────────────
  // 接続元にMSGをレスポンスする
  // ※マスタではベース側に実装する。
  //───────────────────────────
  void SEND_CONN(Stream* argConn) override final {
    //┬
    //○接続元宛にメッセージを送信する
    //●ログを出力する
    argConn->print(ctx.base.Msg);
    adpFnBase::SHOW_LOG();
    //┴
  } /* SEND_CONN() */

//========================================================
//§受信処理
//========================================================
  //───────────────────────────
  // 並列処理の内容を定義
  //───────────────────────────
  void ON_RECIVE() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //◎┐データ受信したスロットをキュー登録する
    for (int qSID = 0; qSID < SLOTs; qSID++) {
      //│＼（全スロットを走査し終えた場合）
      //│ ▼完了：走査を終える
      //│
      //○┐キュー登録に必要な情報を用意する
        //●フレーム求める
        String qFrame = adpFnStream::GET_FRAME(*(TBL[qSID].CONN));
        if (qFrame != "") continue;
        //│＼（受信データがない場合）
        //│ ▽次へ：次のスロットの走査へ進む
        //┴
      //│
      //●キューを登録する
       pushQueue(TBL[qSID].CONN, qFrame, qSID);
      //┴
    } //～for
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* ON_RECIVE() */

//========================================================
//§ モード別実装のインクルード
//========================================================
#if (MODE == MODE_BRIDGE)
  #include "UART_Bridge.cpp"
#else
  #include "UART_MainSub.cpp"
#endif

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // コンストラクタ【非同期キュー型＋スロット型】
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  AD_UART(  MmpContext& argCtx) : // 接続識別子：Stream*
  AD_API(               argCtx, AID::UART), // 基本型
  AD_API_Queue<Stream*>(argCtx, AID::UART), // 非同期キュー型
  AD_API_Slot< Stream*>(argCtx, AID::UART)  // 接続スロット型
  {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //●モード別コンストラクタを実施する
    String retMsg = CONSTRACT();
    //│
    //●データ受信のタスクを開始する
    RUN_TASK(MY_AID);
    //┴
  //│
  //○┐【後処理】
    //●起動ログMSGを表示する
    Log::prtln(retMsg);
  //┴┴
  } /* constractor AD_UART() */

}; /* class AD_UART */