// filename : Dep_Connect/adapter/UART/UART_Bridge.cpp
//========================================================
// 接続部門／担当：UART（ブリッジモード）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/28)
//========================================================

//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 開始処理：コンストラクタ
  //───────────────────────────
  String CONSTRACT() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //○接続管理TBLを作成する
    SLOTs = 2;
    TBL = new T_SLOT[SLOTs];
    //│
    //●接続スロットを作成する
    SLOT_SET(0, &Serial ); // クライアント用(USB CDC)
    SLOT_SET(1, &Serial2); // クライアント用(GPIO)
    //┴
  //│
  //○┐【後処理】
    //▼：返却：起動ログ表示のMSG
    return String(" [OK] UART USB(CDC)+Serial#2");
  //┴
  } /* CONSTRACT() */

//========================================================
//§ハンドルの事前処理と進行判定
//========================================================
  //───────────────────────────
  // ブリッジ用：マスタ
  // ※既定クラスはスレーブ用なので再実装する
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  bool SETUP_BRIDGE() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //●前処理(マスタ)を実施する...進行判定を得る
    bool retGo = modeBridge::MASTER(
      TBL[ctx.trans.SID].CONN,              // 接続識別子
      [this](Stream* conn){SEND_MSG(conn);} // 返信処理(関数をラムダ式で包む)
    );
    //┴
  //│
  //○┐【後処理】
    //▼返却：進行判定
    return retGo;
  //┴
  } /* SETUP_BRIDGE() */

