// filename : Dep_Connect/adapter/UART/UART_Bridge.cpp
//========================================================
// 接続部門／担当：UART（ブリッジ モード）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/28)
//========================================================

//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 開始処理：コンストラクタ
  //───────────────────────────
  String CONSTRACT() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //○接続管理TBLを作成する
    SLOTs = 2;
    TBL = new T_SLOT[SLOTs];
    //│
    //●接続スロットを作成する
    SLOT_SET(0, &Serial ); // クライアント用(USB CDC)
    SLOT_SET(1, &Serial2); // クライアント用(GPIO)
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了（起動ログMSG[OK]）
    return String(" [OK] UART USB(CDC)+Serial#2");
  //┴
  } /* CONSTRACT() */

//========================================================
//§ハンドルの事前処理と進行判定
//========================================================
  //───────────────────────────
  // ブリッジ用：マスタ
  // ※既定クラスはスレーブ用なので再実装する
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  bool SETUP_BRIDGE() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //●マスタの前処理を実施する...進行判定を得る
    bool retGo = modeBridge::MASTER(
      TBL[ctx.trans.SID].CONN,
      [this](Stream* conn){this->SEND_RESULT(conn);} // ラムダ式で包む
    );
    //┴
  //│
  //○┐【後処理】
    //▼返却：進行判定
    return retGo;
  //┴
  } /* SETUP_BRIDGE() */

  //───────────────────────────
  // ブリッジ用(詳細)：マスタ
  //------------------------------------------------------
  //【引数】
  //・キュー構造体
  //───────────────────────────
  void BRIDGE_PROCESS(Stream* argConn, int argQID) override {
  //●ブリッジ処理を実行
    modeBridge::RUN(argQID);
  //│
  //◇┐[処理結果]に応じて処理を分岐する    
    if (ctx.base.Result == "") {
    //├┐（処理結果が[即時応答ではない]の場合）
      //●進行状況を[依頼中]に進捗する
      modeBridge::MOVE_BSTAT(BSTAT::REQ, "");
      //┴
    } else {
    //└┐（その他）
      //●接続元に処理結果を送信する
      this->SEND_RESULT(argConn);
      //┴
    } //～if

  } /* BRIDGE_PROCESS() */
