// filename : Dep_Connect/mode/member/sub.cpp
//========================================================
// 接続部門／業務担当：モード管理（サブモード）
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================

//########################################################
//# 処理詳細
//########################################################
 namespace modeSub{
//========================================================
//【公開機能】
//========================================================
  //━━━━━━━━━━━━━━━━━
  // サブモード
  //━━━━━━━━━━━━━━━━━
  void RUN(){
    //┬
    //○リクエストをMMPメインへ転送
    Serial1.print(ctx.strFrame);
    //│
    //◎┐受信待ちデータの取り込み
    String strRX = "";
    while (!strRX.endsWith("!")) {
      //│＼（終端に達した場合）
      //│ ▽完了：走査終了
      //│
      //○受信データを受信バッファに加える
      if (Serial1.available()) strRX += (char)Serial1.read();
      //┴
    } /* END-while */
    //│
    //○ＭＭＰ本体からのレスポンスをコンテクストに反映
    ctx.resMSG = strRX;
    //┴
  } /* RUN() */
} /* namespace modeSub */