#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃キャラクタ：爆発　※自機・敵機で共用する
#┠─────────────────────────────────────
#┃自機と敵機で利用する爆発オブジェクト用クラス
#┃・下位にデータセット･クラス(仕様｜情報)を持つ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット  import データセット as DS
from .FN移動            import 移動クラス
from .FN描画            import 描画クラス

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃データセット：情報
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 情報クラス:
    def __init__(self,
            引数_X座標  ,	#① 出現させる位置(X座標)
            引数_Y座標  ):  #② 出現させる位置(Y座標)
        #--------------------------------------------------------------------
        # 画面位置／大きさ
        #--------------------------------------------------------------------
        #□ X        ：画面位置(X座標)
        #□ Y        ：画面位置(Y座標)
        #□半径      ：爆発を描画する大きさ(単位：半径)
        self.X      = 引数_X座標
        self.Y      = 引数_Y座標
        self.半径   = 0

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    def __init__(self,
            引数_X座標      ,   #① 出現させる位置(X座標)
            引数_Y座標      ,   #② 出現させる位置(Y座標)
            引数_最大半径   ):  #③ 爆発の範囲(半径)
		#┬
        #≫データセットを用意する
        self.情報   = 情報クラス(引数_X座標, 引数_Y座標)
        #│
        #≫処理セットを用意する
        self.FN移動 = 移動クラス(self, 引数_最大半径)
        self.FN描画 = 描画クラス(self)
        #│
        #○用意済みのインスタンスに生成する
        DS.obj.爆発.append(self)
        #┴