#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能→遷移プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import time
from   ...データセット          import データセット as DS
from   ...汎用部品              import 音声
from   ...                      import 共通部品

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass
    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●ゲーム情報を初期化する
        #●立体物を初期化する
        #●音声を再生する
        self.Fnゲーム情報を初期化()
        self.Fn立体物を初期化()
        self.Fn音声を再生()
        #┴
	#─────────────────────────────────────
    def Fnゲーム情報を初期化(self):
        #┬ 
        #○シーンを『終了画面』に遷移する
        DS.情報.シーン = DS.仕様.シーンID.終了画面
        #┴
	#────────────────────────────────────
    def Fn立体物を初期化(self):
        #┬ 
        #●運搬機を停止する
        共通部品.運搬機.停止()
        #┴
	#────────────────────────────────────
    def Fn音声を再生(self):
        #┬ 
        #○恐竜の鳴き声を鳴らす
        for i in range(2):
            音声.個別指定(2,2)
            time.sleep(2)
        #│
        #●BGMを切り替える
        音声.自動再生()
        #┴