// filename : Dev_Network/device/IIC.cpp
//========================================================
// 通信設備部門／担当(通信デバイス)：IIC
//--------------------------------------------------------
// Ver 1.4.0 (2026/10/01)
//========================================================
//┬
//■┐インクルード
  //■Arduinoシステム
  #include <Wire.h>
//┴┴

//########################################################
//# 処理詳細
//########################################################
namespace devIIC {
//========================================================
// 基本情報
//========================================================
  int CH0_SDA = 15;
  int CH0_SCL = 16;
  int CH1_SDA = 47;
  int CH1_SCL = 48;

//========================================================
// 担務（公開機能）
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 基本情報
  //━━━━━━━━━━━━━━━━━
  bool ENABLED = false; // 有効判定：有効：true、無効：false

  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //━━━━━━━━━━━━━━━━━
  void HANDLE() {
    //○メッセージ表示を開始
    Log::prtln(" [I2C]");
    //│
    //○メッセージを初期化
    char msg[128];
    String msg0 = "";
    String msg1 = "";
    //│
    //○IICの初期化(チャンネル０：機能モジュール用)
    Wire.begin(CH0_SDA, CH0_SCL);
    snprintf(msg, sizeof(msg), "   [OK] IIC #0 -> SDA:%d SCL:%d", CH0_SDA, CH0_SCL);
    msg0 = msg;
    //│
    //○IICの初期化(チャンネル１：クライアント用)
    Wire1.begin(CH1_SDA, CH1_SCL);
    snprintf(msg, sizeof(msg), "   [OK] IIC #1 -> SDA:%d SCL:%d", CH1_SDA, CH1_SCL);
    msg1 = msg;
    //│
    //○メッセージ表示
    Log::prtln(msg0);
    Log::prtln(msg1);
    Log::prtln("");
    //│
    //○有効性セット
    ENABLED = true;
  } /* HANDLE() */

} /* namespace devIIC */