// filename : Dev_Network/device/UART.cpp
//========================================================
// 通信部門／担当：デバイス（UARTポート）
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================

//########################################################
//# 処理詳細
//########################################################
namespace devUART {
//========================================================
// 共通資源
//========================================================
  //─────────────────
  // ハードウェアのスペック
  //─────────────────
  int IntBaud = 115200;  // 通信速度

//========================================================
// 担務（公開機能）
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 基本情報
  //━━━━━━━━━━━━━━━━━
  bool ENABLED = false; // 有効判定：有効：true、無効：false

  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //━━━━━━━━━━━━━━━━━
  void START(){

    // UARTポートを起動
    #if (BOARD == BOARD_ESP32_S3_TINY)
      Serial1.begin(IntBaud, SERIAL_8N1, 17, 18);
      // ※メインモードは、Serial2をMP3プレイヤーで使用
      #if (BOARD != MMP_TYPE_MAIN)
        Serial2.begin(IntBaud, SERIAL_8N1, 11, 12);
      #endif

    #elif (BOARD == BOARD_M5STAMP_S3)
      Serial1.begin(IntBaud, SERIAL_8N1,  1,  2);

    #elif (BOARD == BOARD_PICO2W)
      Serial1.begin(IntBaud, SERIAL_8N1, 13, 17);
      Serial2.begin(IntBaud, SERIAL_8N1,  5,  9);

    #else
      #error "【設定エラー】ボードが未定義です！"
    #endif

    //○有効性セット
    Serial.println("　[OK] UART(#01) -> " + String(IntBaud) + "bps");
    ENABLED = true;
  } /* START() */
} /* namespace devUART */