// filename : Dev_Network/device/UART.cpp
//========================================================
// 通信部門／デバイス課：UART 担当
//--------------------------------------------------------
// Ver 1.3.2 (2026/09/15)
// ・UARTポートの見直し 
//========================================================

//########################################################
//# 処理詳細
//########################################################
namespace devUART {

//========================================================
// 担務（公開機能）
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 基本情報
  //━━━━━━━━━━━━━━━━━
  bool ENABLED = false; // 有効判定：有効：true、無効：false

  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //━━━━━━━━━━━━━━━━━
  void START(){

    //○UARTポートを起動
#if (MODE == MODE_SUB)
    Serial1.begin(SERIAL_BPS, SERIAL_8N1, 17, 18);
    Serial2.begin(SERIAL_BPS, SERIAL_8N1, 11, 12);
#else
    Serial.begin(SERIAL_BPS);
#endif

    //○有効性セット
    Log::prtln("　[OK] UART(#01) -> " + String(SERIAL_BPS) + "bps");
    ENABLED = true;
  } /* START() */
} /* namespace devUART */