// filename : Dep_Connect/template/__index.h
//========================================================
// 接続部門／業務課／作業標準：在籍一覧
//--------------------------------------------------------
// Ver 1.3.2 (2026/09/21)
//========================================================
#pragma once
//┬
//□┐インクルード
  //□Arduinoシステム
  #include <functional>
//┴┴

//========================================================
//§担当
//========================================================
  //━━━━━━━━━━━━━━━━━
  // モード部品
  //━━━━━━━━━━━━━━━━━
    //─────────────────
    // メインモード
    //─────────────────
    #include "md_main.cpp"
    namespace modeMain  {void RUN();}

    //─────────────────
    // サブモード
    //─────────────────
    #include "md_sub.cpp"
    namespace modeSub   {void RUN();}

    //─────────────────
    // ブリッジモード
    //─────────────────
    #include "md_bridge.cpp"
    namespace modeBridge{
      void RUN  (int argSID, String argFrame);
      bool MASER(Stream* argConn, std::function<void(Stream*)> argSendConn);
      bool SLAVE(int     argAID , std::function<void()       > argTrans   );
    }

//========================================================
// 作業標準
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 抽象基底クラス
  //━━━━━━━━━━━━━━━━━
  #include "api0.h" // 基本
  #include "api1.h" // キュー処理型