// filename : Dep_Connect/template/_api2.h
//========================================================
// 接続部門／業務設計：抽象基底クラス（接続スロット型）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/23)
//========================================================
#ifndef CONN_ADP_API2_H
#define CONN_ADP_API2_H
#pragma once

//########################################################
template <typename T>
class AdapterSlotBase :
  virtual public AdapterBase
//########################################################
{
protected:
//========================================================
//§基本情報
//========================================================
  struct T_SLOT {
    bool          used      = false;
    T             CONN             ; 
    unsigned long timeStamp = 0    ;
  };

  int     SLOTs = 0;
  T_SLOT* TBL   = nullptr;

//========================================================
//§公開機能
//========================================================
public:
  using AdapterBase::AdapterBase; // コンストラクタを継承
  //─────────────────
  // スロットIDを取得
  //----------------------------------
  // 戻り値：スロットID（数値型）
  // ・0～：正常終了（スロットID）
  // ・-1 ：該当なし
  //─────────────────
  int SLOT_GET_FREE() {
    //┬
    //○┐【前処理】
      //┴
    //│
    //○┐【主処理】
      //◎┐スロットを走査
      int  ID = 0;
      for (ID = 0; ID < SLOTs; ID++) {
        //│＼（すべて走査し終えた場合）
        //│ ▽完了：走査を終了
        //│
        //○スロット状態を確認
        if (!TBL[ID].used) break;
        //│＼（該当するスロットにヒットした場合）
        //│ ▽完了：走査を終了
        //┴
      } /* for */
      //┴
    //│
    //○┐【後処理】
      //▼返却
      return (ID < SLOTs) ? ID : -1;
    //┴
  } /* SLOT_GET_FREE() */

  //─────────────────
  // 古いスロットIDを取得
  //----------------------------------
  // 戻り値：スロットID（数値型）
  // ・0～：スロットID
  //─────────────────
  int SLOT_GET_OLD() {
    //┬
    //○┐【前処理】
      //┴
    //│
    //○┐【主処理】
      //◎┐最古のスロットIDを取得
      int oldID = 0;
      unsigned long oldTime = TBL[0].timeStamp;
      for (int ID = 1; ID < SLOTs; ID++) {
        //│＼（すべて走査し終えた場合）
        //│ ▽完了：走査を終了
        //│
        //◇┐スロット状態を確認
        if (TBL[ID].timeStamp < oldTime) {
            oldID   = ID;
            oldTime = TBL[ID].timeStamp;
          //┴
        //┴
        } /* if */
      } /* for */
      //┴
    //│
    //○┐【後処理】
      //▼返却：該当なし
      return oldID;
    //┴
  } /* SLOT_GET_OLD() */

}; /* class AdapterSlotBase */
#endif