// filename : Dep_Connect/template/api0.h
//========================================================
// 接続部門／業務設計：抽象基底クラス（基本型）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/24)
//========================================================
#ifndef CONN_ADP_API0_H
#define CONN_ADP_API0_H
#pragma once
//┬
//□┐インクルード
//┴┴

//########################################################
// 共通インターフェース（非テンプレート）
// ※テンプレートの型を意識せずにインスタンス化できるよう、
// 　非テンプレートとなるラッパークラスを設ける。
class Adapter {
//########################################################
public:
  //========================================================
  //§デストラクタ
  //========================================================
  virtual ~Adapter() = default;

  //========================================================
  //§公開機能
  //========================================================
  virtual void handle() = 0;
  //┴
};

//########################################################
// 共通インターフェース（テンプレート）
template <typename T>
class AdapterBase : public Adapter {
//########################################################
protected:
  MmpContext& ctx; // コンテクスト(参照)

public:
  //========================================================
  //§コンストラクタ/デストラクタ
  //========================================================
  AdapterBase(MmpContext& argCtx): ctx(argCtx){}
  virtual ~AdapterBase() override {}

  //========================================================
  //§返信処理
  //========================================================
  virtual void SEND_CONN(T argConn) = 0;

  //========================================================
  //§転送処理　※未登録はエラーCDをセット
  //========================================================
  virtual void trans() {ctx.bridge.MSG = RCD::Trn0Err;};

  //========================================================
  //§ハンドル前処理
  //========================================================
  virtual bool handle_Setup()       {return false;} // 一般用
  virtual bool handle_SetupBridge() {return false;} // ブリッジ用

  //========================================================
  //§公開機能
  //========================================================
  void handle() override = 0; // 実行ハンドル

}; /* class AdapterBase */
#endif