// filename : Dep_Connect/template/api.h
//========================================================
// 接続部門／業務設計：抽象基底クラス（基本型）
//--------------------------------------------------------
// Ver 1.4.0 (2026/10/01)
//========================================================
#pragma once

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス：非テンプレート
// ※テンプレートを意識せずにインスタンス化する為の、
// 　ラッパークラス
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class AD {
public:
  //========================================================
  //§デストラクタ
  //========================================================
  virtual ~AD() = default;

  //========================================================
  //§公開機能
  //========================================================
  virtual void handle() = 0;
  //┴
};

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス：基本型
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
template <typename T>
class AD_API : public AD {
protected:
  MmpContext& ctx;    // コンテクスト(参照)
  const int   MY_AID; // 通信アダプタID

public:
//========================================================
//§コンストラクタ/デストラクタ
//========================================================
  AD_API(
    MmpContext& argCtx, // コンテクスト（参照）
    int         argAid  // 通信アダプタID
  ) :
    ctx(argCtx),        // コンテクスト
    MY_AID(argAid)      // 通信アダプタID
  {}

  virtual ~AD_API() override {}

protected:
//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 開始処理：コンストラクタ
  //───────────────────────────
  virtual String CONSTRACT() {
    Log::prtln(RCD::ERR_SYS); // システムエラーログ出力
    return RCD::ERR_SYS;      // システムエラーMSGを返却
  }; /* CONSTRACT() */

  //───────────────────────────
  // 終了処理：スレーブのアダプタにリクエストを送信する
  //───────────────────────────
  virtual void SEND_REQUEST() {
    Log::prtln(RCD::ERR_SYS);        // システムエラーログ出力
    ctx.trans.Result = RCD::Trn0Err; // 処理結果にエラーCDをセット
  }; /* SEND_REQUEST() */

  //───────────────────────────
  // 終了処理：接続元に処理結果を送信する
  //───────────────────────────
  virtual void SEND_RESULT(T argConn){
    Log::prtln(RCD::ERR_SYS); // システムエラーログ出力
  }; /* SEND_RESULT() */

//========================================================
//§ハンドルの事前処理と進行判定
//========================================================
  //───────────────────────────
  // 一般用：追加事項 ※SETUP()に包括される
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  virtual bool SETUP_OPTION() {return false;}

  //───────────────────────────
  // 一般用：本体
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  bool SETUP() {
    //┬
//──────────────────
//➡WiFi利用
//・WiFiの起動が必要
#ifdef USE_WiFi
//------------------------------------
    //●WiFiの接続状況を確認する
    if (!devWiFi::ENABLED_CONN(true)) return true;
    //│
//------------------------------------
#endif //➡WiFi利用
//──────────────────
    //●追加事項を確認する
    return SETUP_OPTION();
    //┴
  } /* SETUP() */

//──────────────────
//➡ブリッジ
// デフォルトでスレーブの処理内容を実装
// → マスタの場合は通信アダプタで更に実装する
//・ブリッジモード固有の機能
#if MODE == MODE_BRIDGE
//------------------------------------
  //───────────────────────────
  // 処理フローを制御（ブリッジモード：スレーブ用）
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  virtual bool WORKFLOW() {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //●前処理(スレーブ用)を実施する...進行判定を得る
    bool retGo = modeBridge::SLAVE(
      this->MY_AID,                   // 通信アダプタID
      [this](){this->SEND_REQUEST();} // リクエスト送信関数をラムダ式で包む
    );
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了(進行判定)
    return retGo;
  //┴
  } /* WORKFLOW() */
//------------------------------------
#endif //➡ブリッジ
//──────────────────

  //───────────────────────────
  // 主処理を実行
  //------------------------------------------------------
  //【引数】
  // argConn：接続識別子
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  virtual bool RUN_PROCESS(T& argConn) {
//──────────────────
//➡ブリッジモード（スレーブ用）
// デフォルトでスレーブの処理内容を実装
// → マスタの場合は通信アダプタで更に実装する
//・マスタ／スレーブを通しての制御が必要
//・ブリッジモードでは引数は未使用（ダミー）
#if   MODE == MODE_BRIDGE
//------------------------------------
  //┬
  //○┐【前処理】
    //○スレーブであるかを確認する
    if (this->MY_AID != ctx.trans.AID) return false;
    //│＼（スレーブの通信アダプタIDと異なる場合）
    //│ ▼終了：早期リターン（進行OK） ※全件処理する
    //┴
  //│
  //○┐【主処理】
    //●ブリッジ処理を実行
    //│※キュー内容はctx.trans.*に退避される
    modeBridge::MOVE_BSTAT(BSTAT::DONE, "非同期応答");
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了(進行NG) ※1件ずつ処理する
    return true;
  //┴
//──────────────────
//➡メインモード
//・単純に実行→レスポンス
#elif MODE == MODE_MAIN
//------------------------------------
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //●メインモードの主処理を実行する
    modeMain::RUN();
    //│
    //●接続元に実行結果を送信する
    this->SEND_RESULT(argConn);
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了(進行OK) ※全件処理する
    return false;
  //┴
//──────────────────
//➡サブモード
//・単純に実行→レスポンス
#elif MODE == MODE_SUB
//------------------------------------
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //●サブモードの主処理を実行する
    modeSub::RUN();
    //│
    //●接続元に実行結果を送信する
    this->SEND_RESULT(argConn);
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了(進行OK) ※全件処理する
    return false;
  //┴
//------------------------------------
#endif //➡ブリッジ｜➡メイン｜➡サブ
//──────────────────
  } /* RUN_PROCESS() */

public:
//========================================================
//§公開機能
//========================================================
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // ポーリング用ハンドラ
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
   void handle() override = 0; // 実行ハンドル

}; /* class AD_API */