// filename : Dep_Connect/template/api.h
//========================================================
// 接続部門／業務設計：抽象基底クラス（基本型）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/30)
//========================================================
#pragma once

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス：非テンプレート
// ※テンプレートを意識せずにインスタンス化する為の、
// 　ラッパークラス
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class AD {
public:
  //========================================================
  //§デストラクタ
  //========================================================
  virtual ~AD() = default;

  //========================================================
  //§公開機能
  //========================================================
  virtual void handle() = 0;
  //┴
};

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス：基本型
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
template <typename T>
class AD_API : public AD {
protected:
  MmpContext& ctx;    // コンテクスト(参照)
  const int   MY_AID; // 通信アダプタID

public:
//========================================================
//§コンストラクタ/デストラクタ
//========================================================
  AD_API(
    MmpContext& argCtx, // コンテクスト（参照）
    int         argAid  // 通信アダプタID
  ) :
    ctx(argCtx),        // コンテクスト
    MY_AID(argAid)      // 通信アダプタID
  {}

  virtual ~AD_API() override {}

protected:
//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 開始処理：コンストラクタ
  //───────────────────────────
  virtual String CONSTRACT() {
    Log::prtln(RCD::ERR_SYS); // システムエラーログ出力
    return RCD::ERR_SYS;      // システムエラーMSGを返却
  }; /* CONSTRACT() */

  //───────────────────────────
  // 終了処理：スレーブのアダプタにリクエストを送信する
  //───────────────────────────
  virtual void SEND_REQUEST() {
    Log::prtln(RCD::ERR_SYS);        // システムエラーログ出力
    ctx.trans.Result = RCD::Trn0Err; // 処理結果にエラーCDをセット
  }; /* SEND_REQUEST() */

  //───────────────────────────
  // 終了処理：接続元に処理結果を送信する
  //───────────────────────────
  virtual void SEND_RESULT(T argConn){
    Log::prtln(RCD::ERR_SYS); // システムエラーログ出力
  }; /* SEND_RESULT() */

//========================================================
//§ハンドルの事前処理と進行判定
//========================================================
  //───────────────────────────
  // 一般用：追加事項 ※SETUP_NORMAL()に包括される
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  virtual bool SETUP_OPTION() {return false;}

  //───────────────────────────
  // 一般用：本体
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  virtual bool SETUP_NORMAL() {
    //┬
//──────────────────
//➡WiFi関連
//・WiFiの起動が必要
#if ADP_UDP || ADP_TCP || ADP_WSOC || ADP_HTTP || ADP_ESPN
//------------------------------------
    //●WiFiの接続状況を確認する
    if (!devWiFi::ENABLED_CONN(true)) return true;
    //│
//------------------------------------
#endif //➡WiFi関連｜➡WiFi関連以外
//──────────────────
    //●追加事項を確認する
    return SETUP_OPTION();
    //┴
  } /* SETUP_NORMAL() */

//──────────────────
//➡ブリッジ
//※デフォルトでスレーブの処理内容を実装
//　→ マスタの場合は通信アダプタで更に実装する
//・転送処理はブリッジ固有の機能
#if (MODE == MODE_BRIDGE)
//------------------------------------
  //───────────────────────────
  // ブリッジ用：スレーブ
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  virtual bool SETUP_BRIDGE() {
    //┬
    //○┐【前処理】
      //┴
    //│
    //○┐【主処理】
      //●前処理(スレーブ)を実施する...進行判定を得る
      bool retGo = modeBridge::SLAVE(
        this->MY_AID,                   // 通信アダプタID
        [this](){this->SEND_REQUEST();} // 関数をラムダ式で包む
      );
      //┴
    //│
    //○┐【後処理】
      //▼返却：正常終了(進行判定)
      return retGo;
    //┴
  } /* SETUP_BRIDGE() */

  //───────────────────────────
  // ブリッジ用(詳細)：スレーブ
  //───────────────────────────
  virtual void BRIDGE_PROCESS() {
    if (this->MY_AID == ctx.trans.AID)
    {modeBridge::MOVE_BSTAT(BSTAT::DONE, "非同期応答");}
  } /* BRIDGE_PROCESS() */
//------------------------------------
#endif //➡ブリッジ
//──────────────────

public:
//========================================================
//§公開機能
//========================================================
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // ポーリング用ハンドラ
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
   void handle() override = 0; // 実行ハンドル

}; /* class AD_API */