// filename : Dep_Connect/template/api.h
//========================================================
// 接続部門／業務設計：抽象基底クラス（基本型）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/27)
//========================================================
#pragma once

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス：基本型
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class AD_API{
protected:
  MmpContext& ctx;    // コンテクスト(参照)
  const int   MY_AID; // 通信アダプタID

//========================================================
//§転送処理
//========================================================
  virtual void TRANS() {ctx.trans.Msg = RCD::Trn0Err;};

//========================================================
//§ハンドルの事前処理と進行判定
//========================================================
  virtual bool SETUP_NORMAL() {return false;} // 一般用
  virtual bool SETUP_BRIDGE() {return false;} // ブリッジ用

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // インスタンス管理
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
    //──────────────────
    // コンストラクタ
    //──────────────────
    AD_API(
      MmpContext& argCtx, // コンテクスト
      int         argAID  // 通信アダプタID
    ):
      ctx(argCtx),        // コンテクスト
      MY_AID(argAID)      // 通信アダプタID
    {}

    //──────────────────
    // デストラクタ
    //──────────────────
    virtual ~AD_API() {}

  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // ポーリング用ハンドラ
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  virtual void handle() = 0;

}; /* class AD_API */