// filename : Dep_Connect/template/api.h
//========================================================
// 接続部門／業務設計：抽象基底クラス（基本型）
//--------------------------------------------------------
// Ver 1.4.0 (2026/10/02)
//========================================================
#pragma once

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス：非テンプレート
// ※テンプレートを意識せずにインスタンス化する為の、
// 　ラッパークラス
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class AD {
public:
  //========================================================
  //§デストラクタ
  //========================================================
  virtual ~AD() = default;

  //========================================================
  //§公開機能
  //========================================================
  virtual void handle() = 0;
  //┴
};

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス：基本型
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
template <typename T>
class AD_API : public AD {
protected:
  MmpContext& ctx;    // コンテクスト(参照)
  const int   MY_AID; // 通信アダプタID

//========================================================
//§コンストラクタ/デストラクタ
//========================================================
public:
  AD_API(
    MmpContext& argCtx, // コンテクスト（参照）
    int         argAid  // 通信アダプタID
  ) :
    ctx(argCtx),        // コンテクスト
    MY_AID(argAid)      // 通信アダプタID
  {}

  virtual ~AD_API() override {}

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//【非公開機能】
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
protected:
//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 開始処理：コンストラクタ
  //───────────────────────────
  virtual String CONSTRACT() {
    Log::prtln(RCD::ERR_SYS); // システムエラーログ出力
    return RCD::ERR_SYS;      // システムエラーMSGを返却
  }; /* CONSTRACT() */

  //───────────────────────────
  // 終了処理：スレーブのアダプタにリクエストを送信する
  //───────────────────────────
  //virtual void SEND_REQUEST()
  //※分割ファイル（ブリッジ用）で実装

  //───────────────────────────
  // 終了処理：接続元に処理結果を送信する
  //───────────────────────────
  virtual void SEND_RESULT(T argConn){
    Log::prtln(RCD::ERR_SYS); // システムエラーログ出力
  }; /* SEND_RESULT() */

//========================================================
//§ハンドル補助
//========================================================
  //───────────────────────────
  // 一般用：追加事項 ※SETUP()に包括される
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  virtual bool SETUP_OPTION() {return false;}

  //───────────────────────────
  // 一般用：本体
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  bool SETUP() {
    //┬
//──────────────────
//➡WiFi利用
//・WiFiの起動が必要
#ifdef USE_WiFi
//------------------------------------
    //●WiFiの接続状況を確認する
    if (!devWiFi::ENABLED_CONN(true)) return true;
    //│
//------------------------------------
#endif //➡WiFi利用
//──────────────────
    //●追加事項を確認する
    return SETUP_OPTION();
    //┴
  } /* SETUP() */

  //───────────────────────────
  // 処理フローを制御
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  //virtual bool WORKFLOW()
  //※分割ファイル（ブリッジ用）で実装

  //───────────────────────────
  // 主処理を実行
  //------------------------------------------------------
  //【引数】
  // argConn：接続識別子
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  //virtual bool RUN_PROCESS(T& argConn)
  //※分割ファイル（各モード別）で実装

//========================================================
//§モード別実装のインクルード
//========================================================
#if   MODE == MODE_MAIN
  #include "api_Main.h"
#elif MODE == MODE_SUB
  #include "api_Sub.h"
#elif MODE == MODE_BRIDGE
  #include "api_Bridge.h"
#endif

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//【公開機能】
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // ポーリング用ハンドラ
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
   void handle() override = 0; // 実行ハンドル

}; /* class AD_API */