// filename : Dep_Connect/template/api.h
//========================================================
// 接続部門／業務設計：抽象基底クラス（基本型）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/27)
//========================================================
#ifndef CONN_ADP_API_H
#define CONN_ADP_API_H
#pragma once

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス：ラッパー
//--------------------------------------------------------
// テンプレートの型を意識せずにインスタンス化できるよう、
// 非テンプレートとなるラッパークラスを設ける。
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class Adapter {
//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // インスタンス管理
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
    //──────────────────
    // デストラクタ
    //──────────────────
    virtual ~Adapter() = default;

  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // ポーリング用ハンドラ
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  virtual void handle() = 0;
};

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス：本体
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
template <typename T>
class AD_API_Base : public Adapter {
protected:
  MmpContext& ctx;    // コンテクスト(参照)
  const int   MY_AID; // 通信アダプタID

//========================================================
//§返信処理
//========================================================
  virtual void SEND_CONN(T argConn) = 0;

//========================================================
//§転送処理
//========================================================
  virtual void TRANS() {ctx.bridge.MSG = RCD::Trn0Err;};

//========================================================
//§ハンドルの事前処理と進行判定
//========================================================
  virtual bool SETUP_NORMAL() {return false;} // 一般用
  virtual bool SETUP_BRIDGE() {return false;} // ブリッジ用

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // インスタンス管理
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
    //──────────────────
    // コンストラクタ
    //──────────────────
    AD_API_Base(
      MmpContext& argCtx, // コンテクスト
      int         argAID  // 通信アダプタID
    ):
      ctx(argCtx),        // コンテクスト
      MY_AID(argAID)      // 通信アダプタID
    {}

    //──────────────────
    // デストラクタ
    //──────────────────
    virtual ~AD_API_Base() override {}

  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // ポーリング用ハンドラ
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  void handle() override = 0; // 実行ハンドル

}; /* class AD_API_Base */
#endif