// filename : Dep_Connect/template/api.h
//========================================================
// 接続部門／業務設計：抽象基底クラス（基本型）
//--------------------------------------------------------
// Ver 1.4.0 (2026/09/28)
//========================================================
#pragma once

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス：基本型
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class AD_API{
protected:
  MmpContext& ctx;    // コンテクスト(参照)
  const int   MY_AID; // 通信アダプタID

//========================================================
//§転送処理
//========================================================
  virtual void TRANS() {ctx.trans.Msg = RCD::Trn0Err;};

//========================================================
//§ハンドルの事前処理と進行判定
//========================================================
  //───────────────────────────
  // 一般用：追加事項
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  virtual bool SETUP_OPTION() {return false;}

  //───────────────────────────
  // 一般用：本体
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
//──────────────────
//➡WiFi関連
//・WiFiの起動が必要
#if ADP_UDP || ADP_TCP || ADP_WSOC || ADP_HTTP || ADP_ESPN
//------------------------------------
  virtual bool SETUP_NORMAL() {
    //┬
    //●WiFiの接続状況を確認する
    if (!devWiFi::ENABLED_CONN(true)) return true;
    //│
    //●追加事項を確認する
    return SETUP_OPTION();
    //┴
  } /* SETUP_NORMAL() */
//──────────────────
//➡WiFi関連以外
#else
//------------------------------------
  virtual bool SETUP_NORMAL() {return false;}
//------------------------------------
#endif //➡WiFi関連｜➡WiFi関連以外
//──────────────────

//──────────────────
//➡ブリッジ
//・転送処理はブリッジ固有の機能
#if (MODE == MODE_BRIDGE)
//------------------------------------
  //───────────────────────────
  // ブリッジ用：スレーブ
  //※マスタの場合は通信アダプタで更に実装する
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  virtual bool SETUP_BRIDGE() {
    //┬
    //○┐【前処理】
      //○(処理なし)
      //┴
    //│
    //○┐【主処理】
      //●前処理(スレーブ)を実施...進行判定を得る
      bool retGo = modeBridge::SLAVE(
        this->MY_AID,            // 通信アダプタID
        [this](){this->TRANS();} // 転送処理(関数をラムダ式で包む)
      );
      //┴
    //│
    //○┐【後処理】
      //▼返却：正常終了(進行判定)
      return retGo;
    //┴
  } /* SETUP_BRIDGE() */
//------------------------------------
#endif //➡ブリッジ
//──────────────────

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // インスタンス管理
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
    //──────────────────
    // コンストラクタ
    //──────────────────
    AD_API(
      MmpContext& argCtx, // コンテクスト
      int         argAID  // 通信アダプタID
    ):
      ctx(argCtx),        // コンテクスト
      MY_AID(argAID)      // 通信アダプタID
    {}

    //──────────────────
    // デストラクタ
    //──────────────────
    virtual ~AD_API() {}

  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // ポーリング用ハンドラ
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  virtual void handle() = 0;

}; /* class AD_API */