// filename : Dep_Connect/template/api_Bridge.h
//========================================================
// 接続部門／業務設計：抽象基底クラス（基本型：ブリッジ）
//--------------------------------------------------------
// Ver 1.4.0 (2026/10/02)
//========================================================

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//【非公開機能】
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 終了処理：スレーブのアダプタにリクエストを送信する
  //───────────────────────────
  virtual void SEND_REQUEST() {
    Log::prtln(RCD::ERR_SYS);        // システムエラーログ出力
    ctx.trans.Result = RCD::Trn0Err; // 処理結果にエラーCDをセット
  }; /* SEND_REQUEST() */

//========================================================
//§ハンドル補助
//========================================================
  //───────────────────────────
  // 処理フローを制御（ブリッジモード：スレーブ用）
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  virtual bool WORKFLOW() {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //●前処理(スレーブ用)を実施する...進行判定を得る
    bool retGo = modeBridge::SLAVE(
      this->MY_AID,                   // 通信アダプタID
      [this](){this->SEND_REQUEST();} // リクエスト送信関数をラムダ式で包む
    );
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了(進行判定)
    return retGo;
  //┴
  } /* WORKFLOW() */

  //───────────────────────────
  // 主処理を実行
  //------------------------------------------------------
  //【引数】
  // argConn：接続識別子
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  virtual bool RUN_PROCESS(T& argConn) {
  //┬
  //○┐【前処理】
    //○スレーブであるかを確認する
    if (this->MY_AID != ctx.trans.AID) return false;
    //│＼（スレーブの通信アダプタIDと異なる場合）
    //│ ▼終了：早期リターン（進行OK） ※全件処理する
    //┴
  //│
  //○┐【主処理】
    //●ブリッジ処理を実行
    //│※キュー内容はctx.trans.*に退避される
    modeBridge::MOVE_BSTAT(BSTAT::DONE, "事後応答");
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了(進行NG) ※1件ずつ処理する
    return true;
  //┴
  } /* RUN_PROCESS() */