#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン：プレイ画面(描画機能)
#┠─────────────────────────────────────
#┃描画コントローラが描画プロセスで実行するアクション・メソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import pyxel
import main.GAME共通                         as 共通処理
from   main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 描画クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass
    #┌───────────────────────────────────
    #│機能実行
    #├───────────────────────────────────
    #│※自機が無い場合は表示不可 または 意味がない為、処理をスキップする
    #└───────────────────────────────────
    def 実行(self):
        #┬
        首   = (4,8)
        骨   = (6,10)
        最小 = 140          # 首=左、骨=MAX
        最大 = 380          # 首=右、骨=MIN
        範囲 = 最大 - 最小  # PWMの幅
        #│
        出力 = DS.情報.プレイ時間
        pyxel.text(54, 2, f"{str(出力).zfill(3)}", 10)
        #│
        #◎└┐発電機のサイクルを描画する
        for i in range(2):
            #│
            #○発電量を求める
            運搬機   = DS.obj.運搬機[i]
            出力     = 運搬機.情報.出力電力
            画面高   = DS.仕様.画面高
            最低出力 = 運搬機.仕様.最低出力
            最高出力 = 運搬機.仕様.最高出力
            比率     = (出力-最低出力)/(最高出力-最低出力)
            #│
            #○発電量を描画する
            目盛 = int(画面高 * 比率)
            開始 = 画面高 - 目盛
            pyxel.rect(10+70*i,開始, 30 , 目盛, 15)              # 矩形描画
            pyxel.text((10+8+70*i) , (画面高-10), str(出力), 8 ) # 数値表示
            #│
            目盛 = 最大 - int(範囲 * 比率)
            共通処理.入出力.MMP.PWM_VALUE(骨[i],目盛)
            #│
            #◇┐ペダル･ガイダンスを描画する
            角度     = DS.obj.発電機[i].情報.角度
            左右判定 = 共通処理.発電機.右足判定(角度)
            if 左右判定:
            #　├┐（フレーム処理タイミングの場合）
                #↓
                #○右足を描画する
                共通処理.入出力.MMP.PWM_VALUE(首[i],最大)
                pyxel.blt(25+70*i,25+55*i, 0, 80,0, 24,56, 0)
            else       :
            #　└┐（その他）
                #↓
                #○左足を描画する
                共通処理.入出力.MMP.PWM_VALUE(首[i],最小)
                pyxel.blt( 2+70*i,25+55*i, 0, 56,0, 24,56, 0)
        #┴　┴　┴
