#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能→遷移プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import time
import main.GAME共通                         as 共通処理
from   main.データセット import データセット as DS
from   ..DB              import シーンID

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 遷移クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self   ,
            引数_個体   ):  #① 個体オブジェクト
        #┬
        #○個体オブジェクトのリファレンスを用意する
        self._仕様  = 引数_個体.仕様
        #┴
    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●ゲーム情報を初期化する
        #●立体物を初期化する
        #●音声を再生する
        self.Fnゲーム情報を初期化()
        self.Fn立体物を初期化()
        self.Fn音声を再生()
        #┴
	#─────────────────────────────────────
    def Fnゲーム情報を初期化(self):
        #┬ 
        #○シーンを『終了画面』に遷移する
        DS.情報.シーン = シーンID.終了画面
        #┴
	#────────────────────────────────────
    def Fn立体物を初期化(self):
        #┬ 
        #●発電機を停止する
        共通処理.運搬機.停止()
        #│
        #◎└┐サーボ(小屋)を初期化する
        for チーム in range(2):
            #│＼（すべてのチームを走査し終えた場合）
            #│ ↓
            #│ ▼繰り返し処理を抜ける
            #│
            #○サーボ(恐竜)を初期化する
            共通処理.入出力.MMP.PWM_VALUE(
                self._仕様.首[チーム]   ,
                self._仕様.中央         )
            #│
            #○サーボ(骨メータ)を初期化する
            共通処理.入出力.MMP.PWM_VALUE(
                self._仕様.骨[チーム]   ,
                self._仕様.最大         )
        #┴　┴
	#────────────────────────────────────
    def Fn音声を再生(self):
        #┬ 
        #○恐竜の鳴き声を鳴らす
        for i in range(2):
            共通処理.BGM_DFP.指定曲(2)
            time.sleep(2)
        #│
        #●BGMを切り替える
        共通処理.BGM_DFP.自動選択()
        #┴