#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃結果機能→遷移プロセスのアクションメソッド
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import time
import main.GAME共通                         as 共通処理
from   main.データセット import データセット as DS
from   ..DB              import シーンID

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 遷移クラス:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass
    #┌───────────────────────────────────
    #│機能実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●ゲーム情報を初期化する
        #●立体物を初期化する
        #●音声を再生する
        self.Fnゲーム情報を初期化()
        self.Fn立体物を初期化()
        self.Fn音声を再生()
        #┴
	#─────────────────────────────────────
    def Fnゲーム情報を初期化(self):
        #┬ 
        #○シーンを『終了画面』に遷移する
        DS.情報.シーン = シーンID.終了画面
        #┴
	#────────────────────────────────────
    def Fn立体物を初期化(self):
        #┬ 
        #●運搬機を停止する
        共通処理.運搬機.停止()
        #┴
	#────────────────────────────────────
    def Fn音声を再生(self):
        #┬ 
        #○恐竜の鳴き声を鳴らす
        for i in range(2):
            共通処理.BGM_DFP.指定曲(2)
            time.sleep(2)
        #│
        #●BGMを切り替える
        共通処理.BGM_DFP.自動選択()
        #┴