#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃シーン(プレイ画面)
#┠─────────────────────────────────────
#┃常時存在するシーン(タイトル画面)オブジェクト用クラス
#┃・下位に機能クラス(移動｜描画)をもつ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from .FN移動 import 移動クラス
from .FN描画 import 描画クラス

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様クラス:

    def __init__(self):
      self.首   = (4,6)   # 小屋の恐竜のサーボ
      self.骨   = (5,7)  # 小屋のメータのサーボ
      self.最小 = 140     # 首=左、骨=MAX
      self.最大 = 380     # 首=右、骨=MIN
      self.範囲 = self.最大 - self.最小 # PWMの幅
      self.中央 = int((self.最小 + self.最大) / 2)

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
      #┬
      #〇個体オブジェクトのリファレンスを用意する
      self.仕様  = 仕様クラス()
      #│
      #≫機能を用意する
      self.FN移動 = 移動クラス(self)
      self.FN描画 = 描画クラス(self)
      #┴