// filename : Dep_Contact/adapter/UART/UART_Sub.cpp
//========================================================
// 接客部門／担当(通信アダプタ)：UART(サブ)
//--------------------------------------------------------
// Ver 1.4.0 (2026/10/05)
//========================================================

//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 開始処理：コンストラクタ
  //───────────────────────────
  String CONSTRACT() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //○接続管理TBLを作成する
    SLOTs = 2;
    TBL = new T_SLOT[SLOTs];
    //│
    //●接続スロットを作成する
    SLOT_SET(0, &Serial ); // クライアント用(USB CDC)
    SLOT_SET(1, &Serial2); // クライアント用(GPIO)
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了（起動ログMSG[OK]）
    return String(" [OK] UART USB(CDC)+Serial#2");
  //┴
  } /* CONSTRACT() */