// filename : Dep_Contact/adapter/UART/UART_Bridge.cpp
//========================================================
// 接客部門／担当(通信アダプタ)：UART 高速型（ブリッジ）
//--------------------------------------------------------
// Ver 1.4.0 (2026/10/01)
//========================================================

//========================================================
//§ハンドルの事前処理と進行判定
//========================================================
  //───────────────────────────
  // 処理フローを制御する（ブリッジモード：マスタ用）
  // ※基底クラスがスレーブ用で定義済なので再実装する
  //------------------------------------------------------
  //【戻り値】進行判定
  // true ：進行NG
  // false：進行OK
  //───────────────────────────
  bool WORKFLOW() override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //●マスタの前処理を実施する...進行判定を得る
    bool retGo = modeBridge::MASTER(
  //──────────────────
  //➡ハイスピード型
  #if TURBO
  //------------------------------------
      CONN,                     // 単一スロット
  //──────────────────
  //➡標準型
  #else
  //------------------------------------
      TBL[ctx.trans.SID].CONN,  // 複数スロット
  //------------------------------------
  #endif //➡ハイスピード型｜➡標準型
  //──────────────────
      [this](Stream* conn){SEND_RESULT(conn);} // 返信処理(関数をラムダ式で包む)
  
    );
    //┴
  //│
  //○┐【後処理】
    //▼返却：正常終了(進行判定)
    return retGo;
  //┴
  } /* WORKFLOW() */

  //───────────────────────────
  // 主処理（マスタ用）
  // ※基底クラスがスレーブ用で定義済なので再実装する
  //───────────────────────────
  bool RUN_PROCESS(Stream*& argConn) override final {
  //┬
  //○┐【前処理】
    //┴
  //│
  //○┐【主処理】
    //●メインモードの主処理を実行する
    //│※キュー内容はctx.trans.*に退避される
      modeBridge::HANDLE();
    //│
    //◇┐[処理結果]に応じて処理を分岐する    
      if (ctx.base.Result == "") {
      //├┐（処理結果が[後続処理あり]の場合）
        //●進行状況を[依頼中]に進捗する
        modeBridge::MOVE_BSTAT(BSTAT::REQ, "");
        //┴
      } else {
      //└┐（その他）※即時応答の場合
        //●接続元に処理結果を送信する
        this->SEND_RESULT(argConn);
        //┴
      } //～if
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* RUN_PROCESS() */