#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃変更機能(出現プロセス)のサブコントローラ
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [ゲーム共通]
from main.データセット import DS

# [別クラス]
from main.オブジェクト.管理.特殊効果 import アイテムID

# [要素クラス]
from .P敵機 import *
from .Pボス import *
from .P機雷 import *
from .P補給 import *
from .P特殊 import *

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃仕様
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 仕様:
    #┬
    #□レベル内で出現する間隔
    間隔     = DS.仕様.難易度間隔
    機雷     = int(間隔 / 1.4)
    弾       = int(間隔 / 2.2)
    シールド = int(間隔 / 0.7)
    アイテム = int(間隔 / 1.7) # 推奨値＝1.7
    #┴

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセス実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #○シーンを確認する
        if DS.情報.シーン != DS.仕様.シーンID.プレイ画面: return
        if DS.情報.プレイ時間 < 60                      : return
        #│＼（対象外の場合）
        #│ ↓
        #│ ▼繰処理を中断する
        #│
        #●敵機(通常)を出現する
        #●機雷を出現する
        #●補給(弾)を出現する
        #●補給(シールド)を出現する
        #●アイテムを出現する
        #●敵(ボス)を出現する
        Act敵機()
        Act機雷(仕様.機雷                          )
        Act補給(仕様.弾       , アイテムID.弾薬    )
        Act補給(仕様.シールド , アイテムID.シールド)
        Act特殊(仕様.アイテム                      )
        Actボス()
        #┴　┴