#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃変更機能(出現プロセス[敵機：機雷])のアクションメソッドを実行
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [システム共通]
import pyxel

# [ゲーム共通]
from main.データセット import DS

# [別クラス]
from main.オブジェクト.キャラ.敵機 import 敵機生成
from main.オブジェクト.キャラ.敵機 import 機体ID

#┌───────────────────────────────────
#│アクション・メソッド実行
#└───────────────────────────────────
def Act機雷(引数_間隔):
    #┬
    #○出現タイミングを確認する
    タイミング判定  = (DS.情報.プレイ時間 % 引数_間隔 == 0)
    if not タイミング判定: return
    #│＼（出現時間が未到来の場合）
    #│ ↓
    #│ ▼処理を中断する
    #│
    #≫アクション・メソッドで敵機(機雷)を生成する
    画面幅   = DS.仕様.リソース.画面.幅
    キャラ幅 = DS.仕様.リソース.キャラ幅.通常
    X座標    = pyxel.rndi(0, 画面幅 - キャラ幅)
    種類ID   = 機体ID.機雷
    敵機生成(X座標, -8, 種類ID, False)
    #┴