// filename : Dep_Contact/adapter/HTTP/HTTP_Bridge.cpp
//========================================================
// 接客部門／担当(通信アダプタ)：HTTP（ベース：ブリッジ）
//--------------------------------------------------------
// Ver 1.4.0 (2026/10/01)
//========================================================
//┬
//□┐インクルード
  //□Arduinoシステム
  #include <HTTPClient.h>
//┴┴

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
// クラス【基本型】
//━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class  AD_HTTP : // 接続識別子：ダミー
public AD_API<String> // 基本型
{
private:
//========================================================
//§基本情報
//========================================================
  HTTPClient MY_NET; // HTTPクライアント(実体)

//========================================================
//§開始処理・終了処理
//========================================================
  //───────────────────────────
  // 終了処理：スレーブにリクエストを送信する
  //───────────────────────────
  void SEND_REQUEST() override final {
  //┬
  //○┐【前処理】
    //●WiFiの接続状況を確認する
    if (!devWiFi::ENABLED_CONN(true))
    {ctx.trans.Result = RCD::Trn1Err; return;}
    //│＼（状態が[未接続]の場合）
    //│ ○処理結果にエラーCDをセット
    //│ ▼終了：早期リターンする
    //│
    //○宛先情報を用意する
    String toIP    = ctx.trans.Dat1; // IPアドレス
    String toPort  = ctx.trans.Dat2; // ポート番号
    String cmdPath = ctx.base.Frame; // コマンドパス
    String toURL   = String("http://") + toIP + ":" + toPort + "/" + cmdPath;
    //┴
  //│
  //○┐【主処理】
    //○クライアントを起動し、この通信アダプタにリクエストを送信する
    MY_NET.begin(toURL);
    if (MY_NET.GET() <= 0)
    {ctx.trans.Result = RCD::Trn2Err; return;}
    //│＼（実行に失敗した場合）
    //│ ○処理結果にエラーCDをセット
    //│ ▼終了：早期リターンする
    //│
    //○転送先からの受信データ(フレーム)を取得する
    String retFrame = MY_NET.getString();
    //│
    //○クライアントを切断する
    MY_NET.end();
    //│
    //○処理結果をコンテクストに反映 ← 受信データ(フレーム)
    ctx.base.Frame  = (retFrame == "") ? RCD::Trn3Err : retFrame;
    ctx.base.Result = ctx.base.Frame;
    //┴
  //│
  //○┐【後処理】
    //●コンテクスト・ログを出力する
    adpFnBase::LOG_CTX();
  //┴┴
  } /* SEND_REQUEST() */

//========================================================
//§公開機能
//========================================================
public:
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // コンストラクタ【基本型】
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  AD_HTTP(MmpContext& argCtx) : // 接続識別子：ダミー
  AD_API<String>(     argCtx, AID::HTTP) // 基本型
  {
  //┬
  //○┐【前処理】
    //●初期化の健全性を確認する
    if (SETUP()) return;
    //│＼（問題がある場合）
    //│ ▼終了：早期リターンする
    //┴
  //│
  //○┐【主処理】
    //┴
  //│
  //○┐【後処理】
    //○メッセージ表示
    Log::prtln(" [OK] HTTP");
  //┴┴
  } /* constractor AD_HTTP() */

  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  // ポーリング用ハンドラ
  //━━━━━━━━━━━━━━━━━━━━━━━━━━━
  void handle() override {
  //┬
  //○┐【前処理】
    //●WiFiの接続状況を確認する
    if (!devWiFi::ENABLED_CONN(true)) return;
    //│＼（進行不可の場合）
    //│ ▼終了：早期リターン
    //│
    //●処理フローを制御する
    if (WORKFLOW()) return;
    //│＼（進行不可の場合）
    //│ ▼終了：早期リターン
    //┴
  //│
  //○┐【主処理】
    //●進行状況を[処理済]に進捗する
    modeBridge::MOVE_BSTAT(BSTAT::DONE, "ハンドル応答");
    //┴
  //│
  //○┐【後処理】
  //┴┴
  } /* handle() */

}; /* class AD_HTTP */