// filename : device/member/IIC.cpp
//========================================================
// 通信デバイス部門／担当：IICポート
//--------------------------------------------------------
// Ver 1.2.3 (2026/09/06) IICポートを新設
//========================================================

//########################################################
//# 処理詳細
//########################################################
namespace devIIC {
//========================================================
// 基本情報
//========================================================
  bool ENABLED = false; // 有効判定：有効：true、無効：false

//========================================================
// メイン処理
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 初期化処理
  //----------------------------------
  // 戻り値：処理結果（論理値）
  // ・true ：失敗
  // ・false：成功
  //━━━━━━━━━━━━━━━━━
  void START(){

    int SDA, SCL;

    if      (BOARD == BOARD_ESP32_S3_TINY){SDA=16; SCL=15;}
    else if (BOARD == BOARD_M5STAMP_S3   ){SDA=13; SCL=15;}
    else if (BOARD == BOARD_PICO2W       ){SDA= 4; SCL= 5;}
    else return;
    
    //○IICを開始
    Wire.begin(SDA,SCL);

    //○有効性セット
    Serial.printf("　[OK] IIC       -> SDA[%d],SCL[%d]\n", SDA, SCL);
    ENABLED = true;

  } /* START() */
} /* namespace devUART */