// filename : bridge_adapter/mode/member/_index_.h
//========================================================
// 接続部門／動作モード／担当
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#ifndef MODE_MEMBER_H
#define MODE_MEMBER_H
#pragma once
//┬
//□┐接続部門
  //□┐統括マネージャ
    //□┐担当マネージャ
      //□担当
      #include "bridge.cpp" // ブリッジモード
//┴┴┴┴

//========================================================
// 役割
//========================================================
  namespace modeBridge{void RUN();} // ブリッジモード

#endif // MODE_MEMBER_H
