#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：描画：描画プロセス
#┠─────────────────────────────────────
#┃各オブジェクトのアクション・メソッドを実行する
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import  pyxel
from    main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass

	#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
    #│プロセス実行
	#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
    def 実行(self):
        #┬
        #○画面をクリアする
        pyxel.cls(0)
        #│
        #●描画アクションを実行する
        DS.obj.シーン[ DS.情報.シーン].FN描画.実行()
        #│
        #〇ゲーム情報（得点／難易度）を描画する
        if len(DS.obj.運搬機) > 0:
            pyxel.text( 5, 2, f"TEAM1:{DS.obj.運搬機[0].情報.救出数}", 7)
            pyxel.text(82, 2, f"TEAM2:{DS.obj.運搬機[1].情報.救出数}", 7)
        else:
            pyxel.text( 5, 2, "TEAM1:0", 7)
            pyxel.text(82, 2, "TEAM2:0", 7)
        #┴