#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：描画：描画プロセス
#┠─────────────────────────────────────
#┃各オブジェクトのアクション・メソッドを実行する
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import  pyxel
from    main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│初期化
    #└───────────────────────────────────
    def __init__(self):
        pass

	#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
    #│プロセス実行
	#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
    def 実行(self):
        #┬
        #○画面をクリアする
        pyxel.cls(0)
        #│
        #●描画アクションを実行する
        DS.obj.シーン[ DS.情報.シーン].FN描画.実行()
        #│
        #〇ゲーム情報（得点／難易度）を描画する
        if len(DS.obj.運搬機) > 0:
            救出数1 = DS.obj.運搬機[0].情報.救出数 * 10
            救出数2 = DS.obj.運搬機[1].情報.救出数 * 10
        else:
            救出数1 = 0
            救出数2 = 0
            
        pyxel.text(18, 2, str(救出数1).zfill(4), 7)
        pyxel.text(88, 2, str(救出数2).zfill(4), 7)
        #┴