#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：更新：発射プロセス
#┠─────────────────────────────────────
#┃各オブジェクトのアクション・メソッドを実行する
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
# [ゲーム共通]
from ....データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセス実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●自機を更新(弾を発射)する
        Pアクション(DS.obj.自機)
        #│
        #●敵機を更新(弾を発射)する
        Pアクション(DS.obj.敵機)
        #┴ 

#┌───────────────────────────────────
#│アクション・メソッド実行
#└───────────────────────────────────
def Pアクション(引数_対象一覧): #① 対象オブジェクト一覧(自機/敵機) 
    #┬
    #○対象オブジェクトの中味を確認する
    if not 引数_対象一覧: return
    #│＼（存在しない場合）
    #│ ↓
    #│ ▼処理を中断する
    #│
    #●オブジェクトを発射する
    for 対象 in 引数_対象一覧: 対象.FN発射.実行()
    #┴