#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃コントローラ：更新：発射プロセス
#┠─────────────────────────────────────
#┃各オブジェクトのアクション・メソッドを実行する
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
from main.データセット import データセット as DS

#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃メイン
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
class 本体:
    #┌───────────────────────────────────
    #│プロセス実行
    #└───────────────────────────────────
    def 実行(self):
        #┬
        #●自機を更新(弾を発射)する
        Pアクション(DS.obj.自機)
        #│
        #●敵機を更新(弾を発射)する
        Pアクション(DS.obj.敵機)
        #┴ 

#┌───────────────────────────────────
#│アクション・メソッド実行
#└───────────────────────────────────
def Pアクション(引数_対象オブジェクト): #① 対象オブジェクト一覧(自機/敵機) 
    #┬
    #○対象オブジェクトの中味を確認する
    if not 引数_対象オブジェクト: return
    #│＼（存在しない場合）
    #│ ↓
    #│ ▼処理を中断する
    #│
    #◎└┐発射処理を実行する
    for 各個体 in 引数_対象オブジェクト:
        #│＼（すべての処理を終えた場合）
        #│ ↓
        #│ ▼繰り返し処理を抜ける
        #│
        #≫アクション・メソッドで弾を発射する
        各個体.FN発射.実行()
    #┴　┴