#┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#┃Pythonで実行          ： python ./main.py
#┃リソースエディタ起動  ： pyxel edit ".\main\リソース.pyxres"
#┃Pythonのキャッシュ削除： ./キャッシュ削除.bat ※Windowsで実行
#┠─────────────────────────────────────
#┃<<配線>>
#┃   MMP/PWM側ピン    アダプタピン              フィールド側
#┃
#┃ MMP:0,1-1 (ADC)    ←  [01]  ←   LEDカソード
#┃                        [02] 
#┃                        [03] 
#┃                        [04]
#┃                        [05] 
#┃   PWM:0,2-SIG      →  [06]  →   モータドライバ（DCモータ）
#┃   PWM:0,2-GND      ←  [07]  ←   モータドライバ
#┃                        [08] 
#┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
import main

ゲーム = main.開始()