#====================================================== 
# MECH TORNADO用 テストプログラム
#====================================================== 
import time
import sys; sys.path.append('..'); import 共通.mmpRottenmeier

#────────────────────────────────────    
def 命中確認():

    print("--------")
    print("命中確認")
    print("--------")

    繰返回数 = 100    # アドレス切替回数
    待時間   = 0.05  # ウェイト(秒)

    MMP.アナログ設定(
            1, # 使用するHC4067の個数(1～4)
            2, # 使用するHC4067のPin数(1～16)
            50 # アナログ値の丸め(この数値以下は切り捨て)
            )

    # 電源ON
    for 装置No in range(2): MMP.PWM_VALUE(装置No,4095)
    time.sleep(3)

    # アナログ入力をスキャン
    for 回数 in range(繰返回数):        
        MMP.アナログ読取()
        if 待時間 > 0 : time.sleep(待時間)
        print("  %03i" % 回数,":", MMP.mmpAnaVal)

    # 電源OFF
    for 装置No in range(2): MMP.PWM_VALUE(装置No,-1)

#────────────────────────────────────    
def 電源供給():

    print("--------")
    print("電源供給")
    print("--------")

    for 装置No in range(2): MMP.PWM_VALUE(装置No,4095)
    time.sleep(5)
    for 装置No in range(2): MMP.PWM_VALUE(装置No,-1)

#====================================================== 
# メイン処理
#====================================================== 
#┬
#○MMPを実体化する。
MMP = 共通.mmpRottenmeier.mmp()
#│
#○MMPを接続する。
MMP.通信接続_自動()
#│
#○テストする。
電源供給()
#命中確認()
#│
#○MMPを切断する。
MMP.通信切断()
#┴