// filename : connection/mode/_index_.h
//========================================================
// クライアント接続部門／動作モード
//--------------------------------------------------------
// Ver 1.2.2 (2026/09/04) 
//========================================================
#ifndef CONN_MODE_H
#define CONN_MODE_H
#pragma once

//┬
//□┐クライアント接続部門
  //□┐統括マネージャ
    //□┐担当マネージャ
      //□担当：動作モード
      #include "member/_index_.h"
//┴┴┴┴

//========================================================
// 役割
//========================================================
  //━━━━━━━━━━━━━━━━━
  // 担当マネージャ
  //━━━━━━━━━━━━━━━━━
  #include "manager.cpp"
  namespace mode {void RUN();} 

  #endif // CONN_MODE_H
